&НаСервере
Процедура ВыполнитьКоманду()   Экспорт
	// Фоновое задание тут не нужно, так как клиентской части нет. Поэтому просто вызываем выгрузку. 
	мРез = "";
	ПараметрыВыполнения = Новый Структура;
	// Собственно способ выгрузки тут задавать не обязательно, так как в процедуре выгрузки проверяется
	// наличие параметра "ИдентификаторФормы". Если его нет, значит вызов из регламентного задания,
	// а из него выгрузка идет только на сервер. Но в будущем будет видимо еще хотя бы один параметр: полная 
	// выгрузка или только изменения.
	ПараметрыВыполнения.Вставить("мСпособВыгрузки", 1);   // В регламентном задании всегда будем выгружать на сервер, а не на диск.
	ПараметрыВыполнения.Вставить("ТолькоИзменения", Ложь);   // Это - полная выгрузка.
	мВозврат = Обработки.МК_ВыгрузкаСотрудников.ВыгрузкаСведСотр(ПараметрыВыполнения);     
	Если мВозврат[0] = 1 Тогда       
		Если мВозврат[3] > 0 Тогда
			мРез =  "Выгрузка сведений по сотрудникам завершена. Успешно выгружено записей: "+мВозврат[3];
		Иначе
			мРез = "Сотрудников для выгрузки не найдено.";
		КонецЕсли;	
	ИначеЕсли мВозврат[0] = 0 Тогда
		мРез = "Выгрузка не выполнена: ошибка авторизации.";
	КонецЕсли;	

	Если мВозврат[1] Тогда  // Это значит, что есть люди без e-mail       
		мКолво = мВозврат[2].Количество();
		мРез = мРез + " Есть сотрудники без email - " + мКолво;
		// В регламентной операции (пока!) выводить этих людей не будем. Ограничимся сообщением о том, что они есть и их кол-во.
	КонецЕсли;	
	ИмяСобытия = "МояКоманда. Выгрузка сотрудников";
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, мРез);
КонецПроцедуры  

	