&НаСервере
Процедура ВыполнитьКоманду()   Экспорт   
	// Делаем только если работаем с КЭДО
	
	// Тут выполняется несколько задач:     
	// 1. Синхронизация справочников видов документов (локументы МК и печатные формы 1с)
	// 2. Запрос согласий на КЭДО
	// 3. Запрос изменившихся статусов документов КЭДО
	// 4. Отправка неотправленных документов КЭДО   - >jkmit
	// 5. Получение новых заявлений из МояКоманда
	
	// Делаем только если работаем с КЭДО
	мРаботаСКЭДО = Константы.МК_РаботаемСКЭДО.Получить();
	Если мРаботаСКЭДО Тогда
		мРез = "";
		ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции   
		мФорма = Неопределено;                   
		// Первый пункт - справочники
		ОО.СинхронизацияСправочниковНаСервере();   
		// Согласия КЭДО
		//ОО.СинхСправСотрудникиКЭДО();  
		// Тут и статусы документов КЭДО и согласия обновляются.
		МК_ОбщийМодуль1.МК_ОбновитьСтатусыНаСервере();  
		// Проверка наличия и отправка неотправленных документов КЭДО
		//Справочники.МК_ДокументыКЭДО.ОтправитьНеотправленныеДокументыКЭДО();
	КонецЕсли;	
    ИмяСобытия = "МояКоманда. Синхронизация КЭДО";
	//ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, мРез);
КонецПроцедуры  

