
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЭтаФорма.ВалютаСправочник = Константы.МК_ВалютаСправочник.Получить();
	ЭтаФорма.Валюта = Константы.МК_Валюта.Получить();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВалютаПриИзмененииНаСервере(мВалюта)
	//Константы.МК_ВалютаСправочник.Установить(мВалюта);
	Константы.МК_Валюта.Установить(мВалюта);
КонецПроцедуры


&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	//ВалютаПриИзмененииНаСервере(ЭтаФорма.ВалютаСправочник);
	ВалютаПриИзмененииНаСервере(ЭтаФорма.Валюта);
КонецПроцедуры

