
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЭтаФорма.ВалютаСправочник = Константы.МК_ВалютаСправочник.Получить();
	//ЭтаФорма.Валюта = Константы.МК_Валюта.Получить();
	
	//17.12.2025 Добавление на форму реквзита Валюта с ссылкой на справочник "Валюты"
	ЭтаФорма.МК_ВалютаСправочник = Константы.МК_ВалютаСправочник.Получить();
	//17.12.2025
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВалютаПриИзмененииНаСервере(мВалюта)
	Константы.МК_ВалютаСправочник.Установить(мВалюта);
	//Константы.МК_Валюта.Установить(мВалюта);
КонецПроцедуры


&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере(ЭтаФорма.МК_ВалютаСправочник);
	//ВалютаПриИзмененииНаСервере(ЭтаФорма.Валюта);
КонецПроцедуры

//17.12.2025 Добавление на форму реквзита Валюта с ссылкой на справочник "Валюты"
&НаСервереБезКонтекста
Процедура ВалютаСправочникПриИзмененииНаСервере(мВалютаСправочник)
	Константы.МК_ВалютаСправочник.Установить(мВалютаСправочник);
КонецПроцедуры


&НаКлиенте
Процедура ВалютаСправочникПриИзменении(Элемент)
	ВалютаСправочникПриИзмененииНаСервере(ЭтаФорма.МК_ВалютаСправочник);
КонецПроцедуры
//17.12.2025