
&НаКлиенте
Процедура ВидДокумента1СПриИзменении(Элемент)
	Если Элемент.Родитель.Объект.ВидДокумента1С = ПредопределенноеЗначение("Перечисление.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.Отпуск") Тогда
		Элементы.ВидОтпуска.Доступность = Истина;     
	Иначе		
		Элементы.ВидОтпуска.Доступность = Ложь;  
		Элемент.Родитель.Объект.ВидОтпуска = Неопределено;
	КонецЕсли;
	Если Элемент.Родитель.Объект.ВидДокумента1С = ПредопределенноеЗначение("Перечисление.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.ОтсутствиеССохранениемОплаты") Тогда
		Элементы.ВидВремени.Доступность = Истина;
	Иначе		
		Элементы.ВидВремени.Доступность = Ложь;  
		Элемент.Родитель.Объект.ВидВремени = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ВидДокумента1С = ПредопределенноеЗначение("Перечисление.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.Отпуск") Тогда
		Элементы.ВидОтпуска.Доступность = Истина;   
	Иначе
		Элементы.ВидОтпуска.Доступность = Ложь;  
		Объект.ВидОтпуска = Неопределено;
	КонецЕсли;       
	Если Объект.ВидДокумента1С = ПредопределенноеЗначение("Перечисление.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.ОтсутствиеССохранениемОплаты") Тогда
		Элементы.ВидВремени.Доступность = Истина;   
	Иначе
		Элементы.ВидВремени.Доступность = Ложь;  
		Объект.ВидВремени = Неопределено;
	КонецЕсли;
КонецПроцедуры
