&НаСервере      
Функция ВыгрузкаСведСотр(мПараметры)   Экспорт    
	мМаксКС = Константы.МК_МаксКолвоСотрВВыгрузке.Получить();;    // Максимальное кол-во сотрудников, отправляемых за один раз  
	Если мМаксКС = 0 Тогда                                        // Если 0, то значение по умолчанию - 1000
		мМаксКС = 1000;
	КонецЕсли;	                                                                                                            
	
	ИнтерактивныйРежим = Ложь;      // Нужно знать, как вызвана функция - интерактивно или регламентом в фоне
	мСпособВыгрузки = 1;            // 1 - выгружаем в МояКоменда, 2 - на диск.     
	мВозврат = Новый Массив;     
	мВозврат.Добавить(0);       // 0 Успешность процесса
	мВозврат.Добавить(Ложь);    // 1 Есть ли протокол невыгруженных сотров
	мВозврат.Добавить(0);       // 2 Массив невыгруженных сотров
	мВозврат.Добавить(0);       // 3 Кол-во выгруженных.

	Если мПараметры.Свойство("ИдентификаторФормы") Тогда   // Это значит, что вызов интерактивный, хоть и в фоне
		мДир = мПараметры.мДир;
		мСпособВыгрузки = мПараметры.мСпособВыгрузки;    // 1 - выгружаем в МояКоменда, 2 - на диск. 
		ИнтерактивныйРежим = Истина;    
		мАдресРез1 = мПараметры.мАдрес1;
		мАдресРез2 = мПараметры.мАдрес2;
		мАдресРез3 = мПараметры.мАдрес3;
	КонецЕсли;	 
	мТолькоИзменения = мПараметры.ТолькоИзменения;
	мMODE = "full";
	Если мТолькоИзменения Тогда
		мMODE = "partly";
	КонецЕсли;	

	Если ИнтерактивныйРежим Тогда
		ДлительныеОперации.СообщитьПрогресс("","Выполняется заполнение справочников");
	КонецЕсли;                   
	
	
	Если мСпособВыгрузки = 2 Тогда
		// Надо получить имя временного каталога, в который будем складывать json файлы порций сотрудников перед архивированием.
		// Создадим свой временный каталог в нем. Может не пригодиться.
		мВДир = ПолучитьИмяВременногоФайла();
		мДирВрем = мВДир + "\mVrem\";   // Пишут, что вот так правильно формировать временный каталог
		СоздатьКаталог(мДирВрем);
    КонецЕсли;
	
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	// Первым делом получим нужные организации
	СписокОрганизаций = ОО.ПолучитьСписокОрганизаций();  
	// Тут же получим данные по другим фильтрам выгрузки
	ФильтрСотрудники = ОО.ПолучитьФильтрСотрудники();   // Возвращается массив: {ВидДействия,СписокСотрудников} Вид действия: "0" - не учитывать, "1" - выгружать, "2" - не выгружать.
	ФильтрДолжности = ОО.ПолучитьФильтрДолжности(); 
	ФильтрВидыЗанятости = ОО.ПолучитьФильтрВидыЗанятости(); 
	// Для ГПХ введена еще одна константа - выше уровнем. Редактируется в "секретных настройках".
	мВыгружатьГПХ = Константы.МК_ВыгружатьГПХ.Получить();   
	мКастомныеПоля = Константы.МК_ПрименятьПользовательскиеПоля.Получить();  
	мВыгрузкаПланНач = Константы.МК_ВыгружатьПлановыеНачисления.Получить();
	Если НЕ мВыгружатьГПХ Тогда
		ФильтрВидыЗанятости[2] = "2";
	КонецЕсли;	
		
	// Настройки выгружаемой информации (теперь можно выгружать не все реквизиты).	
	мНВИ = ОО.ПолучитьНастройкиВыгружаемойИнформации();     // Тут массив с элементами "1" или "0".  
	мНВИ[14]="1";  // 16.04.2025. Вид занятости теперь выгружаем обязательно. До этого было не так. 
	
    // Эти переменные нужны для отключения выгрузки справочников, если не выгружаются 
	мВыгружатьДолжности = (мНВИ[4] = "1");         // соответствующие реквизиты.
	мВыгружатьОрганизации = (мНВИ[2] = "1");     
	мВыгружатьГрафики = (мНВИ[20] = "1");    
	// Надо получить константу про выгрузку структуры предприятия
	мСтруктура = Константы.МК_ВыгружатьОргСтруктуру.Получить();
	мВыгружатьСтруктуру = Ложь;
	мВыгружатьПодразделения = Ложь;
	Если мСтруктура Тогда 
		мВыгружатьСтруктуру = (мНВИ[22] = "1");   		
	Иначе	
		мВыгружатьПодразделения = (мНВИ[3] = "1");           
	КонецЕсли;	                                    
	ФильтрСтруктуры = ОО.ПолучитьФильтрСтруктуры();
	ФильтрПодразделения = ОО.ПолучитьФильтрПодразделения();  
	
    мРезультат = Ложь;       
	мКолво = 0;
	// Сведения надо отправлять отдельно: 
	// properties - на адрес /api/1cexchange/users-properties - справочники
	// users - на адрес /api/1cexchange/users-list            - сотрудники
	// departmens - на адрес /api/1cexchange/departments-list - подразделения
	ДатаУвольненияДо = ДобавитьМесяц(НачалоДня(ТекущаяДата()), -1);   // Вообще-то с датами увольнения все сделано в запросе. Но пока оствлю как есть
	
	мНПР = ОО.ПолучитьПереопределяемыеРеквизиты();  // Тут массив значений, которые изменяют переопределяемые реквизиты (пока только ФИО, руководитель отдела и должность)   
	
	// Сначала справочники 
	Выгрузка = Новый Структура;  
	Выгрузка.Вставить("mode",мMODE);	
	Выгрузка.Вставить("Properties",МассивСвойств(СписокОрганизаций,мТолькоИзменения,мВыгружатьОрганизации,мВыгружатьДолжности,мВыгружатьГрафики,мНПР));    // Получили справочники для списка организаций
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
		
	мПрот = Новый Массив;
	Если мСпособВыгрузки = 1 Тогда
		мСеанс = ОО.СоздатьСеансСвязи(ИнтерактивныйРежим);
    	Если мСеанс = Неопределено Тогда
 			// Ошибка авторизации. Ничего не отправляем.
		Иначе         
			Попытка
				ЗаписатьJSON(ЗаписьJSON, Выгрузка);	
				ТекстJSON = ЗаписьJSON.Закрыть();
			Исключение
				Сообщить(ЗначениеВСтрокуВнутр(Выгрузка));
				ВызватьИсключение(ОписаниеОшибки());
			КонецПопытки; 

			мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен).
			hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/user-properties", мСеанс);     
			hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);  
			hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
			hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос); 
			мОтвет = ОО.ПроверитьОтвет(hОтвет,"Справочники",ИнтерактивныйРежим);   // Пока этот мОтвет не анализируется.
		КонецЕсли;	
	Иначе   // Выгружаем на диск.  
		ЗаписатьJSON(ЗаписьJSON, Выгрузка);	
		ТекстJSON = ЗаписьJSON.Закрыть();
        мАдрес1 = ПоместитьВоВременноеХранилище(ТекстJSON,мАдресРез1);
	    мВозврат.Добавить(мАдрес1);
		мВозврат.Добавить(ОО.ПолучитьИмяФайла("Справочники",мДир));
    КонецЕсли;  
	
	
	Если мВыгружатьПодразделения Или мВыгружатьСтруктуру Тогда   
		Выгрузка = Новый Структура;     
		Выгрузка.Вставить("mode",мMODE);                   
		Выгрузка.Вставить("Departments", Новый Массив);
		Если мВыгружатьПодразделения И (мСпособВыгрузки = 2 ИЛИ мСеанс <> Неопределено) Тогда   
			// Теперь отправим подразделения     
		
			СвойствоХэшПодр = ОО.НайтиДопРеквХэшДанных("ПодразделенияОрганизаций");
		
			// Получим подразделения по нужным организациям
			СписокПодразделений = ПолучитьСписокПодразделений(СписокОрганизаций,ФильтрПодразделения, СвойствоХэшПодр, мНПР[3]); // мНПР[3] - способ хранения руководителей подразделений     
			
			// Добавим подразделения в выгрузку.		
			Для Каждого мПодр Из СписокПодразделений Цикл    
				РодительИД = Неопределено;
	
				Если НЕ мПодр.Родитель = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
					РодительИД = СокрЛП(мПодр.Родитель.УникальныйИдентификатор());
				КонецЕсли;
		
				Подразделение = Новый Структура;
				Подразделение.Вставить("id", СокрЛП(мПодр.Ссылка.УникальныйИдентификатор()));
				//Подразделение.Вставить("org_num", СокрЛП(ВыборкаПоПодразделениям.Код));
				Подразделение.Вставить("company",СокрЛП(мПодр.Организация.УникальныйИдентификатор()));
				Подразделение.Вставить("parent", РодительИД);
				Подразделение.Вставить("name", СокрЛП(мПодр.Наименование));
				Подразделение.Вставить("is_removed", мПодр.ПометкаУдаления);
				// Попробуем найти руководителя.
				мНач = "";     
				мНачФЛ="";
				Если ЗначениеЗаполнено(мНПР[3]) Тогда      
					мМодуль = Метаданные.ОбщиеМодули.Найти("РуководителиПодразделений");  
					Если НЕ (мМодуль = Неопределено) Тогда    
						мСсылкаНаМодуль = ОбщегоНазначения.ОбщийМодуль("РуководителиПодразделений");
					Иначе	                                                                        
						мСсылкаНаМодуль = ОбщегоНазначения.ОбщийМодуль("РуководителиПодразделенийОрганизаций");
					КонецЕсли;	
					Если мНПР[3] = Перечисления.МК_СтандартныйРуководительПодразделения.СтРеквФЛ И НЕ (мМодуль = Неопределено) Тогда   // Подключена работа с руководителями подразделений в виде ФизЛица //кабинет сотрудника или "Персонал"
						// Смотрим реквизит "РуководительПодразделения" из выборки. Он - физическое лицо.   
						Если ЗначениеЗаполнено(мПодр.РуководительПодразделения) Тогда
							мНачФЛ = СокрЛП(мПодр.РуководительПодразделения.УникальныйИдентификатор());
							мСписСотр = ОО.СписокСотрудниковПоФизлицу(мПодр.Организация,мПодр.РуководительПодразделения);  // В этой функции подбираются только основные сотрудники или внешние
							Если мСписСотр.Следующий() Тогда                                                               // совместители. Если все хорошо, вернется одна запись. Если больше - нас не волнует,
								мНач = СокрЛП(мСписСотр.СотрудникСсылка.УникальныйИдентификатор());                        // возьмем первого.
							КонецЕсли;	
						КонецЕсли;	
					ИначеЕсли мНПР[3] = Перечисления.МК_СтандартныйРуководительПодразделения.СтРеквПозШР Тогда   // Подключена работа с руководителями подразделений в виде позиции ШР (кабинет сотрудника или "Персонал")						 					                                                  
							
						мПозСтр = мПодр.СтруктураСсылка;
						Если ЗначениеЗаполнено(мПозСтр) Тогда
							//мПозШР = РуководителиПодразделений.ПозицияРуководителя(мПозСтр);       // Тут под подразделением понимается позиция в структуре предприятия.      
							мПозШР = мСсылкаНаМодуль.ПозицияРуководителя(мПозСтр);    
							Если НЕ (мПозШР = Неопределено) Тогда
								мРук = мСсылкаНаМодуль.СотрудникНаПозицииРуководителя(мПозШР);    // Возвращается ссылка на Сотрудника
								Если НЕ (мРук = Неопределено) Тогда                                          
									мНач = СокрЛП(мРук.УникальныйИдентификатор());
									мНачФЛ = СокрЛП(мРук.ФизическоеЛицо.УникальныйИдентификатор());
								КонецЕсли;	
							КонецЕсли;	
						КонецЕсли;	
				 	Иначе	
						мДопСвед = мПодр.ДополнительныеРеквизиты;				
						Для Каждого мСвед Из мДопСвед Цикл   
							Если мСвед.Свойство = мНПР[3] Тогда
								Попытка      
									// Руководитель должен иметь тип ссылки на справочник "Сотрудники".
									мНач = СокрЛП(мСвед.Значение.УникальныйИдентификатор());
									мНачФЛ = СокрЛП(мСвед.Значение.ФизическоеЛицо.УникальныйИдентификатор());
								Исключение
								КонецПопытки;	
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;		
				КонецЕсли;			                                               
				Подразделение.Вставить("head", СокрЛП(мНач));
				Подразделение.Вставить("head_individual", СокрЛП(мНачФЛ));
			
			
				// Проверим необходимость выгрузки, если только изменения.
				ЗаписьJSON = Новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, Подразделение);	
				ПодразделениеJSON = ЗаписьJSON.Закрыть();
			
				ПодразделениеХеш = СокрЛП(ОО.ПолучитьХешСтроки(ПодразделениеJSON));
			
				Изменилось = Ложь;
				Если СокрЛП(мПодр.ВерсияДанныхПодразделений) <> ПодразделениеХеш Тогда
					ДопСвед = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
					ДопСвед.Объект = мПодр.Ссылка;
					ДопСвед.Свойство = СвойствоХэшПодр;
					ДопСвед.Значение = ПодразделениеХеш;
					ДопСвед.Записать();
					Изменилось = Истина;
				КонецЕсли; 
				Если (мТолькоИзменения И Изменилось) ИЛИ НЕ мТолькоИзменения Тогда                                                 
					Выгрузка.Departments.Добавить(Подразделение);			
				КонецЕсли;
			КонецЦикла;   
		ИначеЕсли мВыгружатьСтруктуру Тогда     // Тут выгрузка структуры
			СвойствоХэшПодр = ОО.НайтиДопРеквХэшДанных("СтруктураПредприятия");
		
			// Получим подразделения по нужным организациям
			СписокПодразделений = ПолучитьСтруктуру(ФильтрСтруктуры, СвойствоХэшПодр, мНПР[3]); // мНПР[3] - способ хранения руководителей подразделений     
			
			// Добавим подразделения в выгрузку.		
			Для Каждого мПодр Из СписокПодразделений Цикл    
				РодительИД = Неопределено;
	
				Если НЕ мПодр.Родитель = Справочники.СтруктураПредприятия.ПустаяСсылка() Тогда
					РодительИД = СокрЛП(мПодр.Родитель.УникальныйИдентификатор());
				КонецЕсли;
		
				Подразделение = Новый Структура;
				Подразделение.Вставить("id", СокрЛП(мПодр.Ссылка.УникальныйИдентификатор()));
				//Подразделение.Вставить("org_num", СокрЛП(ВыборкаПоПодразделениям.Код));
				Подразделение.Вставить("company",Неопределено);
				Подразделение.Вставить("parent", РодительИД);
				Подразделение.Вставить("name", СокрЛП(мПодр.Наименование));
				Подразделение.Вставить("is_removed", мПодр.ПометкаУдаления);
				// Попробуем найти руководителя.
				мНач = "";     
				мНачФЛ="";
				Если ЗначениеЗаполнено(мНПР[3]) Тогда      
					мМодуль = Метаданные.ОбщиеМодули.Найти("РуководителиПодразделений");  
					Если НЕ (мМодуль = Неопределено) Тогда    
						мСсылкаНаМодуль = ОбщегоНазначения.ОбщийМодуль("РуководителиПодразделений");
					Иначе	                                                                        
						мСсылкаНаМодуль = ОбщегоНазначения.ОбщийМодуль("РуководителиПодразделенийОрганизаций");
					КонецЕсли;	
											
					Если мНПР[3] = Перечисления.МК_СтандартныйРуководительПодразделения.СтРеквПозШР Тогда   // Подключена работа с руководителями подразделений в виде позиции ШР (кабинет сотрудника или "Персонал"
						мПозШР = мСсылкаНаМодуль.ПозицияРуководителя(мПодр.Ссылка);    
						Если НЕ (мПозШР = Неопределено) Тогда
							мРук = мСсылкаНаМодуль.СотрудникНаПозицииРуководителя(мПозШР);    // Возвращается ссылка на Сотрудника
							Если НЕ (мРук = Неопределено) Тогда                                          
								мНач = СокрЛП(мРук.УникальныйИдентификатор());
								мНачФЛ = СокрЛП(мРук.ФизическоеЛицо.УникальныйИдентификатор());
							КонецЕсли;	
						КонецЕсли;					
				 	Иначе	
						мДопСвед = мПодр.ДополнительныеРеквизиты;				
						Для Каждого мСвед Из мДопСвед Цикл   
							Если мСвед.Свойство = мНПР[3] Тогда
								Попытка      
									// Руководитель должен иметь тип ссылки на справочник "Сотрудники".
									мНач = СокрЛП(мСвед.Значение.УникальныйИдентификатор());
									мНачФЛ = СокрЛП(мСвед.Значение.ФизическоеЛицо.УникальныйИдентификатор());
								Исключение
								КонецПопытки;	
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;	
				КонецЕсли;	
				Подразделение.Вставить("head", СокрЛП(мНач));
				Подразделение.Вставить("head_individual", СокрЛП(мНачФЛ));
				
				// Проверим необходимость выгрузки, если только изменения.
				ЗаписьJSON = Новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, Подразделение);	
				ПодразделениеJSON = ЗаписьJSON.Закрыть();
			
				ПодразделениеХеш = СокрЛП(ОО.ПолучитьХешСтроки(ПодразделениеJSON));
			
				Изменилось = Ложь;
				Если СокрЛП(мПодр.ВерсияДанныхСтруктуры) <> ПодразделениеХеш Тогда
					ДопСвед = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
					ДопСвед.Объект = мПодр.Ссылка;
					ДопСвед.Свойство = СвойствоХэшПодр;
					ДопСвед.Значение = ПодразделениеХеш;
					ДопСвед.Записать();
					Изменилось = Истина;
				КонецЕсли; 
				Если (мТолькоИзменения И Изменилось) ИЛИ НЕ мТолькоИзменения Тогда                                                 
					Выгрузка.Departments.Добавить(Подразделение);			
				КонецЕсли;
			КонецЦикла;  
		КонецЕсли;	
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
			
		Если мСпособВыгрузки = 1 Тогда   
			Попытка
				ЗаписатьJSON(ЗаписьJSON, Выгрузка);	
				ТекстJSON = ЗаписьJSON.Закрыть();
			Исключение
				Сообщить(ЗначениеВСтрокуВнутр(Выгрузка));
				ВызватьИсключение(ОписаниеОшибки());
			КонецПопытки;
			
			hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/department-list", мСеанс);
			hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);                                    
			hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
			hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);
			мОтвет = ОО.ПроверитьОтвет(hОтвет,"Подразделения",ИнтерактивныйРежим);    
		Иначе    // Выгружаем на диск     
			// ОО.ЗаписьВJSONфайл("Подразделения",Выгрузка,мДир);      
			ЗаписатьJSON(ЗаписьJSON, Выгрузка);	
			ТекстJSON = ЗаписьJSON.Закрыть();
	        мАдрес2 = ПоместитьВоВременноеХранилище(ТекстJSON,мАдресРез2);
		    мВозврат.Добавить(мАдрес2);
			мВозврат.Добавить(ОО.ПолучитьИмяФайла("Подразделения",мДир));
		КонецЕсли;	
	Иначе
		мВозврат.Добавить(Неопределено);  // Если подразделения не выгружаем, надо добавить заглушки в возвращаемый массив.
		мВозврат.Добавить(Неопределено);
	КонецЕсли;   
	
	Если мСпособВыгрузки = 2 ИЛИ мСеанс <> Неопределено Тогда 
		// Теперь сотрудники  
		СвойствоХэшСотр = ОО.НайтиДопРеквХэшДанных("Сотрудники");

		// Настройки выгружаемой информации (теперь можно выгружать не все реквизиты).	
		мНВИ = ОО.ПолучитьНастройкиВыгружаемойИнформации();     // Тут массив с элементами "1" или "0".  
		
		мНПР = ОО.ПолучитьПереопределяемыеРеквизиты();          // Тут массив значений, которые изменяют переопределяемые реквизиты (пока только ФИО)   
		
		Выгрузка = Новый Структура; 		
			
		Выгрузка.Вставить("mode",мMODE);
		Выгрузка.Вставить("Users", Новый Массив);                                                                           
		мПарам = Новый Структура("СписокОрганизаций,ФильтрВидыЗанятости,ФильтрПодразделения,ФильтрДолжности,ФильтрСотрудники,ФильтрСтруктуры,СвойствоХэшСотр,мНВИ,
								  |мВыгружатьПодразделения,мВыгружатьСтруктуру",СписокОрганизаций,ФильтрВидыЗанятости,ФильтрПодразделения,ФильтрДолжности,
									ФильтрСотрудники,ФильтрСтруктуры,СвойствоХэшСотр,мНВИ,мВыгружатьПодразделения,мВыгружатьСтруктуру);
		Если мКастомныеПоля Тогда                   
			// Если используем кастомные поля - применяем другой запрос, чтобы не менять ничего для тех, кто не использует.
			ВыборкаСотрудников = СписокСотрудниковКП(мПарам);     // Возвращается таблица значений 
			// Сразу получим список кастомных полей.
			мКПСписок = ПолучитьКастомныеПоля();          
			   
			мВалюта = Константы.МК_ВалютаСправочник.Получить();
			// Надо определить виды контактной информации - адреса.
			мВидАдресПроживания = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Адрес места проживания");
			мВидАдресПоПрописке = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Адрес по прописке");
			мВидАдресЗаПределами = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Адрес за пределами РФ");  
			Если мВидАдресЗаПределами = Неопределено Тогда
				мВидАдресЗаПределами = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Адрес за пределами РК");  
			КонецЕсли;	    
		Иначе	
			ВыборкаСотрудников = СписокСотрудников(мПарам);     // Возвращается таблица значений   
		КонецЕсли;	                                  
		
		Если мВыгрузкаПланНач Тогда    
			// Тут соответствием не обойтись, так как реквизитов три. Поэтому массив структур.    
			мСписНач = ПолучитьСписокПланНач();     // Возвращается массив структур типа: {ВидНачисления, РеквизитМК, ЧтоВыгружать, Показатель,Тип (1-стандарт/0-кастом)}. 
			// На основании полученного массива сделаем заготовку для отправляемых начислений с уникальными значениями ПолеМК
			мПланНач = Новый Соответствие;     
			мПланНачСтандарт = Новый Массив;     
			Для Каждого мНач Из мСписНач Цикл
				мНашли = Ложь;                         
				Если мНач.Тип = 0 Тогда          // Кастомное
					Для Каждого мСтр Из мПланНач Цикл
						Если мНач.РеквизитМК = мСтр.Ключ Тогда
							мНашли = Истина;
						КонецЕсли;								
					КонецЦикла;	 
					Если Не мНашли Тогда
						мПланНач.Вставить(мНач.РеквизитМК,0);
					КонецЕсли;
				Иначе	                         // Стандартное    
					Для Каждого мСтр Из мПланНачСтандарт Цикл
						Если мНач.РеквизитМК = мСтр.ВидНачисления Тогда
							мНашли = Истина;
						КонецЕсли;								
					КонецЦикла;	 
					Если Не мНашли Тогда
						мНачСтандарт = Новый Структура("ВидНачисления, Сумма, Дата", мНач.РеквизитМК,0, Неопределено);
						мПланНачСтандарт.Добавить(мНачСтандарт);
					КонецЕсли;                       
				КонецЕсли;
			КонецЦикла;				
			Если мПланНач.Количество()>0 Или мПланНачСтандарт.Количество()>0 Тогда
				// Надо подготовить массив сотрудников для получения плановых начислений
				мСписСотр = Новый Массив;
				Для Каждого мСотр Из ВыборкаСотрудников Цикл
					мСписСотр.Добавить(мСотр.Ссылка);
				КонецЦикла;	                         
				// Теперь получим плановые начисления
				мПлановыеНачисления = ТекущиеНачисленияСотрудников(мСписСотр, ТекущаяДата(),,);														
				мПоказателиРасчетаЗарплаты = ТекущиеПоказателиСотрудников(мСписСотр, ТекущаяДата());
			КонецЕсли;	     
		КонецЕсли;	
		
		// Считаем настройки контактной информации.
		мВидКонтИнф = ОО.ПолучитьВидыКонтИнф(); // Это массив видов контактной информации 1С: 0 - Осн.Эл.Почта, 1 - Доп.Эл.Почта, 2 - Телефон 
		
		
		// Организуем показ прогресса в работе.
		ВсегоСотр = ВыборкаСотрудников.Количество();
		мнСотр = 0;        
		
		Если ИнтерактивныйРежим Тогда
			ДлительныеОперации.СообщитьПрогресс("","Выполняется обработка списка сотрудников");
		КонецЕсли;	 
		мНомерПорции = 0;
		мКолвоПорции = 0;        
		мОКолво = 0;     // Общее количество выгруженных сотрудников.
		Для Каждого мСотр из ВыборкаСотрудников Цикл 	
			мнСотр = мнСотр+1;
			Если мСотр.ВАрхиве  
				ИЛИ (мСотр.ПоДоговоруГПХ       // У договорников нет дат поступления/увольнения. Вместо них - Начало и Окончание
					И (мСотр.Начало = Дата(1,1,1)
					ИЛИ (мСотр.Окончание > Дата(1,1,1)
					И мСотр.Окончание < ДатаУвольненияДо)))
				ИЛИ (НЕ мСотр.ПоДоговоруГПХ
					И (мСотр.ДатаПриема = Дата(1,1,1) 
					ИЛИ (мСотр.ДатаУвольнения > Дата(1,1,1) 
					И мСотр.ДатаУвольнения < ДатаУвольненияДо)))
				ИЛИ НЕ ЗначениеЗаполнено(мСотр.Ссылка)
				ИЛИ НЕ ЗначениеЗаполнено(мСотр.ОрганизацияСотрудника) Тогда
				Продолжить;
			КонецЕсли; 
			Сотрудник = Новый Структура;   
			Сотрудник.Вставить("id", СокрЛП(мСотр.Ссылка.УникальныйИдентификатор()));   // ID и табельный номер выгружаются всегда.    
			Сотрудник.Вставить("individual_id", СокрЛП(мСотр.ФизЛицоСсылка.УникальныйИдентификатор()));   // ID физлица тоже			
			Сотрудник.Вставить("personnel_number", СокрЛП(мСотр.Код));
			Если мНВИ[2] = "1" Тогда
				Сотрудник.Вставить("company", СокрЛП(мСотр.ОрганизацияСотрудника.УникальныйИдентификатор()));
			КонецЕсли;	            
			//Если мНВИ[3] = "1" Тогда
			Если мВыгружатьПодразделения Тогда
				Сотрудник.Вставить("department", СокрЛП(мСотр.Подразделение.УникальныйИдентификатор()));   
			КонецЕсли;
			Если мВыгружатьСтруктуру Тогда                                                                 
				Сотрудник.Вставить("department", СокрЛП(мСотр.МестоВСтруктуре.УникальныйИдентификатор()));   
			КонецЕсли;	
			мДатаПриема = Неопределено;
			Если мСотр.ПодоговоруГПХ Тогда                                              
				мДатаПриема = мСотр.Начало;   // Этот реквизит нужен при определении даты изменения должности/подразделения
				Если мНВИ[5] = "1" Тогда					
					Сотрудник.Вставить("employment_date",мСотр.Начало);
				КонецЕсли;
				Если мНВИ[6] = "1" Тогда
					Сотрудник.Вставить("date_of_dismissal", ?(мСотр.Окончание <> Дата(1,1,1) И мСотр.Окончание <> Null, мСотр.Окончание, ""));
				КонецЕсли;	
			Иначе                          
				мДатаПриема = мСотр.ДатаПриема;
				Если мНВИ[4] = "1" Тогда
					Сотрудник.Вставить("position", СокрЛП(мСотр.ДолжностьКод.УникальныйИдентификатор()));   
					Если ЗначениеЗаполнено(мНПР[4]) Тогда   // Если есть переназначенная должность
						мДопРекв = мСотр.ДополнительныеРеквизиты;
						Для Каждого мВыбПР из мДопРекв Цикл 
							Если мВыбПР.Свойство = мНПР[4] Тогда
								Сотрудник.position = СокрЛП(мВыбПР.Значение.УникальныйИдентификатор());
							КонецЕсли;	
						КонецЦикла;
					КонецЕсли;	                      					
				КонецЕсли;
				Если мНВИ[5] = "1" Тогда
					Сотрудник.Вставить("employment_date",мСотр.ДатаПриема);
				КонецЕсли;
				Если мНВИ[6] = "1" Тогда
    		       	Сотрудник.Вставить("date_of_dismissal", ?(мСотр.ДатаУвольнения <> Дата(1,1,1) И мСотр.ДатаУвольнения <> Null, мСотр.ДатаУвольнения, ""));
				КонецЕсли;	
			КонецЕсли;	
			
			// ФИО выгружается всегда.
			Сотрудник.Вставить("first_name", СокрЛП(мСотр.Имя));
			Сотрудник.Вставить("last_name", СокрЛП(мСотр.Фамилия));
			// 15.08.2025 А отчество теперь - нет.
			Если мНВИ[9] = "1" Тогда
				Сотрудник.Вставить("middle_name", СокрЛП(мСотр.Отчество)); 
			КонецЕсли;	
			
			//ФИО может быть переопределено на дополнительные реквизиты справочника сотрудников.			
			Если ЗначениеЗаполнено(мНПР[0]) ИЛИ ЗначениеЗаполнено(мНПР[1]) ИЛИ ЗначениеЗаполнено(мНПР[2]) Тогда
				мДопРекв = мСотр.ДополнительныеРеквизиты;
				Для Каждого мВыбПР из мДопРекв Цикл
					Если ЗначениеЗаполнено(мНПР[0]) Тогда
						Если мВыбПР.Свойство = мНПР[0] Тогда
							Сотрудник.Last_name = СокрЛП(мВыбПР.Значение);
						КонецЕсли;
					КонецЕсли;	                      
					Если ЗначениеЗаполнено(мНПР[1]) Тогда
                    	Если мВыбПР.Свойство = мНПР[1] Тогда
							Сотрудник.First_name = СокрЛП(мВыбПР.Значение);
						КонецЕсли;	
					КонецЕсли;		                  
					Если ЗначениеЗаполнено(мНПР[2]) Тогда
						Если мВыбПР.Свойство = мНПР[2] Тогда
							Сотрудник.Middle_name = СокрЛП(мВыбПР.Значение);	
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
					
			Если мНВИ[11] = "1" Тогда
				Сотрудник.Вставить("date_of_birth", ?(мСотр.ДатаРождения <> Дата(1,1,1) И мСотр.ДатаРождения <> Null, мСотр.ДатаРождения, ""));
			КонецЕсли;
			Если мНВИ[12] = "1" Тогда
				Если мСотр.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
					Сотрудник.Вставить("sex", "M");
				ИначеЕсли мСотр.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
					Сотрудник.Вставить("sex", "W");
				Иначе
					Сотрудник.Вставить("sex", "U");
				КонецЕсли;  
			КонецЕсли;
			Если мНВИ[13] = "1" Тогда
				Сотрудник.Вставить("snils", мСотр.СНИЛС);   
			КонецЕсли;	
			// Теперь вид занятости.    
			Если мНВИ[14] = "1" Тогда
				ВидЗ = "5";    // Это неопределено
				Если мСотр.ПоДоговоруГПХ Тогда
					ВидЗ = "4";
				ИначеЕсли ЗначениеЗаполнено(мСотр.ВидЗанятости) Тогда
					Если мСотр.ВидЗанятости = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы Тогда
						ВидЗ="1";
					ИначеЕсли мСотр.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство Тогда   
						ВидЗ = "2";
					ИначеЕсли мСотр.ВидЗанятости = Перечисления.ВидыЗанятости.ВнутреннееСовместительство Тогда
						ВидЗ = "3";
					КонецЕсли;
				КонецЕсли; 
				Сотрудник.Вставить("type_of_employment",ВидЗ);
			КонецЕсли;	
			
			// Сотрудник.Вставить("chief_id", ?(ЗначениеЗаполнено(мСотр.Руководитель),
			// СокрЛП(мСотр.Руководитель.УникальныйИдентификатор()), ""));
			
			
			// Паспорт  
			Если мНВИ[15] = "1" Тогда
				Если ЗначениеЗаполнено(мСотр.ВидДокумента) Тогда
					Попытка
						Сотрудник.Вставить("doc_type", СокрЛП(мСотр.ВидДокумента.КодМВД));
						Сотрудник.Вставить("doc_ser", СокрЛП(мСотр.Серия));
						Сотрудник.Вставить("doc_no", СокрЛП(мСотр.Номер)); 						
						Сотрудник.Вставить("doc_date", Формат(мСотр.ДатаВыдачи,"ДФ=dd.MM.yyyy"));
						Сотрудник.Вставить("doc_kem", мСотр.КемВыдан);
						Сотрудник.Вставить("doc_kodp", мСотр.КодПодразделения);
					Исключение
						мОшибка = Сотрудник.last_name + " "+Сотрудник.first_name + " " + СокрЛП(мСотр.Отчество)+". Проблема с документом, удостоверяющим личность";
						Если ИнтерактивныйРежим Тогда
							Сообщить(мОшибка);	
						Иначе                                                   
							ИмяСобытия = "МояКоманда. Выгрузка сотрудников";
							ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, мОшибка);     
						КонецЕсли;		
					КонецПопытки
				Иначе    
					мОшибка = Сотрудник.last_name + " "+Сотрудник.first_name + " " + СокрЛП(мСотр.Отчество)+". Не указан документ, удостоверяющий личность";
					Если ИнтерактивныйРежим Тогда
						Сообщить(мОшибка);	
					Иначе                                                   
						ИмяСобытия = "МояКоманда. Выгрузка сотрудников";
						ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, мОшибка);     
					КонецЕсли;		
				КонецЕсли;	
			КонецЕсли;	
            мКастомАдресПроживания = "";
			мКастомАдресПоПрописке = "";
			мКастомАдресЗаПределами = "";
			// Контактная информация 
			мСписКонт = мСотр.КонтактнаяИнформация; 
			Для Каждого ВыбКонт из мСписКонт Цикл
				мКонт = СокрЛП(ВыбКонт.Представление);   
				Если ВыбКонт.Вид = мВидКонтИнф[0] Тогда
					// Основной email выгружается всегда
					Сотрудник.Вставить("main_email", мКонт);					
				ИначеЕсли ВыбКонт.Вид = мВидКонтИнф[1] Тогда
					Если мНВИ[16] = "1" Тогда
						Сотрудник.Вставить("dop_email", мКонт);
					КонецЕсли; 
				ИначеЕсли ВыбКонт.Вид = мВидКонтИнф[2] Тогда
					Если мНВИ[18] = "1" Тогда
						Сотрудник.Вставить("phone",мКонт);
					КонецЕсли;	
				Иначе                  
					Если мНВИ[17] = "1" Тогда
						Если ВыбКонт.Вид = мВидКонтИнф[3] Тогда           // Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица Тогда        
							// Представление не подходит для выгрузки. Надо самому формировать строку, чтобы было строго.  					
							Попытка
								мАдрес = ВыбКонт.ЗначенияПолей;  
								мАдрес1 = РаботаСАдресами.КонтактнаяИнформацияВСтруктуруJSON(мАдрес);  
								мАдрес2 = СокрЛП(мАдрес1.ZIPcode)+","+СокрЛП(мАдрес1.country)+ "," + СокрЛП(мАдрес1.area) + "," + СокрЛП(мАдрес1.areaType)+ "," +
										  СокрЛП(мАдрес1.city) + "," + СокрЛП(мАдрес1.cityType) + "," + СокрЛП(мАдрес1.district)+ "," + СокрЛП(мАдрес1.districtType) + "," +
										  СокрЛП(мАдрес1.locality) + "," + СокрЛП(мАдрес1.localityType) + "," + СокрЛП(мАдрес1.street) + "," + СокрЛП(мАдрес1.streetType) + "," +
										  СокрЛП(мАдрес1.houseNumber)+",";
								мНашел = Ложь;	
								// Поищем Корпус в массиве buildings
								Для Каждого мКорп из мАдрес1.buildings Цикл
									Если мКорп.Type = "Корпус" Тогда
										мАдрес2 = мАдрес2 + мКорп.Number+ ",";
										мНашел = Истина;
										Прервать;
									КонецЕсли;	
								КонецЦикла;		
								Если Не мНашел Тогда
									мАдрес2 = мАдрес2+ ",";
								КонецЕсли;	 
						
								// Поищем квартиру в массиве мАдрес1.apartments
								Для Каждого мКв из мАдрес1.apartments Цикл
									Если мКв.Type = "Квартира" Тогда
										мАдрес2 = мАдрес2+ мКв.Number; //+ ","; После квартиры запятая наверное не нужна.
										мНашел = Истина;
										Прервать;
									КонецЕсли;	
								КонецЦикла;		
					    		Сотрудник.Вставить("address", мАдрес2);     
							Исключение  
								// Желательно сообщить, что на этом человеке произошла ошибка разбора адреса.    
								мОшибка = Сотрудник.last_name + " "+Сотрудник.first_name + " " + СокрЛП(мСотр.Отчество)+". Ошибка разбора адреса";
								Если ИнтерактивныйРежим Тогда
									Сообщить(мОшибка);	
								Иначе                                                   
									ИмяСобытия = "МояКоманда. Выгрузка сотрудников";
									ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, мОшибка);     
								КонецЕсли;	
							КонецПопытки;				  
						КонецЕсли;		
					КонецЕсли;	
				КонецЕсли;      
				// Для кастомных полей создадим переменные с адресами: по прописке, проживанию и за пределами страны.
				Если ВыбКонт.Вид = мВидАдресПроживания Тогда
					мКастомАдресПроживания = ВыбКонт; //СокрЛП(ВыбКонт.Представление); 
				ИначеЕсли ВыбКонт.Вид = мВидАдресПоПрописке Тогда	
					мКастомАдресПоПрописке = ВыбКонт; //СокрЛП(ВыбКонт.Представление); 
				ИначеЕсли ВыбКонт.Вид = мВидАдресЗаПределами Тогда		        
					мКастомАдресЗаПределами = СокрЛП(ВыбКонт.Представление); 
				КонецЕсли;	
			КонецЦикла;     
			// Дата изменения должности/подразделения. Если изменений не было, пишем дату поступления. 
			// 12.08.2025 Теперь эта дата выгружается, если выгрузке подлежат или подразделение или должность, или оба.
			//Если мНВИ[19] = "1" Тогда    
			Если мНВИ[4] = "1" ИЛИ мНВИ[3]="1" Тогда    
				мДатИзмДП = мСотр.ДатаИзмененияДП;
				Если мДатИзмДП = NULL Тогда
					мДатИзмДП = мДатаПриема;
				КонецЕсли;	
				Сотрудник.Вставить("appoint_date", Формат(мДатИзмДП,"ДФ=dd.MM.yyyy"));      
			КонецЕсли;
			
			//17.12.2025 Добавление реквизита "currency" в выгрузку сотрудников
			//Если НЕ Константы.МК_ВалютаСправочник.Получить().Пустая() И Константы.МК_ВыгружатьПлановыеНачисления.Получить() = Истина Тогда
			//	Сотрудник.Вставить("currency", Константы.МК_ВалютаСправочник.Получить().Наименование);
			//КонецЕсли;     
			Если НЕ Константы.МК_ВалютаСправочник.Получить().Пустая() И Константы.МК_ВыгружатьПлановыеНачисления.Получить() = Истина Тогда
				Сотрудник.Вставить("currency", Константы.МК_ВалютаСправочник.Получить().Наименование); 
			ИначеЕсли Константы.МК_ВалютаСправочник.Получить().Пустая() И Константы.МК_ВыгружатьПлановыеНачисления.Получить() = Истина Тогда
				Сотрудник.Вставить("currency", "");
			КонецЕсли;
			//17.12.2025
			
			Если мНВИ[20] = "1" Тогда            
				Если ЗначениеЗаполнено(мСотр.ГрафикРаботы) Тогда
					Сотрудник.Вставить("schedule",СокрЛП(мСотр.ГрафикРаботы.УникальныйИдентификатор())); 
				КонецЕсли;	
			КонецЕсли;
			Если мНВИ[21] = "1" Тогда   
				мДистРаб = 0;
				Если мСотр.РаботаетДистанционно Тогда
					мДистРаб = 1;
				КонецЕсли;	
            	Сотрудник.Вставить("dist_rab",мДистРаб);
			КонецЕсли;
			мНужен = Ложь;			
			// Если не задан email авторизации, то не выгружаем.
			Если НЕ Сотрудник.Свойство("main_email")
				ИЛИ НЕ ЗначениеЗаполнено(Сотрудник.main_email) Тогда
				// Тут надо записать информацию в массив мПрот о том, что этого сотрудника не выгрузили.    
				мСтрПрот = Новый Структура;
				мСтрПрот.Вставить("ТабНом",СокрЛП(мСотр.Код));
				мСтрПрот.Вставить("ФИО",Сотрудник.last_name + " "+Сотрудник.first_name + " " + СокрЛП(мСотр.Отчество));  //Сотрудник.middle_name); Отчество в выгрузке может отсутствовать
				мСтрПрот.Вставить("Организация",СокрЛП(мСотр.ОрганизацияСотрудника.Наименование));
				мПрот.Добавить(мСтрПрот);
			Иначе
				мНужен = Истина;
			КонецЕсли;   
			
			Если мНужен и мКастомныеПоля Тогда
				мСписКастом = Новый Массив;
				// Блок кастомных полей
				// мКП = ПолучитьКастомныеПоля();  - мКП получен выше, один раз для всех сотрудников
				Для Каждого мКП Из мКПСписок Цикл   
					Если ЗначениеЗаполнено(мКП.ПолеМК) Тогда
						мЭлемКастом = Новый Структура;
						Если мКП.Метод = "мВалюта" Тогда  
							мЗначение = мВалюта;	
						ИначеЕсли мКП.Метод = "мСНИЛС" Тогда  	
							мЗначение =  мСотр.СНИЛС;          
						ИначеЕсли мКП.Метод = "мИНН" Тогда  	
							мЗначение =  мСотр.ИНН; 	        
						ИначеЕсли мКП.Метод = "мАдресПоПрописке" Тогда  
							Если НЕ мКастомАдресПоПрописке = "" Тогда
								мЗначение = СокрЛП(мКастомАдресПоПрописке.Представление); 	
							Иначе	                                       
								мЗначение = "";		
							КонецЕсли;	
						ИначеЕсли мКП.Метод = "мАдресПоПропискеРегион" Тогда  		
							Если НЕ мКастомАдресПоПрописке = "" Тогда
								мАдрес = мКастомАдресПоПрописке.ЗначенияПолей;  
								мАдрес1 = РаботаСАдресами.КонтактнаяИнформацияВСтруктуруJSON(мАдрес);  
								мЗначение = СокрЛП(мАдрес1.area) + " " + СокрЛП(мАдрес1.areaType);
							Иначе	                                       
								мЗначение = "";		
							КонецЕсли;	
						ИначеЕсли мКП.Метод = "мАдресПроживания" Тогда  	
							Если НЕ мКастомАдресПроживания = "" Тогда
								мЗначение =  СокрЛП(мКастомАдресПроживания.Представление);        
							Иначе	                                       
								мЗначение = "";	
							КонецЕсли;								
						ИначеЕсли мКП.Метод = "мАдресПроживанияРегион" Тогда  		
							Если НЕ мКастомАдресПроживания = "" Тогда
								мАдрес = мКастомАдресПроживания.ЗначенияПолей;  
								мАдрес1 = РаботаСАдресами.КонтактнаяИнформацияВСтруктуруJSON(мАдрес);  
								мЗначение = СокрЛП(мАдрес1.area) + " " + СокрЛП(мАдрес1.areaType);						
							Иначе	                                       
								мЗначение = "";		
							КонецЕсли;	
						ИначеЕсли мКП.Метод = "мАдресЗаПределами" Тогда  	
							мЗначение =  мКастомАдресЗАПределами;	        
						ИначеЕсли мКП.Метод = "мДолжность" Тогда  	
							мЗначение =  мСотр.Должность.Наименование;	
						ИначеЕсли мКП.Метод = "мПодразделение" Тогда  	
							мЗначение =  мСотр.Подразделение.Наименование;	
						ИначеЕсли мКП.Метод = "мКоличествоСтавок" Тогда  	
							мЗначение =  мСотр.КоличествоСтавок;			
						ИначеЕсли мКП.Метод = "мВидЗанятости" Тогда  							
							Если ЗначениеЗаполнено(мСотр.ВидЗанятости) Тогда
								Если мСотр.ВидЗанятости = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы Тогда
									мЗначение = "Основное место работы";
								ИначеЕсли мСотр.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство Тогда   
									мЗначение = "Внешнее совместительство";
								ИначеЕсли мСотр.ВидЗанятости = Перечисления.ВидыЗанятости.ВнутреннееСовместительство Тогда
									мЗначение = "Внутреннее совместительство"; 
								КонецЕсли;	                                   
							Иначе	                                       
								мЗначение = "";	
							КонецЕсли;  
						ИначеЕсли СтрНачинаетсяС(мКП.Метод,"мДокумент1") Тогда
							мЗначение = Неопределено;
							Если ЗначениеЗаполнено(мСотр.Документ1ВидДокумента) Тогда   
								Если мКП.Метод = "мДокумент1Серия" Тогда
									мЗначение = мСотр.Документ1Серия;   
								ИначеЕсли мКП.Метод = "мДокумент1Номер" Тогда
									мЗначение = мСотр.Документ1Номер;        
								ИначеЕсли мКП.Метод = "мДокумент1СерияНомер" Тогда
									мЗначение = СокрЛП(мСотр.Документ1Серия)+ " "+ СокрЛП(мСотр.Документ1Номер);        		
								ИначеЕсли мКП.Метод = "мДокумент1ДатаВыдачи" Тогда
									мЗначение = мСотр.Документ1ДатаВыдачи; 
								ИначеЕсли мКП.Метод = "мДокумент1СрокДействия" Тогда
									мЗначение = мСотр.Документ1СрокДействия;        
								ИначеЕсли мКП.Метод = "мДокумент1КемВыдан" Тогда
									мЗначение = мСотр.Документ1КемВыдан; 
								ИначеЕсли мКП.Метод = "мДокумент1КодПодразделения" Тогда
									мЗначение = мСотр.Документ1КодПодразделения;        
								ИначеЕсли мКП.Метод = "мДокумент1ВидДокумента" Тогда
									мЗначение = мСотр.Документ1ВидДокумента.Наименование; 	
								ИначеЕсли мКП.Метод = "мДокумент1СтранаВыдачи" Тогда
									мЗначение = мСотр.Документ1СтранаВыдачи.Наименование; 		
								КонецЕсли;	
							КонецЕсли;	                                        
						ИначеЕсли СтрНачинаетсяС(мКП.Метод,"мДокумент2") Тогда	
							мЗначение = Неопределено;
							Если ЗначениеЗаполнено(мСотр.Документ2ВидДокумента) Тогда   
								Если мКП.Метод = "мДокумент2Серия" Тогда
									мЗначение = мСотр.Документ2Серия;   
								ИначеЕсли мКП.Метод = "мДокумент2Номер" Тогда
									мЗначение = мСотр.Документ2Номер;        
								ИначеЕсли мКП.Метод = "мДокумент2СерияНомер" Тогда
									мЗначение = СокрЛП(мСотр.Документ2Серия)+ " "+ СокрЛП(мСотр.Документ2Номер);        	
								ИначеЕсли мКП.Метод = "мДокумент2ДатаВыдачи" Тогда
									мЗначение = мСотр.Документ2ДатаВыдачи; 
								ИначеЕсли мКП.Метод = "мДокумент2СрокДействия" Тогда
									мЗначение = мСотр.Документ2СрокДействия;        
								ИначеЕсли мКП.Метод = "мДокумент2КемВыдан" Тогда
									мЗначение = мСотр.Документ2КемВыдан; 
								ИначеЕсли мКП.Метод = "мДокумент2КодПодразделения" Тогда
									мЗначение = мСотр.Документ2КодПодразделения;    
								ИначеЕсли мКП.Метод = "мДокумент2ВидДокумента" Тогда
									мЗначение = мСотр.Документ2ВидДокумента.Наименование; 		
								ИначеЕсли мКП.Метод = "мДокумент2СтранаВыдачи" Тогда
									мЗначение = мСотр.Документ2СтранаВыдачи.Наименование; 			
								КонецЕсли;	
							КонецЕсли;					                        
						ИначеЕсли СтрНачинаетсяС(мКП.Метод,"мДокумент3") Тогда	
							мЗначение = Неопределено;
							Если ЗначениеЗаполнено(мСотр.Документ3ВидДокумента) Тогда   
								Если мКП.Метод = "мДокумент3Серия" Тогда
									мЗначение = мСотр.Документ3Серия;   
								ИначеЕсли мКП.Метод = "мДокумент3Номер" Тогда
									мЗначение = мСотр.Документ3Номер;        
								ИначеЕсли мКП.Метод = "мДокумент3СерияНомер" Тогда
									мЗначение = СокрЛП(мСотр.Документ3Серия)+ " "+ СокрЛП(мСотр.Документ3Номер);        		
								ИначеЕсли мКП.Метод = "мДокумент3ДатаВыдачи" Тогда
									мЗначение = мСотр.Документ3ДатаВыдачи; 
								ИначеЕсли мКП.Метод = "мДокумент3СрокДействия" Тогда
									мЗначение = мСотр.Документ3СрокДействия;        
								ИначеЕсли мКП.Метод = "мДокумент3КемВыдан" Тогда
									мЗначение = мСотр.Документ3КемВыдан; 
								ИначеЕсли мКП.Метод = "мДокумент3КодПодразделения" Тогда
									мЗначение = мСотр.Документ3КодПодразделения;    
								ИначеЕсли мКП.Метод = "мДокумент3ВидДокумента" Тогда
									мЗначение = мСотр.Документ3ВидДокумента.Наименование; 		
								ИначеЕсли мКП.Метод = "мДокумент3СтранаВыдачи" Тогда
									мЗначение = мСотр.Документ3СтранаВыдачи.Наименование; 			
								КонецЕсли;	
							КонецЕсли;			
						ИначеЕсли мКП.Метод = "мВидДоговора" Тогда  	
							Если мСотр.ПоДоговоруГПХ Тогда
								мЗначение = "Договор ГПХ";
							Иначе	                      
								мЗначение = "Трудовой договор";
							КонецЕсли;	
						ИначеЕсли СтрНачинаетсяС(мКП.Метод,"мДоговор") Тогда	
							мЗначение = Неопределено;
							Если ЗначениеЗаполнено(мСотр.НомерДоговораКонтракта) ИЛИ ЗначениеЗаполнено(мСотр.ДатаДоговораКонтракта) Тогда   
								Если мКП.Метод = "мДоговорНомер" Тогда
									мЗначение = мСотр.НомерДоговораКонтракта;   
								ИначеЕсли мКП.Метод = "мДоговорДата" Тогда
									мЗначение = мСотр.ДатаДоговораКонтракта;        							
								КонецЕсли;	
							КонецЕсли;							
						ИначеЕсли СтрНачинаетсяС(мКП.Метод,"мГражданство") Тогда	
							мЗначение = Неопределено;
							Если ЗначениеЗаполнено(мСотр.ГражданствоСтрана) ИЛИ ЗначениеЗаполнено(мСотр.ГражданствоИНН) Тогда   
								Если мКП.Метод = "мГражданствоСтрана" Тогда
									мЗначение = мСотр.ГражданствоСтрана.Наименование;   
								ИначеЕсли мКП.Метод = "мГражданствоИНН" Тогда
									мЗначение = мСотр.ГражданствоИНН;        							
								КонецЕсли;	
							КонецЕсли;		                            
						ИначеЕсли мКП.Метод = "мКодФизЛица" Тогда  	
							мЗначение = мСотр.ФизЛицоСсылка.Код;
						КонецЕсли;				
						Если Не (мЗначение = Неопределено) Тогда 
							мЭлемКастом.Вставить("name",мКП.ПолеМК);
							мЭлемКастом.Вставить("value",мЗначение);					
							мСписКастом.Добавить(мЭлемКастом);
						КонецЕсли;						
					КонецЕсли;	
				КонецЦикла;	  
				Если мВыгрузкаПланНач Тогда
					Если мПланНач.Количество()>0 Тогда    // Кастомные поля в МК
						// Надо предварительно обнулить суммы
						Для Каждого мНач Из мПланНач Цикл    // В мНач (соответствие) ключ - РеквизитМК, значение - сумма к отправке, накапливаемая
							мПланНач.Вставить(мНач.Ключ,0);
						КонецЦикла;	                 
						// Теперь нужно перебрать начисления сотрудника    
						Отбор = Новый Структура;
						Отбор.Вставить("Сотрудник", мСотр.Ссылка);
						мТабНач = мПлановыеНачисления.НайтиСтроки(Отбор);  
						мТабПоказ = мПоказателиРасчетаЗарплаты.Скопировать(Отбор);
						Для Каждого мНач из мТабНач Цикл  										 
							// мТабПоказ: ВидНачисления, РеквизитМК, ЧтоВыгружать, Показатель
							мСтрокаНач = ПоискВМассивеСоответствий(мСписНач,"ВидНачисления",мНач.Начисление,0);
							Если Не (мСтрокаНач = Неопределено) Тогда  // Есть такое начисление в списке.
								мРеквМК = мСтрокаНач.РеквизитМК;
								Если мСтрокаНач.ЧтоВыгружать = Перечисления.МК_ВидыВыгрузки.Размер Тогда							
									мСумма = мПланНач.Получить(мРеквМК)+ мНач.Размер;
									мПланНач.Вставить(мРеквМК,мСумма);							
								Иначе    // Значит нужен не размер, а ПоказательРасчетаЗарплаты. Его надо найти в таблице значений мТабПоказ по виду показателя (отбор по сотруднику уже сделан)																
									мСтрокаПоказ = мТабПоказ.Найти(мСтрокаНач.Показатель);
									Если Не мСтрокаПоказ = Неопределено Тогда        
										мСумма = мПланНач.Получить(мРеквМК)+ мСтрокаПоказ.Значение;									
										мПланНач.Вставить(мРеквМК,мСумма);							
									КонецЕсли;
								КонецЕсли;	
							КонецЕсли	
						КонецЦикла;					
						// Собрали начисления к отправке.           
						Для Каждого мНач Из мПланНач Цикл 
							мЭлемКастом = Новый Структура;
							мЭлемКастом.Вставить("name",мНач.Ключ);
							мЭлемКастом.Вставить("value",мНач.Значение);
							мСписКастом.Добавить(мЭлемКастом);
						КонецЦикла;	
					КонецЕсли;						
				КонецЕсли;	                                              
				Сотрудник.Вставить("custom_fields",мСписКастом);      
			КонецЕсли;		
			
			Если мНужен и мВыгрузкаПланНач Тогда
				Если мПланНачСтандарт.Количество()>0 Тогда                 // Стандартные поля в МК     
					мСписСтандарт = Новый Массив;
					// Надо предварительно обнулить суммы
					Для Каждого мНач Из мПланНачСтандарт Цикл    // В мНач (соответствие) ключ - РеквизитМК, значение - сумма к отправке, накапливаемая
						//мПланНачСтандарт.Вставить(мНач.Ключ,0);
						мНач.Сумма = 0;
						мНач.Дата = Неопределено;
					КонецЦикла;	                 
					// Теперь нужно перебрать начисления сотрудника    
					Отбор = Новый Структура;
					Отбор.Вставить("Сотрудник", мСотр.Ссылка);
					мТабНач = мПлановыеНачисления.НайтиСтроки(Отбор);  
					мТабПоказ = мПоказателиРасчетаЗарплаты.Скопировать(Отбор);  
					мДата = Дата(1, 1, 1); 
					мДатаОкончания = Дата(1, 1, 1); 
					Для Каждого мНач из мТабНач Цикл  										 
						// мТабПоказ: ВидНачисления, РеквизитМК, ЧтоВыгружать, Показатель  
						// мТабПоказ:
						// 29.10.25 Оказывается, что при изменении показателей (например "Оклад"), в регистре плановых навислений
						// дата не изменяется. А меняется она в регистре показателей сотрудников. Поэтому будем для даты начала начислений
						// брать бОльшую дату - из основного показателя или из начисления. Причем самая поздняя дата изменений по сотруднику будет
						// подставляться во все начисления, так как показатель может не измениться, а размер - да. Например при изменении оклада
						// размер РК меняется, а показатель (15%) - нет.
						мСтрокаНач = ПоискВМассивеСоответствий(мСписНач,"ВидНачисления",мНач.Начисление,1);
						Если Не (мСтрокаНач = Неопределено) Тогда  // Есть такое начисление в списке.
							мРеквМК = мСтрокаНач.РеквизитМК;
							мСтрока =  ПоискВМассивеСтруктур(мПланНачСтандарт,"ВидНачисления",мРеквМК); 
							Если Не мСтрока = Неопределено Тогда  
								Если мНач.ПериодЗаписи > мДата Тогда
									//мСтрока.Дата = мНач.ПериодЗаписи;
									мДата = мНач.ПериодЗаписи;
								КонецЕсли;									
								Если мСтрокаНач.ЧтоВыгружать = Перечисления.МК_ВидыВыгрузки.Размер Тогда	
									мСтрока.Сумма = мСтрока.Сумма + мНач.Размер;       											
								Иначе    // Значит нужен не размер, а ПоказательРасчетаЗарплаты. Его надо найти в таблице значений мТабПоказ по виду показателя (отбор по сотруднику уже сделан)																
									мСтрокаПоказ = мТабПоказ.Найти(мСтрокаНач.Показатель);
									Если Не мСтрокаПоказ = Неопределено Тогда        
										мСтрока.Сумма = мСтрока.Сумма + мСтрокаПоказ.Значение;																	
									КонецЕсли;
								КонецЕсли;	
								// Проверяем дату основного показателя
								мСтрокаПоказ = мТабПоказ.Найти(мНач.ОсновнойПоказатель);
								Если (Не мСтрокаПоказ = Неопределено) Тогда
									Если мСтрокаПоказ.ПериодЗаписи > мДата  Тогда        
										мДата = мСтрокаПоказ.ПериодЗаписи;																	
									КонецЕсли;                           
									Если Не (мСтрокаПоказ.ДатаОкончания = Дата("31.12.3999 23:59:59")) И мСтрокаПоказ.ДатаОкончания > мДатаОкончания Тогда  // Дата окончания есть
										мДатаОкончания = мСтрокаПоказ.ДатаОкончания;
									КонецЕсли;	
								КонецЕсли;	

							КонецЕсли;	
						КонецЕсли	
					КонецЦикла;					
					// Собрали начисления к отправке.  
					Если мДата = Дата(1, 1, 1) Тогда
						мДата = Неопределено;
					КонецЕсли;	
					Если мДатаОкончания = Дата(1, 1, 1) Тогда
						мДатаОкончания = Неопределено;
					КонецЕсли;	
					Для Каждого мНач Из мПланНачСтандарт Цикл 
						мЭлемСтандарт = Новый Структура;
						мЭлемСтандарт.Вставить("name",мНач.ВидНачисления);
						мЭлемСтандарт.Вставить("value",мНач.Сумма);						
						мЭлемСтандарт.Вставить("date",мДата);
						мЭлемСтандарт.Вставить("date_end",мДатаОкончания);
						мСписСтандарт.Добавить(мЭлемСтандарт);
					КонецЦикла;					
					Сотрудник.Вставить("planned_salary",мСписСтандарт);      
				КонецЕсли;	   			
			КонецЕсли;	   			
			
			Если мНужен Тогда		
				// Сравнение с предыдущими выгруженными данными
				ЗаписьJSON = Новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, Сотрудник);	
				СотрудникJSON = ЗаписьJSON.Закрыть();
			
				СотрудникХеш = СокрЛП(ОО.ПолучитьХешСтроки(СотрудникJSON));
			
				Изменилось = Ложь;
				Если СокрЛП(мСотр.ВерсияДанныхСотрудника) <> СотрудникХеш Тогда
					ДопСвед = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
					ДопСвед.Объект = мСотр.Ссылка;
					ДопСвед.Свойство = СвойствоХэшСотр;
					ДопСвед.Значение = СотрудникХеш;
					ДопСвед.Записать();
					Изменилось = Истина;
				КонецЕсли; 
                Если (мТолькоИзменения И Изменилось) ИЛИ НЕ мТолькоИзменения Тогда 
					Выгрузка.Users.Добавить(Сотрудник);
					мКолвоПорции = мКолвоПорции + 1;
					Если мКолвоПорции = мМаксКС Тогда     
						мНомерПорции = мНомерПорции + 1;
						Если мСпособВыгрузки = 1 Тогда        // На сайт
							мРезультат = ОтправитьСотрудников(Выгрузка,мСеанс,ОО,ИнтерактивныйРежим);   // Отправляем порцию сотрудников           														
						Иначе	                             // В файл
							мРезультат = СохранитьПорциюНаДиск(Выгрузка,мНомерПорции,мДирВрем);
						КонецЕсли;
						мОКолво = мОКолво + мКолвоПорции;
						мКолвоПорции = 0;
						Выгрузка.Users.Очистить();
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			ПроцВып = Окр(мнСотр/ВсегоСотр*100,0);
		
			// Cообщаем "процент" и "текст сообщения"
			Если ИнтерактивныйРежим Тогда
				ДлительныеОперации.СообщитьПрогресс(ПроцВып,"Выполняется обработка списка сотрудников");
            КонецЕсли;
		КонецЦикла;  
		// Сведения по сотрудникам подобраны. Пока все.
		// Надо отправить.   
		мКолво = Выгрузка.Users.Количество();
		Если мКолво > 0 Тогда              
			мОКолво = мОКолво + мКолво;
			Если мСпособВыгрузки = 1 Тогда               				
				мРезультат = ОтправитьСотрудников(Выгрузка,мСеанс,ОО,ИнтерактивныйРежим);
			Иначе    // Выгрузка в файл.                                                     
				ДлительныеОперации.СообщитьПрогресс("","Файл копируется в указанный каталог");   
				Если мНомерПорции = 0 Тогда          // Если ни одной порции еще не было сохранено, то отправляем JSON файл.                             
					ЗаписьJSON = Новый ЗаписьJSON;     				
					ЗаписьJSON.УстановитьСтроку();
        			ЗаписатьJSON(ЗаписьJSON, Выгрузка);	
					ТекстJSON = ЗаписьJSON.Закрыть();
					мАдрес3 = ПоместитьВоВременноеХранилище(ТекстJSON,мАдресРез3);
			    	мВозврат.Добавить(мАдрес3);
					мВозврат.Добавить(ОО.ПолучитьИмяФайла("Сотрудники",мДир));					                         
				Иначе	
					мНомерПорции = мНомерПорции + 1;
					мРезультат = СохранитьПорциюНаДиск(Выгрузка,мНомерПорции,мДирВрем);				
				КонецЕсли;	         				
			КонецЕсли;	
		КонецЕсли;
		// Может получиться, что в последней порции ничего нет. Поэтому формирование архива с файлами-порциями по сотрудникам
		// надо выполнить сейчас
		Если мСпособВыгрузки = 2 И мНомерПорции <> 0 Тогда  
			ИмяАрхива = мДирВрем + "\Сотрудники"+"_"+ОО.ДатаВСтроку(ТекущаяДата())+".zip";
			мАрхив = Новый ЗаписьZipФайла(ИмяАрхива,"", "Выгрузка сотрудников",МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Оптимальный, МетодШифрованияZIP.Zip20);
			мАрхив.Добавить(мДирВрем+"*.json");
			мАрхив.Записать();
			
			мФайлАрхив = Сред(ИмяАрхива, СтрНайти(ИмяАрхива, "\", НаправлениеПоиска.СКонца) + 1);     // Выделяем только имя файла
			Попытка          	    	 
				Двоичное=Новый ДвоичныеДанные(ИмяАрхива);
				мАдрес3 = ПоместитьВоВременноеХранилище(Двоичное,мАдресРез3);     
				мВозврат.Добавить(мАдрес3);      // Адрес zip-архива.
				мВозврат.Добавить(мФайлАрхив);   // Имя файла уже вычислено. Передаем.
			Исключение    
				мРезультат = Ложь;
				мВозврат.Добавить(Неопределено);
				мВозврат.Добавить(Неопределено);
			КонецПопытки;	
         КонецЕсли;	
	КонецЕсли;                               
		                     
	
	// Возвращать будем массив. 
	// первый элемент - успешность процесса
	// второй - список сотрудников без емэйл не пустой.
	// третий - кол-во выгруженных сотрудников.
	Если мСпособВыгрузки =1 Тогда
		Если мРезультат Тогда
			мРез = 1;        
		Иначе
			мРез = 0;
		КонецЕсли;	
	Иначе 
		мРез = 2;        
	КонецЕсли;	
	мВозврат[0] = мРез;
	лПрот = Ложь;
	Если мПрот.Количество() > 0 Тогда
		лПрот = Истина;
	КонецЕсли;	       
	мВозврат[1] = лПрот;   
	Если лПрот Тогда
		мВозврат[2] = мПрот;
	КонецЕсли;	
	мВозврат[3] = мОКолво;   
	Если лПрот Тогда
		мВозврат.Добавить(мПрот);
	КонецЕсли;	
	// Еще 6 элементов добавляются выше - имена и адреса созданных файлов для выгрузки на диск.
	Возврат мВозврат;
КонецФункции        

Функция ОтправитьСотрудников(Выгрузка,мСеанс,ОО,ИнтерактивныйРежим)     // В связи с отправкой сотрудников порциями, процесс отправки вынесен в отдельную функцию.
	Если ИнтерактивныйРежим Тогда
		ДлительныеОперации.СообщитьПрогресс("","Сведения отправляются на сайт МояКоманда");
	КонецЕсли;	
	Попытка  
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
        ЗаписатьJSON(ЗаписьJSON, Выгрузка);	
		ТекстJSON = ЗаписьJSON.Закрыть();
		//ТекстJSON = ЗаписатьЗначениеJSON(Выгрузка);
	Исключение                                                          
		Сообщить(ЗначениеВСтрокуВнутр(Выгрузка));
		ВызватьИсключение(ОписаниеОшибки());
	КонецПопытки;

	hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/user-list", мСеанс);  
	hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
	hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);   
	// Изменение в логике создания запросов. Бывают ситуации, когда запрос не успевает обработаться и обрывается по тайм-ауту. Поэтому 
	// переходим на серию запросов, которые надо запускать через некоторую паузу, до получения окончательного результата.				
	мРезультат = ОО.ВызватьhМетод("POST", мСеанс, hЗапрос,"/api/1c-exchange/user-list", "Сотрудники", ИнтерактивныйРежим);
	Возврат мРезультат;
КонецФункции

Функция СохранитьПорциюНаДиск(Выгрузка,мНомерПорции,мДир);
	ИмяФайла = мДир+"Сотрудники"+мНомерПорции+".json";
	ЗаписьJSON = Новый ЗаписьJSON;  
	ЗаписьJSON.ОткрытьФайл(ИмяФайла);
	ЗаписатьJSON(ЗаписьJSON,Выгрузка); 
	ЗаписьJSON.Закрыть();
КонецФункции

Функция МассивСвойств(СписокОрганизаций,мТолькоИзменения,мВыгружатьОрганизации,мВыгружатьДолжности,мВыгружатьГрафики, мНПР);
	// Тут заполним небольшие справочники и перечисления, передаваемые в МоюКоманду
	// По просьбе клиента массив убираем. Свойства сразу добавляются в структуру.
	// Первый элемент - виды занятости.
	Элемент = Новый Структура;
	ВидыЗанятости = Новый Соответствие;
	ВидыЗанятости.Вставить("1","Основное");
	ВидыЗанятости.Вставить("2","Внешнее совместительство");   
	ВидыЗанятости.Вставить("3","Внутреннее совместительство");
	ВидыЗанятости.Вставить("4","ГПХ");
	ВидыЗанятости.Вставить("5","Не определено");
	Элемент.Вставить("type_of_employment",ВидыЗанятости);
	
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	СвойствоХэшДолжн = ОО.НайтиДопРеквХэшДанных("Должности");  
	
	Если мВыгружатьОрганизации Тогда
		// Теперь - краткий справочник организаций. Пока поживет.
		Организации = Новый Соответствие;   
		Для Каждого Организация Из СписокОрганизаций Цикл     
			Организации.Вставить(СокрЛП(Организация.Значение.УникальныйИдентификатор()),Организация.Значение.Наименование);
		КонецЦикла;    
		Элемент.Вставить("company",Организации);
	
		// Теперь - полный справочник организаций.
		СвойствоХэшОрг = ОО.НайтиДопРеквХэшДанных("Организации");  
		Организации = Новый Массив();                              
	
		мСписОрг = СписокОрганизацийПолный(СписокОрганизаций, СвойствоХэшОрг); 
		// Добавим организации в выгрузку.
		Пока мСписОрг.Следующий() Цикл
			мОрг = Новый Структура;
			мОрг.Вставить("id", СокрЛП(мСписОрг.Ссылка.УникальныйИдентификатор()));
			мОрг.Вставить("pname",СокрЛП(мСписОрг.НаименованиеПолное));
			мОрг.Вставить("sname",СокрЛП(мСписОрг.НаименованиеСокращенное));
			мОрг.Вставить("inn",мСписОрг.ИНН);
			мОрг.Вставить("kpp",мСписОрг.КПП);
			мОрг.Вставить("ogrn",мСписОрг.ОГРН);
			// Руководителя запросом не выходит получать, так как к комплексной автоматизации нет регистра ответственных лиц.  
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.СведенияОбОтветственныхЛицах") Тогда
				// Это запрос сведений о руководителе в ЗУП
				мДРук = ЗарплатаКадры.ОтветственныеЛицаОрганизации(мСписОрг.Ссылка, "Руководитель,ДолжностьРуководителя", ТекущаяДатаСеанса());
			Иначе 
				// А тут - для комплексной.  
				мДРук = ПолучитьДанныеРуководителя(мСписОрг.Ссылка, ТекущаяДатаСеанса());
			КонецЕсли;	
			// Из запроса приходит ссылка на физическое лицо. По ней нам надо найти сотрудника, так как МояКоманда ничего о физлицах не знает. 
			мСотрРук = Неопределено;
			мДолжнРук = Неопределено;
			Если ЗначениеЗаполнено(мДРук.Руководитель) Тогда;    
				мОрг.Вставить("head_individual",СокрЛП(мДРук.Руководитель.УникальныйИдентификатор()));   // Теперь и ID физлица тоже передается.
			 	мСписСотр = ОО.СписокСотрудниковПоФизлицу(мСписОрг.Ссылка,мДРук.Руководитель);  // В этой функции подбираются только основные сотрудники или внешние
				Если мСписСотр.Следующий() Тогда                                                // совместители. Если все хорошо, вернется одна запись. Если больше - нас не волнует,
					мСотрРук = мСписСотр.СотрудникСсылка;                                       // возьмем первого.
			 		мДолжнРук = мСписСотр.ДолжностьСсылка;
			 		мВидЗан = мСписСотр.ВидЗанятости;
			 	КонецЕсли;	
			 	Если ЗначениеЗаполнено(мСотрРук) Тогда
			 		мОрг.Вставить("head",СокрЛП(мСотрРук.УникальныйИдентификатор()));
			 	КонецЕсли;	
			 КонецЕсли;	
			 // Должность руководителя может быть не указана в регистре ответственных лиц. В этом случае ее видимо надо извлечь из сотрудника.
        	 Если ЗначениеЗаполнено(мДРук.ДолжностьРуководителя) Тогда
			 	мОрг.Вставить("head_position",СокрЛП(мДРук.ДолжностьРуководителя.УникальныйИдентификатор())); 
			 ИначеЕсли ЗначениеЗаполнено(мДолжнРук) Тогда
			 	мОрг.Вставить("head_position",СокрЛП(мДолжнРук.УникальныйИдентификатор())); 
			 КонецЕсли;
		
			// Проверим необходимость выгрузки, если только изменения.
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, мОрг);	
			ОрганизацияJSON = ЗаписьJSON.Закрыть();
				
			ОрганизацияХеш = СокрЛП(ОО.ПолучитьХешСтроки(ОрганизацияJSON));
			
			Изменилось = Ложь;
			Если СокрЛП(мСписОрг.ВерсияДанныхОрганизаций) <> ОрганизацияХеш Тогда
				ДопСвед = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				ДопСвед.Объект = мСписОрг.Ссылка;
				ДопСвед.Свойство = СвойствоХэшОрг;
				ДопСвед.Значение = ОрганизацияХеш;
				ДопСвед.Записать();
				Изменилось = Истина;
			КонецЕсли; 
			Если (мТолькоИзменения И Изменилось) ИЛИ НЕ мТолькоИзменения Тогда                                                 
				Организации.Добавить(мОрг);			
			КонецЕсли;
		КонецЦикла;   
		Элемент.Вставить("company_full",Организации);	
	КонецЕсли;
	
	Если мВыгружатьДолжности Тогда
		ФильтрДолжности = ОО.ПолучитьФильтрДолжности(); 
		// Теперь список должностей
		СписокДолжностей = ПолучитьСписокДолжностей(ФильтрДолжности, СвойствоХэшДолжн);
		Должности = Новый Соответствие;   
		Пока СписокДолжностей.Следующий() Цикл     
			// Тут надо проверить - нужно отправлять или нет, если только изменения.
			// Сравнение с предыдущими выгруженными данными   
			мСтрока = Новый Структура;
			мСтрока.Вставить("id",СокрЛП(СписокДолжностей.Ссылка.УникальныйИдентификатор()));
			мСтрока.Вставить("name",СписокДолжностей.Ссылка.Наименование);
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, мСтрока);	
			ДолжностьJSON = ЗаписьJSON.Закрыть();
			
			ДолжностьХеш = СокрЛП(ОО.ПолучитьХешСтроки(ДолжностьJSON));
			
			Изменилось = Ложь;
			Если СокрЛП(СписокДолжностей.ВерсияДанныхДолжности) <> ДолжностьХеш Тогда
				ДопСвед = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				ДопСвед.Объект = СписокДолжностей.Ссылка;
				ДопСвед.Свойство = СвойствоХэшДолжн;
				ДопСвед.Значение = ДолжностьХеш;
				ДопСвед.Записать();
				Изменилось = Истина;
			КонецЕсли; 
			Если (мТолькоИзменения И Изменилось) ИЛИ НЕ мТолькоИзменения Тогда                                                 
				Должности.Вставить(СокрЛП(СписокДолжностей.Ссылка.УникальныйИдентификатор()),СписокДолжностей.Ссылка.Наименование);			
			КонецЕсли;
		КонецЦикла;    		
		// Могут быть еще "кастомные" должности в виде дополнительных реквизитов к справочникам сотрудников или физлиц.
		// Они хранятся в справочнике "ЗначенияСвойствОбъектов".
		Если ЗначениеЗаполнено(мНПР[4]) Тогда
			СписокДолжностей = ПолучитьКастомныеДолжности(мНПР[4]); 
			Пока СписокДолжностей.Следующий() Цикл   
				Должности.Вставить(СокрЛП(СписокДолжностей.Ссылка.УникальныйИдентификатор()),СписокДолжностей.Ссылка.Наименование);			
			КонецЦикла;	                           			
		КонецЕсли;                                 
		Элемент.Вставить("positions",Должности);   
	КонецЕсли;
	
	ТипыДок = Новый Соответствие;
	ТипыДок.Вставить("03","Свидетельство о рождении");
	ТипыДок.Вставить("07","Военный билет");
	ТипыДок.Вставить("08","Временное удостоверение, выданное взамен военного билета");
	ТипыДок.Вставить("10","Паспорт иностранного гражданина");
	ТипыДок.Вставить("11","Свидетельство о рассмотрении ходатайства о признании лица беженцем на территории РФ по существу");
	ТипыДок.Вставить("12","Вид на жительство в РФ");
	ТипыДок.Вставить("13","Удостоверение беженца");
	ТипыДок.Вставить("14","Временное удостоверение личности гражданина РФ");
	ТипыДок.Вставить("15","Разрешение на временное проживание в РФ");
	ТипыДок.Вставить("19","Свидетельство о предоставлении временного убежища на территории РФ");
	ТипыДок.Вставить("21","Паспорт гражданина РФ");
	ТипыДок.Вставить("22","Загранпаспорт гражданина РФ");
	ТипыДок.Вставить("23","Свидетельство о рождении, выданное уполномоченным органом иностранного государства");
	ТипыДок.Вставить("24","Удостоверение личности военнослужащего РФ");
	ТипыДок.Вставить("27","Военный билет офицера запаса");
	ТипыДок.Вставить("91","Иные документы");
	
	Элемент.Вставить("types_of_doc",ТипыДок);

	// Теперь основания увольнения
	СписокОснУвол = ПолучитьОснованияУвольнения();
	ОснУвол = Новый Соответствие;   
	Пока СписокОснУвол.Следующий() Цикл     
		ОснУвол.Вставить(СокрЛП(СписокОснУвол.Ссылка.УникальныйИдентификатор()),СписокОснУвол.Ссылка.Наименование); //,СписокОснУвол.Статья);
	КонецЦикла;    
	Элемент.Вставить("GroundDismiss",ОснУвол);       
	
	// Теперь графики работы     
	Если мВыгружатьГрафики Тогда
		СвойствоХэшГраф = ОО.НайтиДопРеквХэшДанных("ГрафикиРаботыСотрудников");    
		мГрафики = Новый Массив();
		мСписГраф = ПолучитьГрафики(СвойствоХэшГраф);                                 
		Пока мСписГраф.Следующий() Цикл
			мГраф = Новый Структура;
			мГраф.Вставить("id", СокрЛП(мСписГраф.Ссылка.УникальныйИдентификатор()));
			мГраф.Вставить("name",СокрЛП(мСписГраф.Ссылка.Наименование));
			// Неполное рабочее время
			Если мСписГраф.НРВ Тогда
				мНРВ = 1;
			Иначе     
				мНРВ = 0;
			КонецЕсли;	
			мГраф.Вставить("nrab_vrem",мНРВ);
			// Неполная рабочая неделя 
			Если мСписГраф.НРН Тогда
				мНРН = 1;
			Иначе     
				мНРН = 0;
			КонецЕсли;	
    	    мГраф.Вставить("nrab_ned",мНРН);
			// Неполный рабочий день
			Если мСписГраф.НРД Тогда
				мНРД = 1;
			Иначе     
				мНРД = 0;
			КонецЕсли;	
    	    мГраф.Вставить("nrab_den",мНРД);
		
				
			// Проверим необходимость выгрузки, если только изменения.
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, мГраф);	
			ГрафикJSON = ЗаписьJSON.Закрыть();
				
			ГрафикХеш = СокрЛП(ОО.ПолучитьХешСтроки(ГрафикJSON));
			
			Изменилось = Ложь;
			Если СокрЛП(мСписГраф.ВерсияДанныхГрафиков) <> ГрафикХеш Тогда
				ДопСвед = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				ДопСвед.Объект = мСписГраф.Ссылка;
				ДопСвед.Свойство = СвойствоХэшГраф;
				ДопСвед.Значение = ГрафикХеш;
				ДопСвед.Записать();
				Изменилось = Истина;
			КонецЕсли; 
			Если (мТолькоИзменения И Изменилось) ИЛИ НЕ мТолькоИзменения Тогда                                                 
				мГрафики.Добавить(мГраф);			
			КонецЕсли;
		КонецЦикла;   
		Элемент.Вставить("schedule",мГрафики);	
	КонецЕсли;
	// Готово, все собрали
    Возврат Элемент;
КонецФункции

Функция ПолучитьДанныеРуководителя(Организация, Дата = Неопределено) Экспорт // Это для комплексной автоматизации
	
	ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель;
	Модуль = ОбщегоНазначения.ОбщийМодуль("ОтветственныеЛицаСервер");
	
	СтруктураОтветственных = Модуль.ПолучитьОтветственныеЛицаОрганизации(Организация, Дата);
	Результат 			   = Новый Структура();
	
	Для Каждого МетаВидОтветственного Из Метаданные.Перечисления.ОтветственныеЛицаОрганизаций.ЗначенияПеречисления Цикл
		
		Ключ = МетаВидОтветственного.Имя;
		Если ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций[Ключ] Тогда
			Результат.Вставить("Руководитель", СтруктураОтветственных[Ключ]);
			Результат.Вставить("ДолжностьРуководителя", СтруктураОтветственных[Ключ + "ДолжностьСсылка"]);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьСписокПодразделений(СписокОрганизаций,ФильтрПодразделения, СвойствоХэш, мСпосХрПодр)  
	УстановитьПривилегированныйРежим(Истина);
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Организации", СписокОрганизаций);
	мЗапрос.УстановитьПараметр("ДатаВыборки", ТекущаяДата());
	мЗапрос.УстановитьПараметр("СвойствоХэш", СвойствоХэш);
	
	мЗапрос.Текст = 
		"ВЫБРАТЬ
		|	мРуководители.Подразделение КАК Подразделение,
		|	мРуководители.Руководитель КАК Руководитель  
		|ПОМЕСТИТЬ ВТРуководители
		|ИЗ 
		|	РегистрСведений.ПодразделенияОрганизацииРуководители.СрезПоследних(&ДатаВыборки) КАК мРуководители;	
		|
		|ВЫБРАТЬ
		|   ПодразделенияОрганизаций.Ссылка КАК Ссылка,
		|	ПодразделенияОрганизаций.Владелец КАК Организация,
		|	ПодразделенияОрганизаций.Родитель КАК Родитель,
		|	ПодразделенияОрганизаций.Код КАК Код,
		|	ПодразделенияОрганизаций.Родитель.Код КАК РодительКод,
		|	ПодразделенияОрганизаций.ПометкаУдаления КАК ПометкаУдаления,
		|	ПодразделенияОрганизаций.Наименование КАК Наименование,
		|	ЕСТЬNULL(ДопСведВерсияДанных.Значение, """") КАК ВерсияДанныхПодразделений,	
		|	ЕСТЬNULL(ВТРуководители.Руководитель,"""") КАК РуководительПодразделения,
		|	ЕСТЬNULL(СтруктураПредприятия.Ссылка,"""") КАК СтруктураСсылка,		
		|	ПодразделенияОрганизаций.ДополнительныеРеквизиты.(
		|		Свойство КАК Свойство,
		|		Свойство.Имя КАК Имя,
		|		Значение КАК Значение
		|	) КАК ДополнительныеРеквизиты 
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций  
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСведВерсияДанных
		|	ПО (ДопСведВерсияДанных.Свойство = &СвойствоХэш)
		|		И (ДопСведВерсияДанных.Объект = ПодразделенияОрганизаций.Ссылка) 
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРуководители
		|	ПО ВТРуководители.Подразделение = ПодразделенияОрганизаций.Ссылка              
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|   По СтруктураПредприятия.Источник = ПодразделенияОрганизаций.Ссылка              
		|ГДЕ
		|	ПодразделенияОрганизаций.Владелец В (&Организации)
		|   И ПодразделенияОрганизаций.Расформировано = Ложь 
		|	И (ПодразделенияОрганизаций.ДатаРасформирования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
    	|	ИЛИ ПодразделенияОрганизаций.ДатаРасформирования > &ДатаВыборки)
		|   И НЕ ПодразделенияОрганизаций.Ссылка.ПометкаУдаления
		|   &УсловияФильтров";                                                  
	
	мТекст = "";
	Если ФильтрПодразделения[0] <> "0" Тогда          
		мЗапрос.УстановитьПараметр("Подразделения",ФильтрПодразделения[1]);	
		Если НЕ ПустаяСтрока(мТекст) Тогда
			мТекст = мТекст + Символы.ПС; 
		КонецЕсли;	 
		Если ФильтрПодразделения[0] = "1" Тогда  // Учитываем, выгружаем.
			мТекст = мТекст + "    И ПодразделенияОрганизаций.Ссылка В (&Подразделения)";
	    Иначе
			мТекст = мТекст + "    И НЕ (ПодразделенияОрганизаций.Ссылка В (&Подразделения))";
		КонецЕсли;			   
	КонецЕсли;       
	мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "&УсловияФильтров",мТекст);  
    РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	//Выборка = РезультатЗапроса[1].Выбрать(); 
	Выборка = РезультатЗапроса[1].Выгрузить();

	Возврат Выборка;
		
КонецФункции                         

Функция ПолучитьСтруктуру(ФильтрПодразделения, СвойствоХэш, мСпосХрПодр)  
	УстановитьПривилегированныйРежим(Истина);
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("ДатаВыборки", ТекущаяДата());
	мЗапрос.УстановитьПараметр("СвойствоХэш", СвойствоХэш);
	
	мЗапрос.Текст = 
    	"ВЫБРАТЬ
		|   СтруктураПредприятия.Ссылка КАК Ссылка,		
		|	СтруктураПредприятия.Родитель КАК Родитель,
		|	СтруктураПредприятия.Код КАК Код,
		|	СтруктураПредприятия.Родитель.Код КАК РодительКод,
		|	СтруктураПредприятия.ПометкаУдаления КАК ПометкаУдаления,
		|	СтруктураПредприятия.Наименование КАК Наименование,
		|	ЕСТЬNULL(ДопСведВерсияДанных.Значение, """") КАК ВерсияДанныхСтруктуры,					
		|	СтруктураПредприятия.ДополнительныеРеквизиты.(
		|		Свойство КАК Свойство,
		|		Свойство.Имя КАК Имя,
		|		Значение КАК Значение
		|	) КАК ДополнительныеРеквизиты 
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия  
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСведВерсияДанных
		|	ПО (ДопСведВерсияДанных.Свойство = &СвойствоХэш)
		|		И (ДопСведВерсияДанных.Объект = СтруктураПредприятия.Ссылка)
		|   &УсловияФильтров";                                                  
	
	мТекст = "";
	Если ФильтрПодразделения[0] <> "0" Тогда          
		мЗапрос.УстановитьПараметр("Подразделения",ФильтрПодразделения[1]);	
		Если НЕ ПустаяСтрока(мТекст) Тогда
			мТекст = мТекст + Символы.ПС; 
		КонецЕсли;	 
		Если ФильтрПодразделения[0] = "1" Тогда  // Учитываем, выгружаем.
			мТекст = мТекст + "ГДЕ    СтруктураПредприятия.Ссылка В (&Подразделения)";
	    Иначе
			мТекст = мТекст + "ГДЕ    НЕ (СтруктураПредприятия.Ссылка В (&Подразделения))";
		КонецЕсли;			   
	КонецЕсли;       
	мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "&УсловияФильтров",мТекст);  
    РезультатЗапроса = мЗапрос.ВыполнитьПакет();	
	Выборка = РезультатЗапроса[0].Выгрузить();

	Возврат Выборка;
		
КонецФункции


Функция ПолучитьСписокДолжностей(ФильтрДолжности, СвойствоХэш)  
	// Новая вводная: если должность исключена из списка выгружаемых, то в справочник ее тоже выгружать не надо.
	
	мЗапрос = Новый Запрос;                                
	мЗапрос.УстановитьПараметр("СвойствоХэш", СвойствоХэш);
	мЗапрос.Текст =                                        	
	"ВЫБРАТЬ
	|	Должности.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ДопСведВерсияДанных.Значение, """") КАК ВерсияДанныхДолжности
	|ИЗ
	|	Справочник.Должности КАК Должности
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСведВерсияДанных
	|	ПО (ДопСведВерсияДанных.Свойство = &СвойствоХэш)
	|		И (ДопСведВерсияДанных.Объект = Должности.Ссылка) 
	|ГДЕ
	|	НЕ Должности.ПометкаУдаления
	|	И НЕ Должности.ИсключенаИзШтатногоРасписания
	|   &УсловияФильтров";  
	мТекст = "";
	Если ФильтрДолжности[0] <> "0" Тогда          
		мЗапрос.УстановитьПараметр("Должности",ФильтрДолжности[1]);	
		Если НЕ ПустаяСтрока(мТекст) Тогда
			мТекст = мТекст + Символы.ПС; 
		КонецЕсли;	 
		Если ФильтрДолжности[0] = "1" Тогда  // Учитываем, выгружаем.
			мТекст = мТекст + "    И Должности.Ссылка В (&Должности)";
	    Иначе
			мТекст = мТекст + "    И НЕ (Должности.Ссылка В (&Должности))";
		КонецЕсли;			   
	КонецЕсли;       
	мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "&УсловияФильтров",мТекст);  
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	Возврат Выборка;
КонецФункции

Функция ПолучитьКастомныеДолжности(мРекв)  	
	мЗапрос = Новый Запрос;                                
	мЗапрос.УстановитьПараметр("Свойство", мРекв);
	мЗапрос.Текст =                                        	
	"ВЫБРАТЬ
	|	мЗначения.Ссылка КАК Ссылка,
	|	мЗначения.Наименование Как Наименование	
	|ИЗ 
	|	Справочник.ЗначенияСвойствОбъектов КАК мЗначения
	|ГДЕ
	|	НЕ мЗначения.ПометкаУдаления     
	|	И мЗначения.Владелец = &Свойство";
	
	
	//|   &УсловияФильтров";  
	//мТекст = "";
	//Если ФильтрДолжности[0] <> "0" Тогда          
	//	мЗапрос.УстановитьПараметр("Должности",ФильтрДолжности[1]);	
	//	Если НЕ ПустаяСтрока(мТекст) Тогда
	//		мТекст = мТекст + Символы.ПС; 
	//	КонецЕсли;	 
	//	Если ФильтрДолжности[0] = "1" Тогда  // Учитываем, выгружаем.
	//		мТекст = мТекст + "    И Должности.Ссылка В (&Должности)";
	//  Иначе
	//		мТекст = мТекст + "    И НЕ (Должности.Ссылка В (&Должности))";
	//	КонецЕсли;			   
	//КонецЕсли;       
	//мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "&УсловияФильтров",мТекст);  
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	Возврат Выборка;
КонецФункции

Функция ПолучитьОснованияУвольнения()  
	УстановитьПривилегированныйРежим(Истина);
	
	мЗапрос = Новый Запрос;
			
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ОснованияУвольнения.Ссылка КАК Ссылка,
	|	ОснованияУвольнения.Статья КАК Статья,
	|	ОснованияУвольнения.Часть КАК Часть,
	|	ОснованияУвольнения.Пункт КАК Пункт,
	|	ОснованияУвольнения.Подпункт КАК Подпункт,
	|	ОснованияУвольнения.ДокументОснование КАК ДокументОснование,
	|	ОснованияУвольнения.Абзац КАК Абзац
	|ИЗ
	|	Справочник.ОснованияУвольнения КАК ОснованияУвольнения
	|ГДЕ
	|	НЕ ОснованияУвольнения.ПометкаУдаления";

    РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	Возврат Выборка;                            	
КонецФункции

Функция ПолучитьКастомныеПоля()
	мЗапрос = Новый Запрос;
	
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	МК_НКП.Объект1С КАК Объект1С,
	|   МК_НКП.ПолеМК КАК ПолеМК,
	|   МК_ВО.Метод КАК Метод	
	|ИЗ 
	|	Справочник.МК_НастройкаКастомныхПолей КАК МК_НКП
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МК_ВыгружаемыеОбъекты КАК МК_ВО
	|	ПО (МК_НКП.Объект1С = МК_ВО.Ссылка)	
	|ГДЕ
	|	НЕ МК_НКП.ПометкаУдаления 
	|   И МК_НКП.Выгружать = Истина" ;
	
		
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выгрузить();  	
	Возврат Выборка;

КонецФункции	

Функция ПолучитьСписокПланНач()
	мЗапрос = Новый Запрос;
	
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	МК_НВПН.ВидНачисления1С КАК ВидНачисления ,
	|   МК_НВПН.РеквизитМК КАК РеквизитМК,	
	|   МК_НВПН.ЧтоВыгружать КАК ЧтоВыгружать,	
	|   МК_НВПН.Показатель КАК Показатель,
	|   МК_НВПН.Стандарт КАК Тип
	|ИЗ 
	|	Справочник.МК_НастройкаВыгрузкиПлановыхНачислений КАК МК_НВПН
	|ГДЕ
	|	НЕ МК_НВПН.ПометкаУдаления 
	|   И МК_НВПН.Выгружать = Истина" ;
	
		
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	мСписНач = Новый Массив;
	Пока Выборка.Следующий() Цикл	
		Если ЗначениеЗаполнено(Выборка.РеквизитМК) И ЗначениеЗаполнено(Выборка.ВидНачисления) Тогда
			мНач = Новый Структура("ВидНачисления, РеквизитМК, ЧтоВыгружать, Показатель, Тип",Выборка.ВидНачисления,Выборка.РеквизитМК,Выборка.ЧтоВыгружать,Выборка.Показатель,Выборка.Тип);
			мСписНач.Добавить(мНач); 
		КонецЕсли;	
	КонецЦикла;	
			
	Возврат мСписНач; 
КонецФункции	
                                               

Функция СписокСотрудников(мПарам)
	
	// Проблема с договорами ГПХ, назначенными действующим сотрудникам. Такие договоры часто создают запись
	// в регистре "ДанныеДляПодбораСотрудников" с бОльшей датой начала, чем действующая запись для основного
	// рабочего места, что приводит к выборке именно сведений по ГПХ в результат запроса. Надо это исключить
	// мПарам: СписокОрганизаций,ФильтрВидыЗанятости,ФильтрПодразделения,ФильтрДолжности,ФильтрСотрудники,ФильтрСтруктуры,СвойствоХэш,мНВИ,мВыгружатьПодразделения,мВыгружатьСтруктуру. 
	УстановитьПривилегированныйРежим(Истина);
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Организации", мПарам.СписокОрганизаций);
	мЗапрос.УстановитьПараметр("СвойствоХэш", мПарам.СвойствоХэшСотр);
	мЗапрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(НачалоДня(ТекущаяДата()), 1));         // Для поступления нужна текущая дата плюс месяц
	мЗапрос.УстановитьПараметр("ДатаОкончания",  ДобавитьМесяц(НачалоДня(ТекущаяДата()), -1)); 	  // А для увольнения - месяцем раньше. То есть если сотрудник уволен, он будет попадать
																								  // в выборку целый месяц.                                                             
	мЗапрос.Текст =   
	"ВЫБРАТЬ    
		// Опять новая вводная - хотят, чтобы запись по ГПХ для работающих сотрудников выгружалась   
		// Закомментирован вариант, исключающий попадание строки по ГПХ по работающему сотруднику в выгрузку
		// 08.08.2025 Снова возвращаемся к варианту без выгрузки ГПХ 
		|	ДанныеДляПодбора.Сотрудник КАК Сотрудник, 
		|   МИНИМУМ(ДанныеДляПодбора.ПоДоговоруГПХ)	КАК ПоДоговоруГПХ		
		|ПОМЕСТИТЬ СрезДанных1
		|ИЗ
		|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|ГДЕ
		|	ДанныеДляПодбора.Организация В(&Организации)
		|	И ДанныеДляПодбора.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|	И ДанныеДляПодбора.Начало <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ДанныеДляПодбора.Начало <= КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ)
		|	И (ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ДанныеДляПодбора.Окончание >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|   &УсловияФильтров            		
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник  
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник 
		|;
		|
		|ВЫБРАТЬ 
		|	СрезДанных1.Сотрудник КАК Сотрудник, 		
		|	МАКСИМУМ(ДанныеДляПодбора.Начало) КАК Начало
		|ПОМЕСТИТЬ СрезДанных
		|ИЗ СрезДанных1 Как СрезДанных1      
		|   	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора		
		|       ПО СрезДанных1.ПоДоговоруГПХ = ДанныеДляПодбора.ПоДоговоруГПХ 
		|           И СрезДанных1.Сотрудник = ДанныеДляПодбора.Сотрудник     
		|
		|СГРУППИРОВАТЬ ПО
		|	СрезДанных1.Сотрудник  
        |
		|ИНДЕКСИРОВАТЬ ПО
		|	СрезДанных1.Сотрудник 
		|;      		
		//|	ДанныеДляПодбора.Сотрудник КАК Сотрудник, 		
		//|   ДанныеДляПодбора.ПоДоговоруГПХ КАК ПоДоговоруГПХ,   
		//|	МАКСИМУМ(ДанныеДляПодбора.Начало) КАК Начало
		//|ПОМЕСТИТЬ СрезДанных
		//|ИЗ
		//|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		//|ГДЕ
		//|	ДанныеДляПодбора.Организация В(&Организации)
		//|	И ДанныеДляПодбора.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		//|	И ДанныеДляПодбора.Начало <> ДАТАВРЕМЯ(1, 1, 1)
		//|	И ДанныеДляПодбора.Начало <= КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ)
		//|	И (ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
		//|			ИЛИ ДанныеДляПодбора.Окончание >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		//|   &УсловияФильтров            		
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ДанныеДляПодбора.Сотрудник,  
		//|	ДанныеДляПодбора.ПоДоговоруГПХ  
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	ДанныеДляПодбора.Сотрудник 
		//|;
		|
		|////////////////////////////////////////////////////////////////////////////////     
		|// Группа подзапросов для определения даты последнего кадрового события, изменяющего должность или подразделение
		|// Сначала делаем выборку текущих значение должностей/подразделений
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ     
		|	ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|	ДанныеДляПодбора.Подразделение КАК Подразделение,
		|	ДанныеДляПодбора.Должность КАК Должность 
		|ПОМЕСТИТЬ ВТДанныеПоСотрудникам
		|ИЗ
		|	СрезДанных КАК СрезДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|// Находим первое с конца кадровое событие, отличающееся от текущего состояния по должности или подразделению
		|ВЫБРАТЬ 
		|	ДанныеПоСотрудникам.Сотрудник КАК Сотрудник, 
		|	МАКСИМУМ(КадроваяИсторияСотрудников.Период) КАК Период
		|ПОМЕСТИТЬ ВТПредыдущиеДолжности 
		|ИЗ
		|	ВТДанныеПоСотрудникам КАК ДанныеПоСотрудникам	
    	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников 
    	|	ПО КадроваяИсторияСотрудников.Сотрудник = ДанныеПоСотрудникам.Сотрудник  
    	//|	И (КадроваяИсторияСотрудников.Должность <> ДанныеПоСотрудникам.Должность 
    	//|	ИЛИ КадроваяИсторияСотрудников.Подразделение <> ДанныеПоСотрудникам.Подразделение)
		|   &УсловиеОпределенияДатыПоследнегоНазначения
		|ГДЕ
		|	КадроваяИсторияСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)	     // Временные назначения игнорируем
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПоСотрудникам.Сотрудник
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|// Вот теперь получается временная таблица с нужными датами.
		|ВЫБРАТЬ 
		|	ПредыдущиеДолжности.Сотрудник КАК Сотрудник,
		|	МИНИМУМ(КадроваяИсторияСотрудников.Период) КАК Период
		|ПОМЕСТИТЬ ВТДатыИзменения
		|ИЗ 
		|	ВТПредыдущиеДолжности КАК ПредыдущиеДолжности 
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников 
    	|	ПО КадроваяИсторияСотрудников.Сотрудник = ПредыдущиеДолжности.Сотрудник      	
    	|	И КадроваяИсторияСотрудников.Период > ПредыдущиеДолжности.Период
		|СГРУППИРОВАТЬ ПО 
		|	ПредыдущиеДолжности.Сотрудник
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|// Получаем период последнего документа, удостоверяющий личность.
		|ВЫБРАТЬ  
		|   ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|   МАКСИМУМ(Документы.Период) КАК Период
		|ПОМЕСТИТЬ ВТДокументыУЛ
		|ИЗ
		|   СрезДанных КАК СрезДанных   
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних Как Документы
		|       ПО (Документы.Физлицо = ДанныеДляПодбора.ФизическоеЛицо И Документы.ЯвляетсяДокументомУдостоверяющимЛичность)
        |СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;                  
		|////////////////////////////////////////////////////////////////////////////////
		|// Определяем текущий вид занятости: 1С не меняет этот реквизит в 'ДанныеДляПодбора', если в кадровом документе только такое изменение.
		|ВЫБРАТЬ  
		|   ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|   МАКСИМУМ(ВидыЗанятости.Период) КАК Период
		|ПОМЕСТИТЬ ВТВидыЗанятости
		|ИЗ
		|   СрезДанных КАК СрезДанных   
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыЗанятостиСотрудников.СрезПоследних Как ВидыЗанятости
		|       ПО (ВидыЗанятости.Сотрудник = ДанныеДляПодбора.Сотрудник)
        |СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;
		|////////////////////////////////////////////////////////////////////////////////   
		|// Формирование окончательного результата
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникСотрудники.Ссылка КАК Ссылка,
		|	СправочникСотрудники.Код КАК Код,
		|	ДанныеДляПодбора.Наименование КАК НаименованиеСотрудника,  
		|   ДанныеДляПодбора.ФизическоеЛицо.Ссылка КАК ФизЛицоСсылка,
		|	СправочникСотрудники.ВАрхиве КАК ВАрхиве,
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриема,
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУвольнения,
		|	ДанныеДляПодбора.Подразделение КАК Подразделение,  
		|	ДанныеДляПодбора.МестоВСтруктуреПредприятия КАК МестоВСтруктуре,
		|	ДанныеДляПодбора.Должность КАК Должность,
		|	ДанныеДляПодбора.Должность.Ссылка КАК ДолжностьКод,
		|	ВЫБОР
		|		КОГДА ДанныеДляПодбора.Филиал = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА ДанныеДляПодбора.Филиал
		|		ИНАЧЕ ДанныеДляПодбора.Организация
		|	КОНЕЦ КАК ОрганизацияСотрудника,
		|	СправочникСотрудники.ПометкаУдаления КАК ПометкаУдаления,
		|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
		|	СправочникСотрудники.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
		|	ДанныеДляПодбора.ФизическоеЛицо.Пол КАК Пол,
		|	ДанныеДляПодбора.ФизическоеЛицо.СтраховойНомерПФР КАК СНИЛС,
		|	ДанныеДляПодбора.Начало КАК Начало,
		|	ДанныеДляПодбора.Окончание КАК Окончание,
		|	ВидыЗанятости.ВидЗанятости КАК ВидЗанятости,
		|	ДанныеДляПодбора.ПоДоговоруГПХ КАК ПоДоговоруГПХ,   
		|   Документы.ВидДокумента КАК ВидДокумента,
		|   Документы.Серия КАК Серия,
		|   Документы.Номер КАК Номер,
		|   Документы.ДатаВыдачи КАК ДатаВыдачи,
		|   Документы.КемВыдан КАК КемВыдан,
		|   Документы.КодПодразделения КАК КодПодразделения,
		|   Графики.ГрафикРаботы КАК ГрафикРаботы,  
		|   ЕСТЬNULL(ДистанционнаяРабота.РаботаетДистанционно, ЛОЖЬ) КАК РаботаетДистанционно,
		|	ФизическиеЛица.КонтактнаяИнформация.(
		|		Тип КАК Тип,
		|		Вид КАК Вид,
		|		Представление КАК Представление,
		|		ЗначенияПолей КАК ЗначенияПолей
		|	) КАК КонтактнаяИнформация,
		|	СправочникСотрудники.ДополнительныеРеквизиты.(
		|		Свойство КАК Свойство,
		|		Свойство.Имя КАК Имя,
		|		Значение КАК Значение
		|	) КАК ДополнительныеРеквизиты,    
		//|СклоненияПредставленийОбъектов.ХешПредставления КАК Хеш,
		//|	СклоненияПредставленийОбъектов.ИменительныйПадеж КАК Именительный,
		//|	СклоненияПредставленийОбъектов.РодительныйПадеж КАК Родительный,
		//|	СклоненияПредставленийОбъектов.ДательныйПадеж КАК Дательный,
		//|	СклоненияПредставленийОбъектов.ВинительныйПадеж КАК Винительный,
		//|	СклоненияПредставленийОбъектов.ТворительныйПадеж КАК Творительный,
		//|	СклоненияПредставленийОбъектов.ПредложныйПадеж КАК Предложный,
		|	ЕСТЬNULL(ДопСведВерсияДанных.Значение, """") КАК ВерсияДанныхСотрудника,
		|   ДатыИзменения.Период КАК ДатаИзмененияДП
		|ИЗ
		|	СрезДанных КАК СрезДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
		|		ПО (ДанныеДляПодбора.Сотрудник = СправочникСотрудники.Ссылка)
		|			И (ДанныеДляПодбора.Наименование = СправочникСотрудники.Наименование)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ПО (ДанныеДляПодбора.Сотрудник = ТекущиеКадровыеДанныеСотрудников.Сотрудник)
		|			И (ДанныеДляПодбора.ФизическоеЛицо = ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
		|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ФизическиеЛица.Ссылка)		
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыУЛ КАК ВТДокументыУЛ
		|       ПО СрезДанных.Сотрудник = ВТДокументыУЛ.Сотрудник 
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних Как Документы
		|       ПО (Документы.Физлицо = ДанныеДляПодбора.ФизическоеЛицо И Документы.ЯвляетсяДокументомУдостоверяющимЛичность 
		|		И Документы.Период = ВТДокументыУЛ.Период)		
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыЗанятости КАК ВТВидыЗанятости
		|       ПО СрезДанных.Сотрудник = ВТВидыЗанятости.Сотрудник 
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыЗанятостиСотрудников.СрезПоследних Как ВидыЗанятости
		|       ПО (ВидыЗанятости.Сотрудник = ДанныеДляПодбора.Сотрудник 
		|		И ВидыЗанятости.Период = ВТВидыЗанятости.Период)		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСведВерсияДанных
		|		ПО (ДопСведВерсияДанных.Свойство = &СвойствоХэш)
		|			И (ДопСведВерсияДанных.Объект = ДанныеДляПодбора.Сотрудник)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыИзменения КАК ДатыИзменения
		|		ПО СрезДанных.Сотрудник = ДатыИзменения.Сотрудник
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботыСотрудников.СрезПоследних Как Графики
		|       ПО (СрезДанных.Сотрудник = Графики.Сотрудник)   
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДистанционнаяРаботаСотрудников.СрезПоследних Как ДистанционнаяРабота
		|       ПО (СрезДанных.Сотрудник = ДистанционнаяРабота.Сотрудник)";

     // Тут надо добавить условия по сотрудникам, видам занятости, подразделениям и должностям, если они есть.   
	 мТекст = "";
	 Если мПарам.ФильтрСотрудники[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Сотрудники",мПарам.ФильтрСотрудники[1]);	
		 Если мПарам.ФильтрСотрудники[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = "   И ДанныеДляПодбора.Сотрудник В (&Сотрудники)";
	     Иначе
		     мТекст = "   И НЕ (ДанныеДляПодбора.Сотрудник В (&Сотрудники))";
		 КонецЕсли;	                                                       		   
	 КонецЕсли;	       
	 Если мПарам.ФильтрДолжности[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Должности",мПарам.ФильтрДолжности[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если мПарам.ФильтрДолжности[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = мТекст + "    И ДанныеДляПодбора.Должность В (&Должности)";
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.Должность В (&Должности))";
		 КонецЕсли;			   
	 КонецЕсли;                                         
	 Если мПарам.ФильтрВидыЗанятости[2] = "2" Тогда   // Это про ГПХ. Тут "выгружать ГПХ" не означает, что всех остальных выгружать не надо
		 Если НЕ ПустаяСтрока(мТекст) Тогда    // Поэтому интересует только факт невыгрузки 
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 мТекст = мТекст + "    И НЕ ДанныеДляПодбора.ПоДоговоруГПХ"
	 КонецЕсли;	 
	 Если мПарам.ФильтрВидыЗанятости[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("ВидыЗанятости",мПарам.ФильтрВидыЗанятости[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если мПарам.ФильтрВидыЗанятости[0] = "1" Тогда  // Учитываем, выгружаем.
			Если мПарам.ФильтрВидыЗанятости[2] <> "2" Тогда
			 	мТекст = мТекст + "    И (ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости) ИЛИ ДанныеДляПодбора.ПоДоговоруГПХ)";
			Иначе	
				мТекст = мТекст + "    И ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости)";
			КонецЕсли;	
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости))";
		 КонецЕсли;			   
	 КонецЕсли;   
	 Если мПарам.ФильтрПодразделения[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Подразделения",мПарам.ФильтрПодразделения[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если мПарам.ФильтрПодразделения[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = мТекст + "    И ДанныеДляПодбора.Подразделение В Иерархии(&Подразделения)";
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.Подразделение В Иерархии(&Подразделения))";
		 КонецЕсли;			   
	 КонецЕсли;     
	 Если мПарам.ФильтрСтруктуры[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("МестаВСтруктуре",мПарам.ФильтрСтруктуры[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если мПарам.ФильтрСтруктуры[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = мТекст + "    И ДанныеДляПодбора.МестоВСтруктуреПредприятия В Иерархии(&МестаВСтруктуре)";
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.МестоВСтруктуреПредприятия В Иерархии(&МестаВСтруктуре))";
		 КонецЕсли;			   
	 КонецЕсли;

	мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "&УсловияФильтров",мТекст);   
	
	// Изменение в определении даты последнего назначения (изменения должности или подразделения): теперь нужно смотреть настройку
	// выгрузки должности и подразделения: если выгружаются оба реквизита, то оба и проверяем. Иначе - только тот, что выгружается.
	// Подразделение - мНВИ[3], Должность - мНВИ[4]
	мТекст = "И (КадроваяИсторияСотрудников.Должность <> ДанныеПоСотрудникам.Должность ИЛИ КадроваяИсторияСотрудников.Подразделение <> ДанныеПоСотрудникам.Подразделение)";   	
	Если мПарам.мВыгружатьПодразделения И мПарам.мНВИ[4] = "0" Тогда		
		мТекст = "И КадроваяИсторияСотрудников.Подразделение <> ДанныеПоСотрудникам.Подразделение";
	ИначеЕсли (Не мПарам.ВыгружатьПодразделения) И мПарам.мНВИ[4] = "1" Тогда			
		мТекст = "И КадроваяИсторияСотрудников.Должность <> ДанныеПоСотрудникам.Должность";
	КонецЕсли;	
	мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "&УсловиеОпределенияДатыПоследнегоНазначения",мТекст);
	 	
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[7].Выгрузить();
	Возврат Выборка;
КонецФункции

                     
Функция ПолучитьГрафики(СвойствоХэшГраф) Экспорт    
	мДатаСреза = ТекущаяДата();
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("ДатаСреза",мДатаСреза);
	мЗапрос.УстановитьПараметр("СвойствоХэш",СвойствоХэшГраф);
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	Графики.Ссылка КАК Ссылка,
	|   ЕСТЬNULL(Графики.НеполноеРабочееВремя, ЛОЖЬ) КАК НРВ,
	|   ЕСТЬNULL(Графики.СокращеннаяРабочаяНеделя, ЛОЖЬ) КАК НРН,
	|   ЕСТЬNULL(Графики.НеполныйРабочийДень, ЛОЖЬ) КАК НРД,	
	|	ЕСТЬNULL(ДопСведВерсияДанных.Значение, """") КАК ВерсияДанныхГрафиков
	|ИЗ 
	|	Справочник.ГрафикиРаботыСотрудников КАК Графики
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСведВерсияДанных
	|	ПО (ДопСведВерсияДанных.Свойство = &СвойствоХэш)
	|		И (ДопСведВерсияДанных.Объект = Графики.Ссылка) 
	|ГДЕ
	|	НЕ Графики.ПометкаУдаления";
	
		
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
			
	Возврат Выборка;
КонецФункции   

Функция СписокСотрудниковКП(мПарам)         
	// мПарам: СписокОрганизаций,ФильтрВидыЗанятости,ФильтрПодразделения,ФильтрДолжности,ФильтрСотрудники,ФильтрСтруктуры,СвойствоХэш,мНВИ,мВыгружатьПодразделения,мВыгружатьСтруктуру. 
	// Запрос с кастомными полями.
	// Тут нужно еще выбирать плановые начисления
	УстановитьПривилегированныйРежим(Истина);    
	мДокумент1 = Константы.МК_ДокументФЛ1.Получить();
	мДокумент2 = Константы.МК_ДокументФЛ2.Получить();
	мДокумент3 = Константы.МК_ДокументФЛ3.Получить();
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Организации", мПарам.СписокОрганизаций);
	мЗапрос.УстановитьПараметр("Документ1", мДокумент1);
	мЗапрос.УстановитьПараметр("Документ2", мДокумент2);
	мЗапрос.УстановитьПараметр("Документ3", мДокумент3);
	мЗапрос.УстановитьПараметр("СвойствоХэш", мПарам.СвойствоХэшСотр);    
	мЗапрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(НачалоДня(ТекущаяДата()), 1));         // Для поступления нужна текущая дата плюс месяц	
	мЗапрос.УстановитьПараметр("ДатаОкончания",  ДобавитьМесяц(НачалоДня(ТекущаяДата()), -1)); 	  // А для увольнения - месяцем раньше. То есть если сотрудник уволен, он будет попадать
	              	                                                                              // в выборку целый месяц.                                                             
	мЗапрос.Текст =   
	"ВЫБРАТЬ     
	    |	ДанныеДляПодбора.Сотрудник КАК Сотрудник, 
		|   МИНИМУМ(ДанныеДляПодбора.ПоДоговоруГПХ)	КАК ПоДоговоруГПХ		
		|ПОМЕСТИТЬ СрезДанных1
		|ИЗ
		|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|ГДЕ
		|	ДанныеДляПодбора.Организация В(&Организации)
		|	И ДанныеДляПодбора.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|	И ДанныеДляПодбора.Начало <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ДанныеДляПодбора.Начало <= КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ)
		|	И (ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ДанныеДляПодбора.Окончание >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|   &УсловияФильтров            		
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник  
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник 
		|;
		|
		|ВЫБРАТЬ 
		|	СрезДанных1.Сотрудник КАК Сотрудник, 		
		|	МАКСИМУМ(ДанныеДляПодбора.Начало) КАК Начало
		|ПОМЕСТИТЬ СрезДанных
		|ИЗ СрезДанных1 Как СрезДанных1      
		|   	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора		
		|       ПО СрезДанных1.ПоДоговоруГПХ = ДанныеДляПодбора.ПоДоговоруГПХ 
		|           И СрезДанных1.Сотрудник = ДанныеДляПодбора.Сотрудник     
		|
		|СГРУППИРОВАТЬ ПО
		|	СрезДанных1.Сотрудник  
        |
		|ИНДЕКСИРОВАТЬ ПО
		|	СрезДанных1.Сотрудник 
		|;  	
		//|	ДанныеДляПодбора.Сотрудник КАК Сотрудник, 		
		//|   ДанныеДляПодбора.ПоДоговоруГПХ КАК ПоДоговоруГПХ,   
		//|	МАКСИМУМ(ДанныеДляПодбора.Начало) КАК Начало
		//|ПОМЕСТИТЬ СрезДанных
		//|ИЗ
		//|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		//|ГДЕ
		//|	ДанныеДляПодбора.Организация В(&Организации)
		//|	И ДанныеДляПодбора.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		//|	И ДанныеДляПодбора.Начало <> ДАТАВРЕМЯ(1, 1, 1)
		//|	И ДанныеДляПодбора.Начало <= КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ)
		//|	И (ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
		//|			ИЛИ ДанныеДляПодбора.Окончание >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		//|   &УсловияФильтров            		
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ДанныеДляПодбора.Сотрудник,  
		//|	ДанныеДляПодбора.ПоДоговоруГПХ  
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	ДанныеДляПодбора.Сотрудник 
		//|;
		|
		|////////////////////////////////////////////////////////////////////////////////     
		|// Группа подзапросов для определения даты последнего кадрового события, изменяющего должность или подразделение
		|// Сначала делаем выборку текущих значение должностей/подразделений
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ     
		|	ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|	ДанныеДляПодбора.Подразделение КАК Подразделение,
		|	ДанныеДляПодбора.Должность КАК Должность 
		|ПОМЕСТИТЬ ВТДанныеПоСотрудникам
		|ИЗ
		|	СрезДанных КАК СрезДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|// Находим первое с конца кадровое событие, отличающееся от текущего состояния по должности или подразделению
		|ВЫБРАТЬ 
		|	ДанныеПоСотрудникам.Сотрудник КАК Сотрудник, 
		|	МАКСИМУМ(КадроваяИсторияСотрудников.Период) КАК Период
		|ПОМЕСТИТЬ ВТПредыдущиеДолжности 
		|ИЗ
		|	ВТДанныеПоСотрудникам КАК ДанныеПоСотрудникам	
    	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников 
    	|	ПО КадроваяИсторияСотрудников.Сотрудник = ДанныеПоСотрудникам.Сотрудник  
    	//|	И (КадроваяИсторияСотрудников.Должность <> ДанныеПоСотрудникам.Должность 
    	//|	ИЛИ КадроваяИсторияСотрудников.Подразделение <> ДанныеПоСотрудникам.Подразделение)
		|	&УсловиеОпределенияДатыПоследнегоНазначения
		|ГДЕ
		|	КадроваяИсторияСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)	     // Временные назначения игнорируем
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПоСотрудникам.Сотрудник
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|// Вот теперь получается временная таблица с нужными датами.
		|ВЫБРАТЬ 
		|	ПредыдущиеДолжности.Сотрудник КАК Сотрудник,
		|	МИНИМУМ(КадроваяИсторияСотрудников.Период) КАК Период
		|ПОМЕСТИТЬ ВТДатыИзменения
		|ИЗ 
		|	ВТПредыдущиеДолжности КАК ПредыдущиеДолжности 
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников 
    	|	ПО КадроваяИсторияСотрудников.Сотрудник = ПредыдущиеДолжности.Сотрудник      	
    	|	И КадроваяИсторияСотрудников.Период > ПредыдущиеДолжности.Период
		|СГРУППИРОВАТЬ ПО 
		|	ПредыдущиеДолжности.Сотрудник
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|// Получаем период последнего документа, удостоверяющий личность.
		|ВЫБРАТЬ  
		|   ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|   МАКСИМУМ(Документы.Период) КАК Период
		|ПОМЕСТИТЬ ВТДокументыУЛ
		|ИЗ
		|   СрезДанных КАК СрезДанных   
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних Как Документы
		|       ПО (Документы.Физлицо = ДанныеДляПодбора.ФизическоеЛицо И Документы.ЯвляетсяДокументомУдостоверяющимЛичность)
        |СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;                    
		|////////////////////////////////////////////////////////////////////////////////
		|// Определяем текущий вид занятости: 1С не меняет этот реквизит в 'ДанныеДляПодбора', если в кадровом документе только такое изменение.
		|ВЫБРАТЬ  
		|   ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|   МАКСИМУМ(ВидыЗанятости.Период) КАК Период
		|ПОМЕСТИТЬ ВТВидыЗанятости
		|ИЗ
		|   СрезДанных КАК СрезДанных   
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыЗанятостиСотрудников.СрезПоследних Как ВидыЗанятости
		|       ПО (ВидыЗанятости.Сотрудник = ДанныеДляПодбора.Сотрудник)
        |СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|// Получаем период последнего документа с типом мДокумент1.
		|ВЫБРАТЬ  
		|   ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|   МАКСИМУМ(Документы.Период) КАК Период
		|ПОМЕСТИТЬ ВТДокументыФЛ1
		|ИЗ
		|   СрезДанных КАК СрезДанных   
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних Как Документы
		|       ПО (Документы.Физлицо = ДанныеДляПодбора.ФизическоеЛицо И Документы.ВидДокумента = (&Документ1))
        |СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;                                                                               
		|////////////////////////////////////////////////////////////////////////////////
		|// Тоже самое для мДокумент2.
		|ВЫБРАТЬ  
		|   ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|   МАКСИМУМ(Документы.Период) КАК Период
		|ПОМЕСТИТЬ ВТДокументыФЛ2
		|ИЗ
		|   СрезДанных КАК СрезДанных   
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних Как Документы
		|       ПО (Документы.Физлицо = ДанныеДляПодбора.ФизическоеЛицо И Документы.ВидДокумента = (&Документ2))
        |СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;                                                                               
		|////////////////////////////////////////////////////////////////////////////////
		|// Еще и мДокумент3.
		|ВЫБРАТЬ  
		|   ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|   МАКСИМУМ(Документы.Период) КАК Период
		|ПОМЕСТИТЬ ВТДокументыФЛ3
		|ИЗ
		|   СрезДанных КАК СрезДанных   
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних Как Документы
		|       ПО (Документы.Физлицо = ДанныеДляПодбора.ФизическоеЛицо И Документы.ВидДокумента = (&Документ3))
        |СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;                                                                               
		|////////////////////////////////////////////////////////////////////////////////
		|// Данные трудовых договоров
		|ВЫБРАТЬ  
		|   ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|   МАКСИМУМ(ДанныеДоговоров.Период) КАК Период
		|ПОМЕСТИТЬ ВТДанныеДоговоров
		|ИЗ
		|   СрезДанных КАК СрезДанных   
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.СрезПоследних Как ДанныеДоговоров
		|       ПО (ДанныеДоговоров.Сотрудник = ДанныеДляПодбора.Сотрудник)
        |СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;
        |////////////////////////////////////////////////////////////////////////////////
		|// Гражданство
		|ВЫБРАТЬ  
		|   ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|   МАКСИМУМ(Гражданство.Период) КАК Период
		|ПОМЕСТИТЬ ВТГражданство
		|ИЗ
		|   СрезДанных КАК СрезДанных   
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних Как Гражданство
		|       ПО (Гражданство.ФизическоеЛицо = ДанныеДляПодбора.ФизическоеЛицо)
        |СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;                                                                               
		|////////////////////////////////////////////////////////////////////////////////   
		|// Формирование окончательного результата
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникСотрудники.Ссылка КАК Ссылка,
		|	СправочникСотрудники.Код КАК Код,
		|	ДанныеДляПодбора.Наименование КАК НаименованиеСотрудника,  
		|   ДанныеДляПодбора.ФизическоеЛицо.Ссылка КАК ФизЛицоСсылка,
		|	СправочникСотрудники.ВАрхиве КАК ВАрхиве,
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриема,
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУвольнения,
		|	ДанныеДляПодбора.Подразделение КАК Подразделение,
		|	ДанныеДляПодбора.Должность КАК Должность,
		|	ДанныеДляПодбора.Должность.Ссылка КАК ДолжностьКод,
		|	ДанныеДляПодбора.МестоВСтруктуреПредприятия КАК МестоВСтруктуре,
		|	ВЫБОР
		|		КОГДА ДанныеДляПодбора.Филиал = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА ДанныеДляПодбора.Филиал
		|		ИНАЧЕ ДанныеДляПодбора.Организация
		|	КОНЕЦ КАК ОрганизацияСотрудника,
		|	СправочникСотрудники.ПометкаУдаления КАК ПометкаУдаления,
		|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
		|	СправочникСотрудники.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
		|	ДанныеДляПодбора.ФизическоеЛицо.Пол КАК Пол,
		|	ДанныеДляПодбора.ФизическоеЛицо.СтраховойНомерПФР КАК СНИЛС,
		|	ДанныеДляПодбора.ФизическоеЛицо.ИНН КАК ИНН,
		|	ДанныеДляПодбора.Начало КАК Начало,
		|	ДанныеДляПодбора.Окончание КАК Окончание,
		|	ВидыЗанятости.ВидЗанятости КАК ВидЗанятости,
		|	ДанныеДляПодбора.ПоДоговоруГПХ КАК ПоДоговоруГПХ,   
		|	ДанныеДляПодбора.КоличествоСтавок КАК КоличествоСтавок,
		|   Документы.ВидДокумента КАК ВидДокумента,
		|   Документы.Серия КАК Серия,
		|   Документы.Номер КАК Номер,
		|   Документы.ДатаВыдачи КАК ДатаВыдачи,
		|   Документы.КемВыдан КАК КемВыдан,
		|   Документы.КодПодразделения КАК КодПодразделения,    
		|   ДокументыФЛ1.ВидДокумента КАК Документ1ВидДокумента,
		|   ДокументыФЛ1.Серия КАК Документ1Серия,
		|   ДокументыФЛ1.Номер КАК Документ1Номер,
		|   ДокументыФЛ1.ДатаВыдачи КАК Документ1ДатаВыдачи, 
		|   ДокументыФЛ1.СрокДействия КАК Документ1СрокДействия,
		|   ДокументыФЛ1.КемВыдан КАК Документ1КемВыдан,
		|   ДокументыФЛ1.КодПодразделения КАК Документ1КодПодразделения,    
		|   ЕСТЬNULL(ДокументыФЛ1.СтранаВыдачи, """") КАК Документ1СтранаВыдачи,
		|   ЕСТЬNULL(ДокументыФЛ2.ВидДокумента, """") КАК Документ2ВидДокумента,
		|   ЕСТЬNULL(ДокументыФЛ2.Серия, """") КАК Документ2Серия,
		|   ЕСТЬNULL(ДокументыФЛ2.Номер, """") КАК Документ2Номер,
		|   ЕСТЬNULL(ДокументыФЛ2.ДатаВыдачи, """") КАК Документ2ДатаВыдачи, 
		|   ЕСТЬNULL(ДокументыФЛ2.СрокДействия, """") КАК Документ2СрокДействия,
		|   ЕСТЬNULL(ДокументыФЛ2.КемВыдан, """") КАК Документ2КемВыдан,
		|   ЕСТЬNULL(ДокументыФЛ2.КодПодразделения, """") КАК Документ2КодПодразделения,    
		|   ЕСТЬNULL(ДокументыФЛ2.СтранаВыдачи, """") КАК Документ2СтранаВыдачи,
		|   ЕСТЬNULL(ДокументыФЛ3.ВидДокумента, """") КАК Документ3ВидДокумента,
		|   ЕСТЬNULL(ДокументыФЛ3.Серия, """") КАК Документ3Серия,
		|   ЕСТЬNULL(ДокументыФЛ3.Номер, """") КАК Документ3Номер,
		|   ЕСТЬNULL(ДокументыФЛ3.ДатаВыдачи, """") КАК Документ3ДатаВыдачи, 
		|   ЕСТЬNULL(ДокументыФЛ3.СрокДействия, """") КАК Документ3СрокДействия,
		|   ЕСТЬNULL(ДокументыФЛ3.КемВыдан, """") КАК Документ3КемВыдан,
		|   ЕСТЬNULL(ДокументыФЛ3.КодПодразделения, """") КАК Документ3КодПодразделения,    
		|   ЕСТЬNULL(ДокументыФЛ3.СтранаВыдачи, """") КАК Документ3СтранаВыдачи,   
		|   ДанныеДоговоров.ДатаДоговораКонтракта Как ДатаДоговораКонтракта,
		|   ДанныеДоговоров.НомерДоговораКонтракта Как НомерДоговораКонтракта,
		|   Гражданство.Страна Как ГражданствоСтрана,
		|   Гражданство.ИНН Как ГражданствоИНН,
		|   Графики.ГрафикРаботы КАК ГрафикРаботы,  
		|   ЕСТЬNULL(ДистанционнаяРабота.РаботаетДистанционно, ЛОЖЬ) КАК РаботаетДистанционно,
		|	ФизическиеЛица.КонтактнаяИнформация.(
		|		Тип КАК Тип,
		|		Вид КАК Вид,
		|		Представление КАК Представление,
		|		ЗначенияПолей КАК ЗначенияПолей
		|	) КАК КонтактнаяИнформация,
		|	СправочникСотрудники.ДополнительныеРеквизиты.(
		|		Свойство КАК Свойство,
		|		Свойство.Имя КАК Имя,
		|		Значение КАК Значение
		|	) КАК ДополнительныеРеквизиты,    
		//|СклоненияПредставленийОбъектов.ХешПредставления КАК Хеш,
		//|	СклоненияПредставленийОбъектов.ИменительныйПадеж КАК Именительный,
		//|	СклоненияПредставленийОбъектов.РодительныйПадеж КАК Родительный,
		//|	СклоненияПредставленийОбъектов.ДательныйПадеж КАК Дательный,
		//|	СклоненияПредставленийОбъектов.ВинительныйПадеж КАК Винительный,
		//|	СклоненияПредставленийОбъектов.ТворительныйПадеж КАК Творительный,
		//|	СклоненияПредставленийОбъектов.ПредложныйПадеж КАК Предложный,
		|	ЕСТЬNULL(ДопСведВерсияДанных.Значение, """") КАК ВерсияДанныхСотрудника,
		|   ДатыИзменения.Период КАК ДатаИзмененияДП
		|ИЗ
		|	СрезДанных КАК СрезДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
		|		ПО (ДанныеДляПодбора.Сотрудник = СправочникСотрудники.Ссылка)
		|			И (ДанныеДляПодбора.Наименование = СправочникСотрудники.Наименование)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ПО (ДанныеДляПодбора.Сотрудник = ТекущиеКадровыеДанныеСотрудников.Сотрудник)
		|			И (ДанныеДляПодбора.ФизическоеЛицо = ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
		|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ФизическиеЛица.Ссылка)		
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыУЛ КАК ВТДокументыУЛ
		|       ПО СрезДанных.Сотрудник = ВТДокументыУЛ.Сотрудник 
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних Как Документы
		|       ПО (Документы.Физлицо = ДанныеДляПодбора.ФизическоеЛицо И Документы.ЯвляетсяДокументомУдостоверяющимЛичность 
		|		И Документы.Период = ВТДокументыУЛ.Период)		
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыФЛ1 КАК ВТДокументыФЛ1
		|       ПО СрезДанных.Сотрудник = ВТДокументыФЛ1.Сотрудник 
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних Как ДокументыФЛ1
		|       ПО (ДокументыФЛ1.Физлицо = ДанныеДляПодбора.ФизическоеЛицо И ДокументыФЛ1.ВидДокумента = (&Документ1)
		|		И ДокументыФЛ1.Период = ВТДокументыФЛ1.Период)	
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыФЛ2 КАК ВТДокументыФЛ2
		|       ПО СрезДанных.Сотрудник = ВТДокументыФЛ2.Сотрудник 
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних Как ДокументыФЛ2
		|       ПО (ДокументыФЛ2.Физлицо = ДанныеДляПодбора.ФизическоеЛицо И ДокументыФЛ2.ВидДокумента = (&Документ2)
		|		И ДокументыФЛ2.Период = ВТДокументыФЛ2.Период)	  
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыФЛ3 КАК ВТДокументыФЛ3
		|       ПО СрезДанных.Сотрудник = ВТДокументыФЛ3.Сотрудник 
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних Как ДокументыФЛ3
		|       ПО (ДокументыФЛ3.Физлицо = ДанныеДляПодбора.ФизическоеЛицо И ДокументыФЛ3.ВидДокумента = (&Документ3)
		|		И ДокументыФЛ3.Период = ВТДокументыФЛ3.Период)	 
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыЗанятости КАК ВТВидыЗанятости
		|       ПО СрезДанных.Сотрудник = ВТВидыЗанятости.Сотрудник 
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВидыЗанятостиСотрудников.СрезПоследних Как ВидыЗанятости
		|       ПО (ВидыЗанятости.Сотрудник = ДанныеДляПодбора.Сотрудник 
		|		И ВидыЗанятости.Период = ВТВидыЗанятости.Период)	
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДоговоров КАК ВТДанныеДоговоров
		|       ПО СрезДанных.Сотрудник = ВТДанныеДоговоров.Сотрудник 
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.СрезПоследних Как ДанныеДоговоров
		|       ПО (ДанныеДоговоров.сотрудник = ДанныеДляПодбора.Сотрудник)
		|		И (ДанныеДоговоров.Период = ВТДанныеДоговоров.Период)	
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК ВТГражданство
		|       ПО СрезДанных.Сотрудник = ВТГражданство.Сотрудник 
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних Как Гражданство
		|       ПО (Гражданство.ФизическоеЛицо = ДанныеДляПодбора.ФизическоеЛицо 
		|		И Гражданство.Период = ВТГражданство.Период)	  
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСведВерсияДанных
		|		ПО (ДопСведВерсияДанных.Свойство = &СвойствоХэш)
		|			И (ДопСведВерсияДанных.Объект = ДанныеДляПодбора.Сотрудник)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыИзменения КАК ДатыИзменения
		|		ПО СрезДанных.Сотрудник = ДатыИзменения.Сотрудник
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботыСотрудников.СрезПоследних Как Графики
		|       ПО (СрезДанных.Сотрудник = Графики.Сотрудник)   
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДистанционнаяРаботаСотрудников.СрезПоследних Как ДистанционнаяРабота
		|       ПО (СрезДанных.Сотрудник = ДистанционнаяРабота.Сотрудник)";

     // Тут надо добавить условия по сотрудникам, видам занятости, подразделениям и должностям, если они есть.   
	 мТекст = "";
	 Если мПарам.ФильтрСотрудники[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Сотрудники",мПарам.ФильтрСотрудники[1]);	
		 Если мПарам.ФильтрСотрудники[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = "   И ДанныеДляПодбора.Сотрудник В (&Сотрудники)";
	     Иначе
		     мТекст = "   И НЕ (ДанныеДляПодбора.Сотрудник В (&Сотрудники))";
		 КонецЕсли;	                                                       		   
	 КонецЕсли;	       
	  Если мПарам.ФильтрДолжности[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Должности",мПарам.ФильтрДолжности[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если мПарам.ФильтрДолжности[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = мТекст + "    И ДанныеДляПодбора.Должность В (&Должности)";
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.Должность В (&Должности))";
		 КонецЕсли;			   
	 КонецЕсли;                                         
	 Если мПарам.ФильтрВидыЗанятости[2] = "2" Тогда   // Это про ГПХ. Тут "выгружать ГПХ" не означает, что всех остальных выгружать не надо
		 Если НЕ ПустаяСтрока(мТекст) Тогда    // Поэтому интересует только факт невыгрузки 
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 мТекст = мТекст + "    И НЕ ДанныеДляПодбора.ПоДоговоруГПХ"
	 КонецЕсли;	 
	 Если мПарам.ФильтрВидыЗанятости[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("ВидыЗанятости",мПарам.ФильтрВидыЗанятости[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если мПарам.ФильтрВидыЗанятости[0] = "1" Тогда  // Учитываем, выгружаем.
			Если мПарам.ФильтрВидыЗанятости[2] <> "2" Тогда
			 	мТекст = мТекст + "    И (ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости) ИЛИ ДанныеДляПодбора.ПоДоговоруГПХ)";
			Иначе	
				мТекст = мТекст + "    И ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости)";
			КонецЕсли;	
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.ВидЗанятости В (&ВидыЗанятости))";
		 КонецЕсли;			   
	 КонецЕсли;   
	 Если мПарам.ФильтрПодразделения[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("Подразделения",мПарам.ФильтрПодразделения[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если мПарам.ФильтрПодразделения[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = мТекст + "    И ДанныеДляПодбора.Подразделение В Иерархии(&Подразделения)";
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.Подразделение В Иерархии(&Подразделения))";
		 КонецЕсли;			   
	 КонецЕсли;                                               
	 Если мПарам.ФильтрСтруктуры[0] <> "0" Тогда          
		 мЗапрос.УстановитьПараметр("МестаВСтруктуре",мПарам.ФильтрСтруктуры[1]);	
		 Если НЕ ПустаяСтрока(мТекст) Тогда
			 мТекст = мТекст + Символы.ПС; 
		 КонецЕсли;	 
		 Если мПарам.ФильтрСтруктуры[0] = "1" Тогда  // Учитываем, выгружаем.
			 мТекст = мТекст + "    И ДанныеДляПодбора.МестоВСтруктуреПредприятия В Иерархии(&МестаВСтруктуре)";
	     Иначе
		     мТекст = мТекст + "    И НЕ (ДанныеДляПодбора.МестоВСтруктуреПредприятия В Иерархии(&МестаВСтруктуре))";
		 КонецЕсли;			   
	 КонецЕсли;     


	 мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "&УсловияФильтров",мТекст);   
	 
	 // Изменение в определении даты последнего назначения (изменения должности или подразделения): теперь нужно смотреть настройку
	 // выгрузки должности и подразделения: если выгружаются оба реквизита, то оба и проверяем. Иначе - только тот, что выгружается.
 	// Подразделение - мНВИ[3], Должность - мНВИ[4]
	мТекст = "И (КадроваяИсторияСотрудников.Должность <> ДанныеПоСотрудникам.Должность 	ИЛИ КадроваяИсторияСотрудников.Подразделение <> ДанныеПоСотрудникам.Подразделение)";
	Если мПарам.мВыгружатьПодразделения И мПарам.мНВИ[4] = "0" Тогда		
		мТекст = "	И КадроваяИсторияСотрудников.Подразделение <> ДанныеПоСотрудникам.Подразделение";
	ИначеЕсли (Не мПарам.мВыгружатьПодразделения) И мПарам.мНВИ[4] = "1" Тогда			
		мТекст = "	И КадроваяИсторияСотрудников.Должность <> ДанныеПоСотрудникам.Должность";
	КонецЕсли;	
	мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "&УсловиеОпределенияДатыПоследнегоНазначения",мТекст);

	 	
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[12].Выгрузить();
	Возврат Выборка;
КонецФункции


Функция СписокОрганизацийПолный(мСписокОрганизаций,СвойствоХэшОрг) Экспорт  
	
	
	// Нужны расширенные сведения по организациям. В запросе будем получать сведения по списку
	// переданных организаций.      
	//мСписок = Новый Массив();
	мДатаСреза = ТекущаяДата();
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("ДатаСреза",мДатаСреза);
	мЗапрос.УстановитьПараметр("СписокОрганизаций",мСписокОрганизаций);
	мЗапрос.УстановитьПараметр("СвойствоХэш",СвойствоХэшОрг);
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	Организации.ИНН КАК ИНН, 	
	|	ЕСТЬNULL(Организации.РегистрацияВНалоговомОргане.КПП,"""") КАК КПП,
	|   Организации.ОГРН КАК ОГРН,
	//|	СведенияОбОтветственныхЛицахСрезПоследних.Руководитель.Ссылка КАК Руководитель,
	//|	СведенияОбОтветственныхЛицахСрезПоследних.УдалитьДолжностьРуководителя.Ссылка КАК ДолжностьРуководителя,
	|	ЕСТЬNULL(ДопСведВерсияДанных.Значение, """") КАК ВерсияДанныхОрганизаций
	|ИЗ 
	|	Справочник.Организации КАК Организации
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСведВерсияДанных
	|	ПО (ДопСведВерсияДанных.Свойство = &СвойствоХэш)
	|		И (ДопСведВерсияДанных.Объект = Организации.Ссылка) 
	//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних(&ДатаСреза) КАК СведенияОбОтветственныхЛицахСрезПоследних
	//|		ПО СведенияОбОтветственныхЛицахСрезПоследних.Организация = Организации.Ссылка
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|   И Организации.Ссылка В (&СписокОрганизаций)";
		
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
			
	Возврат Выборка;
КонецФункции


Функция ТекущиеНачисленияСотрудников(Сотрудники, ДатаСведений, ИсключаемыйРегистратор = Неопределено, ФормироватьСПериодичностьДень = Истина)       
	
	// ТекущиеДанныеОплатыТруда = КадровыйУчетРасширенный.ТекущиеНачисленияСотрудников(Сотрудники, ТекущаяДата(),,);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("ДатаСведений", ДатаСведений);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ДатаСведений КАК Период,
		|	Сотрудники.Ссылка КАК Сотрудник
		|ПОМЕСТИТЬ ВТОтбораСотрудников
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&Сотрудники)";
	
	Запрос.ВыполнитьПакет();
	
	Отборы = Новый Массив;
	ОтборыНачислений = Новый Структура("ПлановыеНачисления", ОбщегоНазначения.СкопироватьРекурсивно(Отборы));
	
	ЗапросВТПлановыеНачисления = КадровыйУчетРасширенный.ЗапросВТПлановыеНачисленияСотрудников(
		Истина, "ВТПлановыеНачисленияСотрудников", "ВТОтбораСотрудников", "Сотрудник,Период", ОтборыНачислений, ФормироватьСПериодичностьДень);
	
	ЗапросВТПлановыеНачисления.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросВТПлановыеНачисления.ВыполнитьПакет();
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеНачисленияСотрудников.Период,
		|	ПлановыеНачисленияСотрудников.ПериодЗаписи,
		|	ПлановыеНачисленияСотрудников.Сотрудник,
		|	ПлановыеНачисленияСотрудников.Начисление,		
		|	ПлановыеНачисленияСотрудников.ОсновнойПоказатель,		
		|	ПлановыеНачисленияСотрудников.Размер				
		|ИЗ
		|	ВТПлановыеНачисленияСотрудников КАК ПлановыеНачисленияСотрудников" ;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();             
	мВыборка = РезультатЗапроса[0].Выгрузить();		
	Возврат мВыборка;
	
		
	//Запрос.Текст =
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ПлановыеНачисленияСотрудников.Период,
	//	|	ПлановыеНачисленияСотрудников.Сотрудник,
	//	|	ПлановыеНачисленияСотрудников.Начисление,
	//	|	ПлановыеНачисленияСотрудников.ДокументОснование,
	//	|	ПлановыеНачисленияСотрудников.Размер,
	//	|	ПлановыеНачисленияСотрудников.ОсновнойПоказатель,
	//	|	ПлановыеНачисленияСотрудников.НачислениеТарифнойСтавки,
	//	|	ЕСТЬNULL(НачисленияПоказатели.Показатель, ПлановыеНачисленияСотрудников.ОсновнойПоказатель) КАК Показатель
	//	|ПОМЕСТИТЬ ВТНачисленияСотрудниковСПоказателями
	//	|ИЗ
	//	|	ВТПлановыеНачисленияСотрудников КАК ПлановыеНачисленияСотрудников
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК НачисленияПоказатели
	//	|		ПО ПлановыеНачисленияСотрудников.Начисление = НачисленияПоказатели.Ссылка
	//	|			И (НачисленияПоказатели.ЗапрашиватьПриВводе)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//	|	НачисленияСотрудниковСПоказателями.Период,
	//	|	НачисленияСотрудниковСПоказателями.Сотрудник,
	//	|	НачисленияСотрудниковСПоказателями.Показатель,
	//	|	НачисленияСотрудниковСПоказателями.ДокументОснование
	//	|ПОМЕСТИТЬ ВТИзмеренияДаты
	//	|ИЗ
	//	|	ВТНачисленияСотрудниковСПоказателями КАК НачисленияСотрудниковСПоказателями";
		
	
	//Запрос.ВыполнитьПакет();  
	
	//ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	//ПараметрыПостроения.Отборы = Отборы;
	
	//ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
	//	"ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников",
	//	Запрос.МенеджерВременныхТаблиц,
	//	Истина,
	//	ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
	//		"ВТИзмеренияДаты",
	//		"Сотрудник,Показатель,ДокументОснование"),
	//	ПараметрыПостроения);
	
	//Запрос.Текст =
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	НачисленияСотрудниковСПоказателями.Период,
	//	|	НачисленияСотрудниковСПоказателями.Сотрудник КАК Сотрудник,
	//	|	НачисленияСотрудниковСПоказателями.Начисление КАК Начисление,
	//	|	НачисленияСотрудниковСПоказателями.ДокументОснование КАК ДокументОснование,
	//	|	НачисленияСотрудниковСПоказателями.Размер КАК Размер,
	//	|	НачисленияСотрудниковСПоказателями.ОсновнойПоказатель КАК ОсновнойПоказатель,
	//	|	НачисленияСотрудниковСПоказателями.НачислениеТарифнойСтавки КАК НачислениеТарифнойСтавки,
	//	|	НачисленияСотрудниковСПоказателями.Показатель,
	//	|	ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Значение
	//	|ИЗ
	//	|	ВТНачисленияСотрудниковСПоказателями КАК НачисленияСотрудниковСПоказателями
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковСрезПоследних КАК ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников
	//	|		ПО НачисленияСотрудниковСПоказателями.Период = ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Период
	//	|			И НачисленияСотрудниковСПоказателями.Сотрудник = ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Сотрудник
	//	|			И НачисленияСотрудниковСПоказателями.Показатель = ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Показатель
	//	|			И НачисленияСотрудниковСПоказателями.ДокументОснование = ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.ДокументОснование
	//	|			И (ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Значение <> 0)
	//	|ИТОГИ
	//	|	МАКСИМУМ(Размер),
	//	|	МАКСИМУМ(ОсновнойПоказатель),
	//	|	МАКСИМУМ(НачислениеТарифнойСтавки)
	//	|ПО
	//	|	Сотрудник,
	//	|	Начисление,
	//	|	ДокументОснование";
	//	
    //
	//РезультатЗапроса = Запрос.ВыполнитьПакет();  
	//мВыборка = РезультатЗапроса[0].Выгрузить();		
	//Возврат мВыборка;


КонецФункции               



Функция ТекущиеПоказателиСотрудников(Сотрудники, ДатаСведений) Экспорт 
	
	СотрудникиДаты = Новый ТаблицаЗначений;    
 
    СотрудникиДаты.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники")); 	
    СотрудникиДаты.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));   
	Для Каждого Сотрудник Из Сотрудники Цикл  
		мСтр = СотрудникиДаты.Добавить();
		мСтр.Сотрудник = Сотрудник;
		мСтр.Период = ДатаСведений;
	КонецЦикла;	

	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ФормироватьСПериодичностьДень = Истина;  // была Ложь
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(СотрудникиДаты),
		ПараметрыПостроения);
		
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияПериодическихПоказателей.Сотрудник КАК Сотрудник,
	|	ЗначенияПериодическихПоказателей.Показатель КАК Показатель,
	|	ЗначенияПериодическихПоказателей.Период КАК Период,
	|	ЗначенияПериодическихПоказателей.ПериодЗаписи КАК ПериодЗаписи, 
	|	ЗначенияПериодическихПоказателей.ДатаНачала КАК ДатаНачала, 
	|	ЗначенияПериодическихПоказателей.ДатаОкончания КАК ДатаОкончания, 
	//|	ЗначенияПериодическихПоказателей.ЭтоВозвратноеСобытие КАК ВозвратноеСобытие, 
	|	ЗначенияПериодическихПоказателей.Значение КАК Значение
	|ИЗ
	|	ВТЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковСрезПоследних КАК ЗначенияПериодическихПоказателей";	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();             
	мВыборка = РезультатЗапроса[0].Выгрузить();		
	Возврат мВыборка;
КонецФункции 


Функция ПоискВМассивеСоответствий(мМассив,мКлюч,мЗначение,мТип)
	мРезультат = Неопределено;
	Для Каждого мСтрока Из мМассив Цикл
		//Для Каждого мЭлСтр Из мСтрока Цикл
		//	Если мЭлСтр.Ключ = мКлюч И мЭлСтр.Значение = мЗначение Тогда
		//		мРезультат = Мстрока;
		//		Прервать;
		//	КонецЕсли;
		//КонецЦикла;	
		// Теперь надо проверять не только совпадение вида оплаты, но и тип.
		мНужноеНачисление = Ложь;
		мНужныйТип = Ложь;
		Для Каждого мЭлСтр Из мСтрока Цикл
			Если мЭлСтр.Ключ = мКлюч И мЭлСтр.Значение = мЗначение Тогда
				мНужноеНачисление = Истина;
			ИначеЕсли мЭлСтр.Ключ = "Тип" И мЭлСтр.Значение = мТип Тогда
				мНужныйТип = Истина;
			КонецЕсли;
		КонецЦикла;	                
		Если мНужноеНачисление и мНужныйТип Тогда
			мРезультат = Мстрока;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	Возврат мРезультат;
КонецФункции	        

Функция ПоискВМассивеСтруктур(мМассив,мКлюч,мЗначение)
	мРезультат = Неопределено;
	Для Каждого мСтрока Из мМассив Цикл
		Для Каждого мЭлСтр Из мСтрока Цикл
			Если мЭлСтр.Ключ = мКлюч И мЭлСтр.Значение = мЗначение Тогда
				мРезультат = Мстрока;				
			КонецЕсли;
		КонецЦикла;	                 
		Если Не (мРезультат = Неопределено) Тогда
			Прервать;
		КонецЕсли;	
	КонецЦикла;		
	Возврат мРезультат;
КонецФункции	