#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Документ = Параметры.ТабДок;    	
	ЭтаФорма.Адрес = Параметры.Адрес;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаНаВОпросОСохраненииИзменений", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Документ изменен. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьИЗакрыть(Команда)
	
	Если Модифицированность Тогда 
		СохранитьВХранилище(ЭтаФорма.Документ, ЭтаФорма.Адрес); 
		Модифицированность = Ложь;
		Закрыть(Документ);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаОтветаНаВОпросОСохраненииИзменений(Результат, ДополнительныеПраметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		// Сохраняем          
		СохранитьВХранилище(ЭтаФорма.Документ, ЭтаФорма.Адрес); 
		Модифицированность = Ложь;
		Закрыть();                              
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда	
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли; 
КонецПроцедуры    

&НаСервереБезКонтекста
Процедура СохранитьВХранилище(мТабДок,мАдрес)                                   
	мХранилище=Новый ХранилищеЗначения(мТабДок);
	ПоместитьВоВременноеХранилище(мТабДок, мАдрес); 	
КонецПроцедуры	


#КонецОбласти
