
&После("ПечатьДокументовПриСозданииНаСервере")
Процедура МК_ПечатьДокументовПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)  
	// Сюда можем попасть не только из печати документов
	Если ПравоДоступа("Редактирование", Метаданные.Константы.МК_РаботаемСКЭДО) Тогда 
		мРаботаемСКЭДО = Константы.МК_РаботаемСКЭДО.Получить();
		Если мРаботаемСКЭДО И (Форма.Параметры.ПараметрКоманды.Количество() > 0) Тогда  			
		    ОО = Обработки.МК_НастройкаВыгрузки.Создать(); 
			// ВывестиПечатнуюФорму() - проверка наличия метода.
			// Создадим реквизит на форме - статус для кнопки "МояКоманда"
			мРекв = Новый Массив;
			мРекв.Добавить(Новый РеквизитФормы("МК_СтатусДляКнопки", Новый ОписаниеТипов("Число")));  
			мРекв.Добавить(Новый РеквизитФормы("МК_ИмяФормы", Новый ОписаниеТипов("Строка"))); 
			мРекв.Добавить(Новый РеквизитФормы("МК_МногоСотрудников", Новый ОписаниеТипов("Булево"))); 
			мРекв.Добавить(Новый РеквизитФормы("МК_МенеджерПечати", Новый ОписаниеТипов("Строка"))); 
			мРекв.Добавить(Новый РеквизитФормы("МК_Области", Новый ОписаниеТипов("СписокЗначений"))); 
			Форма.ИзменитьРеквизиты(мРекв);
		
			// Надо проверить - участвует ли данная печатная форма в КЭДО. Если нет, то кнопку не делаем.			
			// Но вот тип документа точно нужен и идентификатор команды печати тоже. Пока под идентификатором
			// будем понимать реквизит "ИменаМакетов". 		    
			Если Метаданные.ОбщиеМодули.Найти("КадровыйЭДОКлиентСервер") <> Неопределено Тогда  
				мМодуль = ОбщегоНазначения.ОбщийМодуль("КадровыйЭДОКлиентСервер");	
				мМодуль1 = ОбщегоНазначения.ОбщийМодуль("КадровыйЭДО");	
			Иначе	                                                                                  
				мМодуль = ОбщегоНазначения.ОбщийМодуль("ЭДОБЗККлиентСервер");				
				мМодуль1 = ОбщегоНазначения.ОбщийМодуль("ЭДОБЗК");				
			КонецЕсли;	                                                                              
			мИдент = мМодуль.ТолькоИдентификаторПечатнойФормы(Форма.ИменаМакетов); 
			Если НЕ ЗначениеЗаполнено(мИдент) Тогда       
				мИдент = Форма.Параметры.ПараметрыИсточника.ИдентификаторКоманды;
			КонецЕсли;	
			Форма.МК_ИмяФормы = мИдент;
			мТип = ТипЗнч(Форма.Параметры.ПараметрКоманды[0].Ссылка);
			мЗначение = Новый(мТип);
	        мТипДок = мЗначение.Метаданные().ПолноеИмя();	
			Форма.МК_МногоСотрудников = Ложь;  
			Форма.МК_МенеджерПечати = Форма.Параметры.ИмяМенеджераПечати;
		
			Если Справочники.МК_ВидыДокументов.ЭтоДокументКЭДО(мТипДок,мИдент) Тогда     // Тут поиск типа документа. Если есть в нашем справочнике, значит работаем с ним.     
			    мДокумент = Форма.Параметры.ПараметрКоманды[0]; 
				
				Если мТипДок = "Справочник.Сотрудники" Тогда
					мСотрудник = мДокумент;
				Иначе	
					Попытка
						мСотрудник = мДокумент.Сотрудник;    
					Исключение	
						Попытка
							мСотрудник = мДокумент.СовмещающийСотрудник; 
						Исключение   
							Попытка 
								мСотрудник = мДокумент.ФизическиеЛица[0].ФизическоеЛицо;   
								Если мДокумент.ФизическиеЛица.Количество()>1 Тогда
									мМногоСотрудников = Истина;
								КонецЕсли;	
							Исключение    
								Попытка 
									мСотрудник = мДокумент.Сотрудники[0].Сотрудник;   
									Если мДокумент.Сотрудники.Количество()>1 Тогда
										Форма.МК_МногоСотрудников = Истина;
									КонецЕсли;	
								Исключение   
									Попытка      
										мСотрудник = мДокумент.Субъект;
									Исключение
									КонецПопытки;	
								КонецПопытки;	
							КонецПопытки;	
						КонецПопытки;	
					КонецПопытки;
				КонецЕсли;			
				Если Не Форма.МК_МногоСотрудников Тогда
					// В большинстве документов Сотрудник - это Сотрудник.Ссылка. Но есть и такие (пока обнаружен только приказ на отпуск 
					// по уходу за ребенком), где Сотрудник - ФизическоеЛицо.Ссылка    
					Если ТипЗнч(мСотрудник) = Тип("СправочникСсылка.ФизическиеЛица") Тогда   
						// Нужно найти сотрудника.
						мСписСотр = ОО.СписокСотрудниковПоФизлицу(мДокумент.Организация,мСотрудник);  // В этой функции подбираются только основные сотрудники или внешние
						Если мСписСотр.Следующий() Тогда                                              // совместители. Если все хорошо, вернется одна запись. Если больше - нас не волнует,
							мСотрудник = мСписСотр.СотрудникСсылка;                                   // возьмем первого.
						КонецЕсли;	
					КонецЕсли;	

					// Нужно проверить сотрудника на предмет КЭДО
					Если Справочники.МК_СотрудникиКЭДО.ПроверитьСогласиеКЭДО(мСотрудник) Тогда	 				
						Форма.МК_СтатусДляКнопки = 0;	
					Иначе
						Форма.МК_СтатусДляКнопки = 2;	
					КонецЕсли;	 
				Иначе	                                
					//Форма.МК_СтатусДляКнопки = 3;	
					Форма.МК_СтатусДляКнопки = 0;	// Проба работы со списочным документом более 1 сотрудника     
					Если Форма.Параметры.ПараметрыПечати.Свойство("ДополнительныеПараметры") И 
						 Форма.Параметры.ПараметрыПечати.ДополнительныеПараметры.Свойство("ИдентификаторыОбластейОбъектов") Тогда
						мСО = Форма.Параметры.ПараметрыПечати.ДополнительныеПараметры.ИдентификаторыОбластейОбъектов;
						Для Каждого мСтрока Из мСО Цикл
							Форма.МК_Области = мСтрока.Значение;
						КонецЦикла;					
					КонецЕсли	
				КонецЕсли;	
			Иначе
				Форма.МК_СтатусДляКнопки = 1;	
			КонецЕсли;	
			//Создаем Команду
			МК_Команда = Форма.Команды.Добавить("МояКоманда");              
			МК_Команда.Действие = "Подключаемый_ВыполнитьКоманду"; 	
			МК_Команда.Заголовок = "Моя Команда";
			//Создаем Кнопку     	  
			КнопкаФормы = мМодуль1.РазместитьКомандуНаФормеПечатьДокументов(Форма, МК_Команда);
			Если КнопкаФормы <> Неопределено Тогда
				КнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
				КнопкаФормы.ИмяКоманды = "МояКоманда";     
				КнопкаФормы.ТолькоВоВсехДействиях = Ложь;
				Если Форма.МК_СтатусДляКнопки = 1 Тогда
					Форма.Элементы.МояКоманда.Картинка = БиблиотекаКартинок.МК_ДокументНеКЭДО;					
				ИначеЕсли Форма.МК_СтатусДляКнопки = 2 Тогда                         
					Форма.Элементы.МояКоманда.Картинка = БиблиотекаКартинок.МК_НетСогласияКэдо;					
				ИначеЕсли Форма.МК_СтатусДляКнопки = 3 Тогда                         
					Форма.Элементы.МояКоманда.Картинка = БиблиотекаКартинок.МК_НетСогласияКэдо;						
				КонецЕсли;    	                                                             
				Форма.Элементы.МояКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
			КонецЕсли;		
		КонецЕсли;	
	КонецЕсли;	   
КонецПроцедуры

