
&После("ПечатьДокументовВыполнитьКоманду")
Процедура МК_ПечатьДокументовВыполнитьКоманду(Форма, Команда, ПродолжитьВыполнениеНаСервере, ДополнительныеПараметры)   
	// Надо проверить - что за команда прилетела  
	Если Команда.Имя = "МояКоманда" Тогда   
		Если Форма.МК_СтатусДляКнопки =1 Тогда
			Сообщить("Документ не относится к КЭДО");
		ИначеЕсли Форма.МК_СтатусДляКнопки =2 Тогда	
			Сообщить("У сотрудника нет согласия на работу с КЭДО");
		ИначеЕсли Форма.МК_СтатусДляКнопки =3 Тогда	
			Сообщить("В документе КЭДО не должно быть более одного сотрудника");	
		Иначе	
			мПар = ПодключаемыеКомандыКлиент.ПараметрыВыполненияКоманды();
			//НастройкаПечатнойФормы = УправлениеПечатьюКлиент.НастройкаТекущейПечатнойФормы(Форма);
			//ПараметрыФормы = Новый Структура("мДок", Форма.ВладелецФормы.Объект.Ссылка);  		
			ПараметрыФормы = Новый Структура("мДок", Форма.Параметры.ПараметрКоманды[0]);  	
			ПараметрыФормы.Вставить("ИменаМакетов",Форма.МК_ИмяФормы);
			ПараметрыФормы.Вставить("МК_МенеджерПечати",Форма.МК_МенеджерПечати);
			ПараметрыФормы.Вставить("МК_МногоСотрудников",Форма.МК_МногоСотрудников);
			ПараметрыФормы.Вставить("МК_Области",Форма.МК_Области);
			// Оп = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);  // Оповещение больше не нужно.
			// Открываем дочернюю форму документа для редактирования дополнительных реквизитов 
			ОткрытьФорму("Обработка.МК_ОтправкаДокумента.Форма.ОтправкаДокумента",ПараметрыФормы,Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
