&НаКлиенте
Процедура ВыгрузитьОстаткиОтпусков(Команда)   
	Если Не ЭтаФорма.ВыгрузкаОстатковОтпусков И Не ЭтаФорма.ВыгрузкаПроведенныхДокументовОтпусков Тогда
		ПоказатьПредупреждение(, "Нужно выбрать какой-то режим выгрузки");   
		Возврат;
	КонецЕсли;	
	
	мВозврат = ВыгрузитьОО();  
	// Надо обработать мВозврат  
	мВозврат1 = мВозврат[0];
	мВозврат2 = мВозврат[1];  
	Если ЭтаФорма.ВыгрузкаОстатковОтпусков Тогда
		Если мВозврат1[0] = 1 Тогда       
			Если мВозврат1[1] > 0 Тогда
				ПоказатьПредупреждение(, "Выгрузка сведений по остаткам отпусков завершена. Успешно выгружено записей: "+мВозврат1[1]);
			Иначе
				ПоказатьПредупреждение(, "Сведений по остаткам отпусков для выгрузки не найдено.");
			КонецЕсли;	
		ИначеЕсли мВозврат1[0] = 0 Тогда
			ПоказатьПредупреждение(, "Выгрузка не выполнена: ошибка авторизации.");
		ИначеЕсли мВозврат1[0] = 2 Тогда   // Это выгрузка в файл
			Если мВозврат1[1] > 0 Тогда   
				МассивОписаний=Новый Массив;
				Описание=Новый ОписаниеПередаваемогоФайла(); 
				Описание.Имя = мВозврат1[3];
				Описание.Хранение = мВозврат1[2];         
				МассивОписаний.Добавить(Описание);  
				НачатьПолучениеФайловССервера(МассивОписаний);   
				Сообщить("Файл "+мВозврат1[3]+" создан.");
				ПоказатьПредупреждение(, "Выгрузка сведений по остаткам отпусков в файл завершена: Успешно выгружено записей: "+мВозврат1[1]);
			Иначе                                                                
				ПоказатьПредупреждение(, "Сотрудников для выгрузки не найдено.");
			КонецЕсли	
		КонецЕсли; 
	КонецЕсли; 	
	Если ЭтаФорма.ВыгрузкаПроведенныхДокументовОтпусков Тогда
		Если мВозврат2[0]=1 Тогда
			ПоказатьПредупреждение(, "Выгрузка документов отсутствий завершена. Успешно выгружено записей: "+мВозврат2[1]);
		ИначеЕсли мВозврат2[0] = 2 Тогда   // Это выгрузка в файл
			Если мВозврат2[1] > 0 Тогда   
				МассивОписаний=Новый Массив;
				Описание=Новый ОписаниеПередаваемогоФайла(); 
				Описание.Имя = мВозврат2[3];
				Описание.Хранение = мВозврат2[2];         
				МассивОписаний.Добавить(Описание);  
				НачатьПолучениеФайловССервера(МассивОписаний);   
				Сообщить("Файл "+мВозврат2[3]+" создан.");
				ПоказатьПредупреждение(, "Выгрузка документов отсутствий в файл завершена. Успешно выгружено записей: "+мВозврат2[1]);
			Иначе                                                                
				ПоказатьПредупреждение(, "Документов отсутствий для выгрузки не найдено.");
			КонецЕсли	
		КонецЕсли;                           		
	КонецЕсли;	
	//ПоказатьПредупреждение(, "Выгрузка данных по отпускам завершена");
КонецПроцедуры    

&НаСервере
Функция ВыгрузитьОО()
	мВозврат = Обработки.МК_ОстаткиОтпусков.ВыгрузитьОстаткиОтпусковНаСервере(ЭтаФорма);   
	Возврат мВозврат;
КонецФункции	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мДата = ТекущаяДата();  
	// Пока принято решение выгружать остатки отпусков на 1 число текущего месяца.
	// Но пользователь может исправить.
	// Изменена постановка. Теперь - на текущую дату.
	ЭтаФорма.ДатаОстатков = мДата;
	// ЭтаФорма.ДатаОстатков = Дата(Год(мДата),Месяц(мДата),1);  // Получили первое число текущего месяца.  
	ЭтаФорма.КаталогДляВыгрузкиФайлов = Константы.МК_КаталогДляВыгрузкиФайлов.Получить();    
	ЭтаФорма.ВыгрузкаОстатковОтпусков = Константы.МК_ВыгружатьОстаткиОтпусков.Получить();
	ЭтаФорма.ВыгрузкаПроведенныхДокументовОтпусков = Константы.МК_ВыгружатьДокументыОтпусков.Получить();
	ЭтаФорма.ДниДоТекущейДаты = Константы.МК_ВыгрузкаОтпусковДниДоТекущейДаты.Получить();
	ЭтаФорма.СпособВыгрузки = 1;
КонецПроцедуры

&НаКлиенте
Процедура КаталогДляВыгрузкиФайловНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ЭтаФорма.КаталогДляВыгрузкиФайлов; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	Если ДиалогОткрытия.Выбрать() Тогда   
		ЭтаФорма.КаталогДляВыгрузкиФайлов = ДиалогОткрытия.Каталог; 
	КонецЕсли;  
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура КаталогДляВыгрузкиФайловПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры  

&НаСервере
Процедура СохранитьНастройки()
	Константы.МК_КаталогДляВыгрузкиФайлов.Установить(ЭтаФорма.КаталогДляВыгрузкиФайлов); 
	Константы.МК_ВыгружатьОстаткиОтпусков.Установить(ЭтаФорма.ВыгрузкаОстатковОтпусков);
	Константы.МК_ВыгружатьДокументыОтпусков.Установить(ЭтаФорма.ВыгрузкаПроведенныхДокументовОтпусков);
	Константы.МК_ВыгрузкаОтпусковДниДоТекущейДаты.Установить(ЭтаФорма.ДниДоТекущейДаты);
КонецПроцедуры	


&НаКлиенте
Процедура ВыгрузкаОстатковОтпусковПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

