Функция ПроверкаСвязиМК(мПараметры) Экспорт      
	// Тут - два этапа проверки. Первый - просто постучаться на сервер. Это для проверки правильного ввода
	// имени ресурса.
	Результат = 0; // 0 - это не достучались до сервера, 1 - с сервером получилось, но авторизация не прошла, 2 - все хорошо.   
	мРеквС = Неопределено;	
	МК_Сервер = мПараметры.Сервер;
	ИмяСервера = ПолучитьИмяСервера(МК_Сервер);
		
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровОС);
	hСоединение = Новый HTTPСоединение(ИмяСервера,,,,,,ЗащищенноеСоединение);
	Попытка
		hЗапрос = Новый HTTPЗапрос("/api/healthz/");  // Тут простой запрос. Постучался - ответили "ok", значит сервер правильный    
		hОтвет = hСоединение.ВызватьHTTPМетод("GET", hЗапрос);
		мОтвет = hОтвет.ПолучитьТелоКакСтроку();    
		Если НРег(мОтвет) = "ok" Тогда         
			Результат = 1;
			// Теперь есть смысл проверить логин и пароль.
			мРеквС = СоздатьСеансСвязи(Истина,мПараметры);	
			Если НЕ (мРеквС = Неопределено) Тогда
				Результат = 2;
			КонецЕсли;	
		КонецЕсли;	
	Исключение  
		Результат = 0;
	КонецПопытки;	
	Возврат Результат;	
КонецФункции	


Функция СоздатьСеансСвязи(ИнтерактивныйРежим,мПараметры = Неопределено) Экспорт      
	// Тут создается HTTP соединение и выполняется авторизация.    
	Результат = Истина;
	РеквизитыСеанса = Новый Структура;                          
	// К реквизитам сеанса относятся
	// Сервер - Имя Сервера;
	// hСоединение - HTTP соединение;
	// Токен - мТокен, полученный от сервера  
	Если мПараметры = Неопределено Тогда
		МК_Сервер = Константы.МК_Сервер.Получить();
	Иначе     
		МК_Сервер = мПараметры.Сервер;        // Это - для проверки связи
	КонецЕсли;	
	ИмяСервера = ПолучитьИмяСервера(МК_Сервер); 
	РеквизитыСеанса.Вставить("Сервер",ИмяСервера);  
	hСоединение = СоздатьHTTPСоединение(РеквизитыСеанса);
	РеквизитыСеанса.Вставить("Соединение", hСоединение);
	РеквизитыСеанса.Вставить("ИнтерактивныйРежим",ИнтерактивныйРежим);
	мТокен = ПолучитьТокен(РеквизитыСеанса,мПараметры);
	Если мТокен = Неопределено Тогда      
		// Связь установить не удалось
		РеквизитыСеанса = Неопределено;   
	Иначе	
		РеквизитыСеанса.Вставить("Токен",мТокен);
	КонецЕсли;	
	// Добавил новый end-point GET /api/1c-exchange/check, который проверяет включен ли обмен с 1С и возвращает соответствующий ответ. Залил на dev. Доступен с авторизацией.
	// Теперь после получения токена надо проверить: включен ли обмен с 1С.
	Если НЕ РеквизитыСеанса = Неопределено Тогда	
		//hЗапрос = Новый HTTPЗапрос("/api/1c-exchange/check"); 		
		hЗапрос = СоздатьHTTPЗапрос("/api/1c-exchange/check", РеквизитыСеанса);   
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
		hОтвет = hСоединение.ВызватьHTTPМетод("GET", hЗапрос); 
    	Результат = ПроверитьОтвет(hОтвет,"Проверка связи", ИнтерактивныйРежим);
	КонецЕсли;	
	Если Не Результат Тогда
		РеквизитыСеанса = Неопределено;
	КонецЕсли;	
	Возврат РеквизитыСеанса;
КонецФункции


Функция ПолучитьТокен(РеквизитыСеанса, мПараметры = Неопределено)   Экспорт
	Если мПараметры = Неопределено Тогда
		мЛогин = Константы.МК_Логин.Получить();
		мПароль = Константы.МК_Пароль.Получить();  
	Иначе                                        
		мЛогин = мПараметры.Логин;
		мПароль = мПараметры.Пароль;
	КонецЕсли;	
	мТокен = Неопределено;

	мЗапрос = Новый Структура;  
	мЗапрос.Вставить("email",мЛогин);
    мЗапрос.Вставить("password", мПароль);
     
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Попытка
		ЗаписатьJSON(ЗаписьJSON, мЗапрос);	
		ТекстJSON = ЗаписьJSON.Закрыть();
	Исключение
		Сообщить(ЗначениеВСтрокуВнутр(мЗапрос));
		ВызватьИсключение(ОписаниеОшибки());
	КонецПопытки;
	
	hЗапрос = Новый HTTPЗапрос("/api/login-1c");   
	hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
	hЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
	hОтвет = РеквизитыСеанса.Соединение.ВызватьHTTPМетод("POST", hЗапрос); 
	мОтвет = hОтвет.ПолучитьТелоКакСтроку();    
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(мОтвет);
		СтруктураОтвет = ПрочитатьJSON(ЧтениеJSON);
		Если СтруктураОтвет.data.Свойство("token") Тогда
		    мТокен = СтруктураОтвет.data.token;    
		Иначе
			ПроверитьОтвет(hОтвет, "Авторизация.",РеквизитыСеанса.ИнтерактивныйРежим);
		КонецЕсли;	
	Исключение
		ПроверитьОтвет(hОтвет, "Авторизация.",РеквизитыСеанса.ИнтерактивныйРежим);
	КонецПопытки;	
	Возврат мТокен;	  
КонецФункции

//  Это – краткий список организаций для разных нужд.
Функция ПолучитьСписокОрганизаций() Экспорт    
	// (26.06.24) Теперь список нужных организаций обрабатывается сложней:
	// 1. Может отсутствовать галочка "учитывать организации". Тогда учитываем все.
	// 2. Если учитываем, то надо смотреть на то, как:
	// 2.1 Если "выгружать", то список в константе - это то,что надо
	// 2.2 Если "не выгружать", то нужно взять полный список организаций и убрать из него те, что в константе.
	Попытка
		СписокОрганизаций = Константы.МК_СписокОрганизаций.Получить().Получить();     	
		Если СписокОрганизаций = Неопределено Тогда
			СписокОрганизаций = Новый СписокЗначений;	
			Константы.МК_СписокОрганизаций.Установить(Новый ХранилищеЗначения(СписокОрганизаций));
		КонецЕсли;	
	Исключение    
		СписокОрганизаций = Новый СписокЗначений;		
		Константы.МК_СписокОрганизаций.Установить(Новый ХранилищеЗначения(СписокОрганизаций));
	КонецПопытки;	
	// Получим полный список
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления";
	
	мСписОргПолный = Новый СписокЗначений; 
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
		
	Пока Выборка.Следующий() Цикл
		мСписОргПолный.Добавить(Выборка.Ссылка);
	КонецЦикла; 	
	  
    // Надо прочитать две константы: МК_УчитываемыеФильтры и МК_ВидыДействий.
	мУО = ПолучитьУчитываемыеФильтры()[0]; // Это массив. Первый (нулевой) элемент отвечает за организации    
	мВД = ПолучитьВидыДействия()[0];       // То же самое
	Если мУО = "0" Тогда   // Значит фильтр по организациям не активирован. Возвращаем полный список
		мВозврат = мСписОргПолный;
	Иначе                         
		Если мВД = "1" Тогда  // Значит выбрано "выгружать". Возвращаем сохраненный список  
			мВозврат = СписокОрганизаций;
		Иначе                 // Выбрано "не выгружать". Значит надо вернуть список кроме выбранных.
			мВозврат = Новый СписокЗначений;
			Для Каждого мОрг Из мСписОргПолный Цикл
				Если СписокОрганизаций.НайтиПоЗначению(мОрг.Значение) = Неопределено Тогда
					мВозврат.Добавить(мОрг.Значение);
				КонецЕсли;	
			КонецЦикла; 	
		КонецЕсли;	
	КонецЕсли;	
    Возврат мВозврат;
КонецФункции

Функция ПолучитьФильтрСотрудники() Экспорт  
	мСписок = Неопределено;
	// Надо прочитать две константы: МК_УчитываемыеФильтры и МК_ВидыДействий.
	мУО = ПолучитьУчитываемыеФильтры()[4]; // Это массив. Четвертый элемент отвечает за сотрудников
	мВД = "0";
	Если мУО = "1" Тогда    // Учитывается
		мВД = ПолучитьВидыДействия()[4];       // То же самое
        мСписок = ПолучитьСписокСотрудников() 
	КонецЕсли;
	мВозврат = Новый Массив;
	мВозврат.Добавить(мВД);
	мВозврат.Добавить(мСписок);
	Возврат мВозврат;
КонецФункции	

Функция ПолучитьФильтрДолжности() Экспорт     
	мСписок = Неопределено;
	// Надо прочитать две константы: МК_УчитываемыеФильтры и МК_ВидыДействий.
	мУО = ПолучитьУчитываемыеФильтры()[3]; // Это массив. Третий элемент отвечает за должности    
	мВД = "0";
	Если мУО = "1" Тогда    // Учитывается
		мВД = ПолучитьВидыДействия()[3];       // То же самое
        мСписок = ПолучитьСписокДолжностей() 
	КонецЕсли;
	мВозврат = Новый Массив;
	мВозврат.Добавить(мВД);
	мВозврат.Добавить(мСписок);
	Возврат мВозврат;
КонецФункции  

Функция ПолучитьФильтрПодразделения() Экспорт                                   
	мСписок = Неопределено;
	// Надо прочитать две константы: МК_УчитываемыеФильтры и МК_ВидыДействий.
	мУО = ПолучитьУчитываемыеФильтры()[2]; // Это массив. Второй элемент отвечает за подразделения
	мВД = "0";
	Если мУО = "1" Тогда    // Учитывается
		мВД = ПолучитьВидыДействия()[2];       // То же самое
        мСписок = ПолучитьСписокПодразделений() 
	КонецЕсли;
	мВозврат = Новый Массив;
	мВозврат.Добавить(мВД);
	мВозврат.Добавить(мСписок);
	Возврат мВозврат;
КонецФункции

Функция ПолучитьФильтрСтруктуры() Экспорт                                   
	мСписок = Неопределено;
	// Надо прочитать две константы: МК_УчитываемыеФильтры и МК_ВидыДействий.
	мУО = ПолучитьУчитываемыеФильтры()[5]; // Это массив. Элемент 22 отвечает за подразделения
	мВД = "0";
	Если мУО = "1" Тогда    // Учитывается
		мВД = ПолучитьВидыДействия()[5];       // То же самое
        мСписок = ПолучитьСписокПодразделенийСтруктура() 
	КонецЕсли;
	мВозврат = Новый Массив;
	мВозврат.Добавить(мВД);
	мВозврат.Добавить(мСписок);
	Возврат мВозврат;
КонецФункции


Функция ПолучитьФильтрВидыЗанятости() Экспорт   
	мСписВЗ = Новый СписокЗначений;
	// Надо прочитать две константы: МК_УчитываемыеФильтры и МК_ВидыДействий.
	мУО = ПолучитьУчитываемыеФильтры()[1]; // Это массив. Первый элемент отвечает за виды занятости
	мВД = "0";                         
	мГПХ = "0";  // Не учитывать фильтр по ГПХ
	Если мУО = "1" Тогда    // Учитывается
		мВД = ПолучитьВидыДействия()[1];       // То же самое
        мСписок = ПолучитьВидыЗанятости(); 
		// С видами занятости не так просто, как с остальными фильтрами. Во первых мы в список видов добавили "ГПХ". А он на самом деле -
		// отдельный реквизит. Во вторых собственно виды занятости - это перечисление. А сохраняем строку.
		// Поэтому массив будет сложнее. Первый элемент будет определять - что делать с ГПХ   
		Для Каждого мВЗ ИЗ мСписок Цикл
			Если мВЗ.Значение = "ГПХ" Тогда  // ГПХ в списке есть  
				мГПХ = мВД
			ИначеЕсли мВЗ.Значение = "Основное место работы" Тогда  
				мСписВЗ.Добавить(Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);             
			ИначеЕсли мВЗ.Значение = "ВнешнееСовместительство" Тогда  
				мСписВЗ.Добавить(Перечисления.ВидыЗанятости.Совместительство);
	        ИначеЕсли мВЗ.Значение = "ВнутреннееСовместительство" Тогда  
				мСписВЗ.Добавить(Перечисления.ВидыЗанятости.ВнутреннееСовместительство); 
			Иначе
			    мСписВЗ.Добавить(Неопределено);
			КонецЕсли;	
		КонецЦикла;	 
		Если мГПХ = "0" И мВД = "1" Тогда   // Если ГПХ в списке нет, но сказано "выгружать", значит надо указать, что ГПХ не выгружать 
			мГПХ = "2";
		КонецЕсли;			
	КонецЕсли;
	мВозврат = Новый Массив;
	// Поэтому массив будет сложнее. Первые два элемента отвечают за виды занятости, а третий элемент будет определять - что делать с ГПХ   
	мВозврат.Добавить(мВД);
	мВозврат.Добавить(мСписВЗ);
	мВозврат.Добавить(мГПХ);
	Возврат мВозврат;
КонецФункции

Функция ВыгрузитьФайлНаСайт(мФайл, РеквизитыСеанса,мТипФайла,ИнтерактивныйРежим, мАдрес,мРежим)  Экспорт   
	// Эта функция в связи с КЭДО будет отправлять различные файлы. Увеличиваем кол-во параметров.
	// мАдрес: пример для расчетных листков - "/api/1c-exchange/pay-list/upload"
	// мРежим: пример для расчетных листков - "Расчетные листки"
	Результат = Ложь;  // Надо вернуть ответ - получилось отправить или нет   
	
	// Если вызов функции происходит из процедуры создания файлов, то сюда прилетает мФайл - строка - полное имя файла.
	// Если же это повторная отправка сохраненного файла, то прилетает ссылка на сохраненный файл.  
	ДвоичныеДанные = Неопределено;
	Если ТипЗНЧ(мФайл) = Тип("Строка") Тогда
		// Надо получить чистое имя файла, без пути    
		мФайл1 =  Сред(мФайл, СтрНайти(мФайл, "\", НаправлениеПоиска.СКонца) + 1); 
		ДвоичныеДанные = Новый ДвоичныеДанные(мФайл);
	Иначе 
		Попытка
			ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(мФайл); 
			мФайл1 = мФайл.Наименование+".zip";
		Исключение
		КонецПопытки;	
	конецЕсли;	                  
	Если НЕ (ДвоичныеДанные = Неопределено) Тогда
		// Пойдем по сложному пути
		Разделитель = СтрЗаменить(Новый УникальныйИдентификатор(), "-", "");  
	
		Тело = Новый ПотокВПамяти();
		ЗаписьДанных = Новый ЗаписьДанных(Тело, , , Символы.ВК + Символы.ПС, ""); // переопределение разделителей               
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=file; filename=" + мФайл1);
		ЗаписьДанных.ЗаписатьСтроку("Content-Type: "+мТипФайла);
		ЗаписьДанных.ЗаписатьСтроку(""); // пустая строка для доп переноса и воспроизведения структуры тела
		ЗаписьДанных.Записать(ДвоичныеДанные); // добавляет данные но каретка остается после данных
		ЗаписьДанных.ЗаписатьСтроку(""); // записать не добавляет переносов, добавляем их пустой строкой
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель + "--"); // добавляются еще доп переносы, но они уже не на что не влияют, так же после разделителя добавляем "--", должно обозначать конец тела
		ЗаписьДанных.Закрыть();
	
		ДанныеТела = Тело.ЗакрытьИПолучитьДвоичныеДанные(); // получаем тело в дд

	
    	Попытка
			
			hЗапрос = СоздатьHTTPЗапрос(мАдрес, РеквизитыСеанса); 		
			hЗапрос.УстановитьТелоИзДвоичныхДанных(ДанныеТела); // установили тело  
			hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
			hЗапрос.Заголовки.Вставить("Content-Length", XMLСтрока(ДанныеТела.Размер()));
			hЗапрос.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);
			hОтвет = РеквизитыСеанса.Соединение.ОтправитьДляОбработки(hЗапрос); // финал
       		Результат = ПроверитьОтвет(hОтвет,мРежим, ИнтерактивныйРежим);   			
		Исключение
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			//ДобавитьОписаниеОшибки(ОписаниеОшибки, ОписаниеОшибки());		
		КонецПопытки;	
	КонецЕсли;	
	Возврат Результат;
КонецФункции    


// Служебные функции.

Функция ПолучитьИмяСервера(ИмяСервера)  Экспорт
	
	ИмяСервера = НРег(СокрЛП(ИмяСервера));
	ИмяСервера = СтрЗаменить(ИмяСервера, "http://", "");
	ИмяСервера = СтрЗаменить(ИмяСервера, "https://", "");
	ИмяСервера = СтрЗаменить(ИмяСервера, "/", "");
	
	Возврат ИмяСервера;                                                                         
	
КонецФункции

Функция СоздатьHTTPСоединение(РеквизитыСеанса) Экспорт
	
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровОС);
	hСоединение = Новый HTTPСоединение(РеквизитыСеанса.Сервер,,,,,,ЗащищенноеСоединение);	
	Возврат hСоединение; 
	
КонецФункции	

Функция СоздатьHTTPЗапрос(АдресРесурса, РеквизитыСеанса) Экспорт
	
	hЗапрос = Новый HTTPЗапрос(АдресРесурса);   
	мТокен = РеквизитыСеанса.Токен;
	hЗапрос.Заголовки.Вставить("authorization", "Bearer "+мТокен);
		
	Возврат hЗапрос;
	
КонецФункции

Функция ПолучитьВидыКонтИнф() Экспорт // Эта функция не только тут нужна
	мКонтИнф = Константы.МК_КонтактнаяИнформация.Получить().Получить();
	// Этот массив сейчас должен состоять из трех элементов:
	// 0 - ссылка на основной email для "МояКоманда";
	// 1 - ссылка на дополнительный email;
	// 2 - ссылка на телефон    
	// 3 - ссылка на адрес (добавлена 06.05.2024).
	Если мКонтИнф = Неопределено Тогда // Этот вариант может случиться только один раз.
		мКонтИнф = Новый Массив(4);
		мКонтИнф[0] = Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИмяПредопределенногоВида","EmailФизическиеЛица");
		мКонтИнф[1] = Неопределено;  // ПустаяСсылка();  //ПолучитьПустоеЗначение("СправочникКонтактнойИнформации"); 
		// Дополнительного мэйла может не быть, поэтому второй элемент по умолчанию не заполнен
		мКонтИнф[2] = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Мобильный телефон");
		// Дополнительного мэйла может не быть, поэтому второй элемент по умолчанию не заполнен
		// Сразу сохраним массив.
		Константы.МК_КонтактнаяИнформация.Установить(Новый ХранилищеЗначения(мКонтИнф));
	КонецЕсли;  	
	Если мКонтИнф.Количество() = 3 Тогда       // Из-за добавленного адреса.
		мКонтИнф.Добавить(Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИмяПредопределенногоВида","АдресМестаПроживанияФизическиеЛица"));
		Константы.МК_КонтактнаяИнформация.Установить(Новый ХранилищеЗначения(мКонтИнф));
	КонецЕсли;	
	
	Возврат мКонтИнф;
КонецФункции	

Функция ПолучитьПереопределяемыеРеквизиты() Экспорт 
	мПР = Константы.МК_ПереопределяемыеРеквизиты.Получить().Получить();
	// Этот массив сейчас должен состоять из трех элементов: - Теперь 4
	// 0 - Фамилия;
	// 1 - Имя;
	// 2 - Отчество    	 
	// 3 - Руководитель подразделения
	// 4 - Должность
	Если мПР = Неопределено Тогда // Этот вариант может случиться только один раз.
		мПР = Новый Массив(5);
		Константы.МК_ПереопределяемыеРеквизиты.Установить(Новый ХранилищеЗначения(мПР));  
	ИначеЕсли мПР.Количество() = 3 Тогда
		мПР.Добавить("");
		Константы.МК_ПереопределяемыеРеквизиты.Установить(Новый ХранилищеЗначения(мПР));   
	ИначеЕсли мПР.Количество() = 4 Тогда
		мПР.Добавить("");
		Константы.МК_ПереопределяемыеРеквизиты.Установить(Новый ХранилищеЗначения(мПР)); 	
	КонецЕсли; 		
	Возврат мПР;
КонецФункции	

Функция ПолучитьНастройкиВыгружаемойИнформации()  Экспорт
	мсНВИ = Константы.МК_НастройкиВыгрузкиИнформации.Получить();   // Ожидается строка типа "1,1,1, ..0."     
	мКолвоНВИ = 23;
	// 20.03.2026 добавлен реквизит с номером 22 - Выгружать структуру предприятия.
	Если ПустаяСтрока(мсНВИ) Тогда
		мНВИ = Новый Массив(мКолвоНВИ);
		Для мИндекс = 0 По мКолвоНВИ-1 Цикл  
			Если мИндекс = 22 Тогда
				мНВИ[мИндекс] = " ";  // Структура по умолчанию не выгружается.
			Иначе	
				мНВИ[мИндекс] = "1";
			КонецЕсли;	
		КонецЦикла;	
		СохранитьНВИ1(мНВИ);
	Иначе
		мНВИ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(мсНВИ);
		мКолво = мНВИ.Количество();
		Если мКолво < мКолвоНВИ Тогда
			Для мИндекс = мКолво+1 По мКолвоНВИ Цикл
				Если мИндекс = 23 Тогда
					мНВИ.Добавить(" ");  // Структура по умолчанию не выгружается.
				Иначе	
					мНВИ.Добавить("1");
				КонецЕсли;					
			КонецЦикла;
			СохранитьНВИ1(мНВИ);
		КонецЕсли;	
	КонецЕсли;
    Возврат мНВИ;
КонецФункции     

Функция ПолучитьСписокДолжностей()  Экспорт     
	Попытка
		мСписокДолжностей = Константы.МК_СписокДолжностей.Получить().Получить();   // Список значений     
		Если мСписокДолжностей = Неопределено Тогда
			мСписокДолжностей = Новый СписокЗначений;
		КонецЕсли;	
	Исключение
		мСписокДолжностей = Новый СписокЗначений;
	КонецПопытки;	
    Возврат мСписокДолжностей;
КонецФункции 

Функция ПолучитьСписокПодразделений()  Экспорт     
	Попытка
		мСписокДолжностей = Константы.МК_СписокПодразделений.Получить().Получить();   // Список значений     
		Если мСписокДолжностей = Неопределено Тогда
			мСписокДолжностей = Новый СписокЗначений;
		КонецЕсли;	
	Исключение
		мСписокДолжностей = Новый СписокЗначений;
	КонецПопытки;	
    Возврат мСписокДолжностей;
КонецФункции       

Функция ПолучитьСписокПодразделенийСтруктура()  Экспорт     
	Попытка
		мСписокДолжностей = Константы.МК_СписокПодразделенийСтруктура.Получить().Получить();   // Список значений     
		Если мСписокДолжностей = Неопределено Тогда
			мСписокДолжностей = Новый СписокЗначений;
		КонецЕсли;	
	Исключение
		мСписокДолжностей = Новый СписокЗначений;
	КонецПопытки;	
    Возврат мСписокДолжностей;
КонецФункции      

Функция ПолучитьСписокСотрудников()  Экспорт     
	Попытка
		мСписокСотрудников = Константы.МК_СписокСотрудников.Получить().Получить();   // Список значений     
		Если мСписокСотрудников = Неопределено Тогда
			мСписокСотрудников = Новый СписокЗначений;
		КонецЕсли;	
	Исключение
		мСписокСотрудников = Новый СписокЗначений;
	КонецПопытки;	
    Возврат мСписокСотрудников;
КонецФункции 

Функция ПолучитьВидыЗанятости()  Экспорт    
	Попытка
		мСписокВЗ = Константы.МК_СписокВидовЗанятости.Получить().Получить();   // Список значений     
		Если мСписокВЗ = Неопределено Тогда
			мСписокВЗ = Новый СписокЗначений;
		КонецЕсли;	
	Исключение
		мСписокВЗ = Новый СписокЗначений;
	КонецПопытки;	
    Возврат мСписокВЗ;
КонецФункции       

Функция ПолучитьУчитываемыеФильтры()  Экспорт
	мсУФ = Константы.МК_УчитываемыеФильтры.Получить();   // Ожидается строка типа "1,1,1, ..0."     
	мКолвоУФ = 6;
	Если ПустаяСтрока(мсУФ) Тогда
		мУФ = Новый Массив(мКолвоУФ);
		Для мИндекс = 0 По мКолвоУФ-1 Цикл
			мУФ[мИндекс] = "0";
		КонецЦикла;			
	Иначе
		мУФ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(мсУФ);
		мКолво = мУФ.Количество();
		Если мКолво < мКолвоУФ Тогда
			Для мИндекс = мКолво+1 по мКолвоУФ Цикл
				мУФ.Добавить("0");
			КонецЦикла;			
		КонецЕсли;	
	КонецЕсли;
    Возврат мУФ;
КонецФункции   

Функция ПолучитьВидыДействия()  Экспорт
	мсВД = Константы.МК_ВидыДействия.Получить();   // Ожидается строка типа "1,1,1, ..2."     
	мКолвоВД = 6;
	Если ПустаяСтрока(мсВД) Тогда
		мВД = Новый Массив(мКолвоВД);
		Для мИндекс = 0 По мКолвоВД-1 Цикл
			мВД[мИндекс] = "1";
		КонецЦикла;			
	Иначе
		мВД = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(мсВД);
		мКолво = мВД.Количество();
		Если мКолво < мКолвоВД Тогда
			Для мИндекс = мКолво+1 по мКолвоВД Цикл
				мВД.Добавить("1");
			КонецЦикла;			
		КонецЕсли;	
	КонецЕсли;
    Возврат мВД;
КонецФункции

Процедура СохранитьНВИ1(мНВИ)
	мсНВИ = "";     
	мКолвоНВИ = мНВИ.Количество();
	Для мИндекс = 0 По мКолвоНВИ - 1 Цикл
		мсНВИ = мсНВИ + мНВИ[мИндекс];
		Если мИндекс <> мКолвоНВИ - 1 Тогда
			мсНВИ = мсНВИ + ",";
		КонецЕсли;	
	КонецЦикла;
	Константы.МК_НастройкиВыгрузкиИнформации.Установить(мсНВИ);	
КонецПроцедуры	

Функция СтруктураURI(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// строка соединения и путь на сервере
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	
	// информация пользователя и имя сервера
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(Порт <> "", Число(Порт), Неопределено));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции

Функция ДатаВСтроку(мДата) Экспорт
	мДата = СтрЗаменить (мДата, ".", "_");
	мДата = СтрЗаменить (мДата, " ", "_");
	мДата = СтрЗаменить (мДата, ":", "_"); 
	Возврат мДата;
КонецФункции	

Функция ЗаписьВJSONфайл(мТипФайла,мДанные,мДир) Экспорт    
	мРезультат = Истина;
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);  
	ИмяФайла = мДир + "\" +мТипФайла+"_"+ДатаВСтроку(ТекущаяДата())+".json";    
	Попытка 
   		Запись.ОткрытьФайл(ИмяФайла,,, ПараметрыЗаписиJSON); 
   		// Выполнить запись данных (Данные) с помощью объекта записи (Запись).
   		ЗаписатьJSON(Запись, мДанные);
        // Завершить работу с файлом.
   		Запись.Закрыть();  
		мОшибка = "Файл "+ИмяФайла+" успешно создан."
	Исключение          
		мРезультат = Ложь;
		мОшибка = "Не удалось создать файл "+ИмяФайла;
	КонецПопытки;
	Сообщить(мОшибка);
    Возврат мРезультат;
КонецФункции	

Функция ПолучитьИмяФайла(мТипФайла,мДир)    Экспорт
	ИмяФайла = мДир + "\" +мТипФайла+"_"+ДатаВСтроку(ТекущаяДата())+".json";
	Возврат ИмяФайла;
КонецФункции	

Функция СписокСотрудниковПоФизлицу(мОрганизация,мФизлицо)  Экспорт
	// Подбираем только основных сотрудников или внешних совместителей. 
	// Если все хорошо, должен вернуться один сотрудник.
		
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Организация", мОрганизация);
	мЗапрос.УстановитьПараметр("Физлицо", мФизлицо);
	мЗапрос.УстановитьПараметр("Дата", ТекущаяДата());        
	
	мЗапрос.Текст =   
	"ВЫБРАТЬ
	|	ДанныеДляПодбора.Должность.Ссылка КАК ДолжностьСсылка,
	|	ДанныеДляПодбора.Сотрудник.Ссылка КАК СотрудникСсылка,    
	|	ДанныеДляПодбора.ВидЗанятости КАК ВидЗанятости
	|ИЗ
	|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
	|ГДЕ
	|	ДанныеДляПодбора.ФизическоеЛицо.Ссылка = &Физлицо
	|	И ДанныеДляПодбора.Организация.Ссылка = &Организация
	|	И ДанныеДляПодбора.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
	|	И НЕ ДанныеДляПодбора.ПоДоговоруГПХ 
	|   И (ДанныеДляПодбора.ВидЗанятости = Значение(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы) 
	|		ИЛИ ДанныеДляПодбора.ВидЗанятости = Значение(Перечисление.ВидыЗанятости.Совместительство))
	|	И ДанныеДляПодбора.Начало <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДанныеДляПодбора.Начало <= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И (ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДанныеДляПодбора.Окончание >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ))";

    РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
			
	Возврат Выборка;

КонецФункции

Функция ДатаИзСтроки(Стр)
	
	Рез = Неопределено;
	Попытка
		Рез = Дата(Стр);
	Исключение
	КонецПопытки;
	Если ТипЗнч(Рез) = Тип("Дата") Тогда
		Возврат Рез;	
	КонецЕсли;
	МассивДата = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр, "-");
	Если МассивДата.Количество() = 3 Тогда
		Попытка
			Рез = Дата(Число(МассивДата[0]), Число(МассивДата[1]), Число(МассивДата[2]));	
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

Функция ВызватьhМетод(мМетод, мСеанс, hЗапрос, АдресРесурса, ТипВыгрузки, ИнтерактивныйРежим) Экспорт
	мКолво = 120;
	hОтвет = мСеанс.Соединение.ВызватьHTTPМетод(мМетод, hЗапрос);   
	мРезультат = ПроверитьОтвет1(hОтвет,ТипВыгрузки,Истина, ИнтерактивныйРежим);
	мВозврат = Истина;
	Если мРезультат[0] = 1 Тогда   // Это значит, что получен положительный ответ на получение запроса, но обработка еще не завершена.
		// К первичному адресу надо добавить слово /result/ и номер процесса, который есть в ответе на POST запрос
		мАдресРесурса = АдресРесурса + "/result/" + Формат(мРезультат[1],"ЧГ=0");
		Для Счетчик = 1 По мКолво Цикл  
			// У вторичного запроса тела нет.   
			hЗапрос = СоздатьHTTPЗапрос(мАдресРесурса, мСеанс); 
			hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
			hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("GET", hЗапрос);  
			мРезультат = ПроверитьОтвет1(hОтвет,ТипВыгрузки,Ложь, ИнтерактивныйРежим);   // Ложь говорит о том, что это ответ на вторичный запрос
			Если мРезультат[0] = 2 Тогда    // Это значит, что завершение процесса случилось.
				Прервать;	
			ИначеЕсли мРезультат[0] = 0 Тогда	    // Произошла ошибка. Дальше стучаться нет смысла.  
				мВозврат = Ложь;
				Прервать;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	Если Счетчик = мКолво Тогда
		// Завершение случилось по превышению разрешенных циклов. Надо сообщить об ошибке.
		мОшибка = "Ошибка выгрузки. " + ТипВыгрузки + ". Ответ от сервера не получен за отведенное время.";  
		ИмяСобытия = "МояКоманда. Выгрузка сотрудников";
		Если ИнтерактивныйРежим Тогда
			Сообщить(мОшибка);   
		Иначе
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, мОшибка);     
		КонецЕсли;	
		мВозврат = Ложь;
	КонецЕсли;
	Возврат мВозврат;
КонецФункции	

Функция ПроверитьОтвет1(hОтвет, ТипВыгрузки, Первичный, ИнтерактивныйРежим)    // Тут проверка специфических ответов - на запросы при выгрузке списка сотрудников.
	// В ответ на первичный запрос получаем ответ типа:
	// {"data":{
	// 	"status": "success",
	// 	"error": [],
	// 	"result": 141}}
	// Ответ на вторичный запрос, если обработка еще не завершена:
	// {"data": {
	//  "status": "pending",
	//  "percent": 10,
	//  "error": [] }}
	// Или такой, если завершилась:               
	// {"data": {
	//  "status": "success",
	//  "percent": 100,
	//  "error": [] }}
    мВозврат = Новый Массив(2);  // Первый элемент: 1 - получен положительный ответ на первичный (или на вторичный) запрос, но ответа еще нет 
	                             //                 2 - получен положительный ответ на вторичный запрос о том, что процесс завершен нормально
								 //                 0 - случилась какая-то ошибка
	                             // Второй элемент  - ID процесса обработки 
	мВозврат[0] = 0;
	мВозврат[1] = 0;
	// Вариантов ответов может быть несколько. В связи с переходом на псевдо-асинхронный режим
	// работы запросов, кроме ошибки или корректного завершения, может быть ответ о том, что
	// обработка запроса на сервере еще не завершена. И стало быть надо послать еще один запрос.
	// Повторные запросы типа GET, они должны передавать серверу некий ID процесса, который возвращается
	// после первичного запроса.
	
	мОшибка = Неопределено;
	ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
		СтрОтвет = ПрочитатьJSON(ЧтениеJSON);
	Исключение   
		мОшибка = "Ошибка выгрузки. "+ТипВыгрузки+". Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;
	КонецПопытки;                                                                       
	
	Если мОшибка = Неопределено Тогда
		Если ТипЗнч(СтрОтвет) <> Тип("Структура")
			ИЛИ НЕ СтрОтвет.Свойство("data") 
				ИЛИ НЕ СтрОтвет.data.Свойство("status") Тогда
			// Тут какая-то беда. Или структура не получена, или она неправильная  
			мОшибка = "Ошибка выгрузки. "+ТипВыгрузки+". Получен некорректный HTTP ответ: "+ТекстОтвет;
		Иначе
			мСтатус = СтрОтвет.data.status;
			Если мСтатус = "success" Тогда    
				Если Первичный Тогда
					Если СтрОтвет.data.Свойство("result") Тогда
						мВозврат[0] = 1;
						мВозврат[1] = СтрОтвет.data.result;
					Иначе	    // Ошибочная ситуация.
						мОшибка = "Ошибка выгрузки. "+ТипВыгрузки+". В ответе нет свойства 'result'";   // Наверное надо завершать.
					КонецЕсли;
				Иначе	  // Вторичный запрос. Тут успех говорит о том, что процесс завершен.
					мВозврат[0] = 2;         
					мОшибка = "Выгрузка. "+ТипВыгрузки+". Успех";   // Это конечно не ошибка. Но пока пусть будет так.
				КонецЕсли;	
			ИначеЕсли мСтатус = "pending" Тогда  // Такой статус может быть только у ответа на вторичный запрос
				мВозврат[0] = 1;
			ИначеЕсли мСтатус = "failed" Тогда
				// Тут надо разобрать ошибки     
				мОшибка = "Ошибка выгрузки. "+ТипВыгрузки+". " ;  
				Если СтрОтвет.data.Свойство("error") Тогда
					Для Каждого эОшибка Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка + эОшибка + ", ";
					КонецЦикла;	
				Иначе
					мОшибка = мОшибка + "Описание ошибок отсутствует.";
				КонецЕсли;	
			Иначе    
				мОшибка =  "Ошибка выгрузки. "+ТипВыгрузки+". Неизвестный тип статуса ответа: "+мСтатус;
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;	
	Если НЕ мОшибка = Неопределено Тогда
		Если ИнтерактивныйРежим Тогда
			Сообщить(мОшибка);	
		Иначе                                                   
			ИмяСобытия = "МояКоманда. Выгрузка сотрудников";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, мОшибка);     
		КонецЕсли;	
	КонецЕсли;
	Возврат мВозврат;
	
КонецФункции


Функция ПроверитьОтвет(hОтвет, ТипВыгрузки, ИнтерактивныйРежим) Экспорт     
	мРезультат = Ложь;
	мОшибка = Неопределено;
	ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
		СтрОтвет = ПрочитатьJSON(ЧтениеJSON);
	Исключение   
		мОшибка = "Ошибка выгрузки. "+ТипВыгрузки+". Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;
	КонецПопытки;                                                                       
	
	// Тут будем формировать вменяемые сообщения об успехе или о полученных ошибках.	
	// На код состояния оказывается надеяться нельзя. Если до сервера достучались,
	// значит уже будет 200.
	// Но все-таки коды состояния видимо надо тоже обрабатывать, так как если до сервера не добрались, то
	// корректный ответ будет невозможен.                                                                                М
	
	
	// Надо анализировать СтрОтвет. В нем должен быть раздел data, а дальше - status и error
	// Если status - success, значит все прошло успешно. Если failed, значит надо сформировать
	// сообщение об ошибках. Причем их может быть несколько, так как error - массив.
	
	Если мОшибка = Неопределено Тогда
		Если ТипЗнч(СтрОтвет) <> Тип("Структура")
			ИЛИ НЕ СтрОтвет.Свойство("data") 
				ИЛИ НЕ СтрОтвет.data.Свойство("status") Тогда
			// Тут какая-то беда. Или структура не получена, или она неправильная  
			Если СтрОтвет.Свойство("error") Тогда        // Если ошибка произошла во время авторизации, то ответ имеет другую структуру.
				мОшибка =  "Ошибка соединения. " + СтрОтвет.error.error_msg;
			Иначе	
				мОшибка = "Ошибка выгрузки. "+ТипВыгрузки+". Получен некорректный HTTP ответ: "+ТекстОтвет;  
			КонецЕсли;	
		Иначе
			мСтатус = СтрОтвет.data.status;
			Если мСтатус = "success" Тогда    
				мОшибка = "Выгрузка. "+ТипВыгрузки+". Успех";   // Это конечно не ошибка. Но пока пусть будет так.
				мРезультат = Истина;
				// Тут все хорошо
			ИначеЕсли мСтатус = "failed" Тогда
				// Тут надо разобрать ошибки     
				мОшибка = "Ошибка выгрузки. "+ТипВыгрузки+". " ;  
				Если СтрОтвет.data.Свойство("error") Тогда
					Для Каждого эОшибка Из СтрОтвет.data.error Цикл
						мОшибка = мОшибка + эОшибка + ", ";
					КонецЦикла;	
				Иначе
					мОшибка = мОшибка + "Описание ошибок отсутствует.";
				КонецЕсли;	
			Иначе    
				мОшибка =  "Ошибка выгрузки. "+ТипВыгрузки+". Неизвестный тип статуса ответа: "+мСтатус;
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;				
	Если ИнтерактивныйРежим Тогда    
		Если НЕ мРезультат Тогда
			Сообщить(мОшибка);	
		КонецЕсли;	
	Иначе                                                   
		ИмяСобытия = "МояКоманда. Выгрузка сотрудников";
		Если НЕ мРезультат Тогда   // Об успехе не будем писать ошибку в журнал.
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, мОшибка);     
		Иначе
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, мОшибка);     
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат мРезультат;
	
КонецФункции

Функция ПолучитьХешСтроки(Строка)   Экспорт
	
	ХешированиеДанных  = Новый ХешированиеДанных(ХешФункция.CRC32);
	ХешированиеДанных.Добавить(Строка);
	Возврат ХешированиеДанных.ХешСумма;
	
КонецФункции

Функция НайтиДопРеквХэшДанных(ТипСправочника)    Экспорт
	// Здесь нужно найти существующий тип доп.сведения для переданного справочника.
	// Если найдем, возвращаем его, иначе создаем новый.
	УстановитьПривилегированныйРежим(Истина);
	мВозврат = Неопределено;
	ИмяСв = "МК_ВидСведений_" + ТипСправочника;
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Имя", ИмяСв);
	мЗапрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДопСв.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДопСв
	|ГДЕ
	|	ДопСв.Имя = &Имя";
	
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		мВозврат = Выборка.Ссылка;
	Иначе   
		// Еще не был создан такой вид.
		ДопСв = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		ДопСв.ТипЗначения = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30));
		ДопСв.Наименование = "МояКоманда вид сведений";	
		ДопСв.Заголовок = ДопСв.Наименование; 
		ДопСв.Имя = ИмяСв;
		ДопСв.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоРеквизиту("ИмяПредопределенногоНабора", "Справочник_" + ТипСправочника);
		ДопСв.Доступен = Истина;
		ДопСв.МногострочноеПолеВвода = 0;
		ДопСв.ЭтоДополнительноеСведение = Истина;
		ДопСв.Записать();
	
		НаборСвойствОбъект = ДопСв.НаборСвойств.ПолучитьОбъект();
		НоваяСтрока = НаборСвойствОбъект.ДополнительныеСведения.Добавить();
		НоваяСтрока.Свойство = ДопСв.Ссылка;
		НаборСвойствОбъект.Записать();
		мВозврат =  ДопСв.Ссылка;
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции

Функция МК_ТипМаршрута(мТип,мРежим)   Экспорт           
	мВозврат = Неопределено;      
	Если мРежим = 1 Тогда
		Если мТип = Перечисления.МК_МаршрутыПодписания.М1 Тогда
			мВозврат = 	"director_first";
		ИначеЕсли мТип = Перечисления.МК_МаршрутыПодписания.М2 Тогда
			мВозврат = 	"employee_first";  
		ИначеЕсли мТип = Перечисления.МК_МаршрутыПодписания.М3 Тогда
			мВозврат = 	"director_only";	                  
		ИначеЕсли мТип = Перечисления.МК_МаршрутыПодписания.М4 Тогда
			мВозврат = 	"employee_only";	
		КонецЕсли;
	Иначе                                                      
		Если мТип = "director_first" Тогда
			мВозврат = 	Перечисления.МК_МаршрутыПодписания.М1;
		ИначеЕсли мТип = "employee_first" Тогда
			мВозврат = 	Перечисления.МК_МаршрутыПодписания.М2;  
		ИначеЕсли мТип = "director_only" Тогда
			мВозврат = 	Перечисления.МК_МаршрутыПодписания.М3;	                  
		ИначеЕсли мТип = "employee_only" Тогда
			мВозврат = 	Перечисления.МК_МаршрутыПодписания.М4;	
		КонецЕсли;   
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции	
	
&НаСервере
Процедура СинхронизацияСправочниковНаСервере()  Экспорт 
	//СинхСправВидыДокументовМК();   
	Справочники.МК_ВидыДокументовМояКоманда.ОбновитьВидыДокументовМКНаСервере();
	//СинхСправВидыДокументов1С_МК();   
	Справочники.МК_ВидыДокументов.ОбновитьФормы1СНаСервере();	
	СинхСправСотрудникиКЭДО();
КонецПроцедуры

Функция НайтиСотрудника(мID) Экспорт 
	мСсылка = Неопределено;
	Если НЕ (мID = Неопределено) Тогда
		мСсылка = Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(мID));    
		Если СтрНачинаетсяС(Строка(мСсылка),"<Объект не найден>") Тогда
			мСсылка = Неопределено;
		КонецЕсли;	
	КонецЕсли;	
	Возврат мСсылка;	
КонецФункции	

Функция НайтиФЛ(мID) Экспорт
	мФЛСсылка = Неопределено;
	Если НЕ (мID = Неопределено) Тогда
		мФЛСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(мID));    
		Если СтрНачинаетсяС(Строка(мФЛСсылка),"<Объект не найден>") Тогда
			мФЛСсылка = Неопределено;
		КонецЕсли;	
	КонецЕсли;	
	Возврат мФЛСсылка;	
КонецФункции

//Функция СинхСправВидыДокументовМК()  Экспорт
//	// Первый справочник - копия из МояКоманда
//	мСеанс = СоздатьСеансСвязи(Истина); 
//	мСправ = Новый Массив;
//	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
//	Иначе         
//		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 		
//		//hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/document-types-list", мСеанс);    
//		hЗапрос = СоздатьHTTPЗапрос("/api/1c-exchange/edms/document-types-list", мСеанс);    
//		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
//		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("GET", hЗапрос);  
//		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
//		Попытка
//			ЧтениеJSON = Новый ЧтениеJSON;
//			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
//			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
//			Если ТипЗнч(СтрОтвет) <> Тип("Структура")ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
//				// Тут какая-то беда. Или структура не получена, или она неправильная  
//			Иначе     
//				мСправ = СтрОтвет.Data.Items;	
//			КонецЕсли;	
//		Исключение   
//			мОшибка = "Ошибка получения справочника. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;
//		КонецПопытки;       
//		Если мСправ.Количество() >0 Тогда   
//			мРезультат = Справочники.МК_ВидыДокументовМояКоманда.ЗаполнитьСправочник(мСправ);
//		КонецЕсли;	
//	КонецЕсли;	
//КонецФункции	

//Функция СинхСправВидыДокументов1С_МК()  Экспорт             
	// Теперь второй справочник - Стыковка документов 1С и МояКоманда
//	мСеанс = СоздатьСеансСвязи(Истина); 
//	мСправ = Новый Массив;
//	Если мСеанс = Неопределено Тогда
//		// Ошибка авторизации. Ничего не делаем.
//	Иначе         
//    	мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 		
//		hЗапрос = СоздатьHTTPЗапрос("/api/1c-exchange/edms/document-types-1c-list", мСеанс); 
//		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
//		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("GET", hЗапрос);  
//		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
//		Попытка
//			ЧтениеJSON = Новый ЧтениеJSON;
//			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
//			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
//			Если ТипЗнч(СтрОтвет) <> Тип("Структура")ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
//				// Тут какая-то беда. Или структура не получена, или она неправильная  
//			Иначе     
//				мСправ = СтрОтвет.Data.Items;	
//			КонецЕсли;	
//		Исключение   
//			мОшибка = "Ошибка получения справочника. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;
//		КонецПопытки;       
//		Если мСправ.Количество() >0 Тогда   
//			мРезультат = Справочники.МК_ВидыДокументов.ЗаполнитьСправочник(мСправ);
//		КонецЕсли;		
//	КонецЕсли;	
//КонецФункции	  

&НаСервере
Функция СинхСправСотрудникиКЭДО()       Экспорт
	// Нужно отправить запрос в МК без параметров. Вернется список физических лиц,
	// которые дали согласие на работу с КЭДО.
	мКолво = 0;
	//ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = СоздатьСеансСвязи(Истина); 
	мСправ = Новый Массив;
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 		
		hЗапрос = СоздатьHTTPЗапрос("/api/1c-exchange/edms/users-consents", мСеанс);    
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура")ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе     
				мСправ = СтрОтвет.Data.Items;	
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения справочника. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  
			Сообщить(мОшибка);
		КонецПопытки;       
		Если мСправ.Количество() >0 Тогда   
			мКолво = Справочники.МК_СотрудникиКЭДО.ЗаполнитьСправочник(мСправ);
		КонецЕсли;					
	КонецЕсли;	
	Возврат мКолво
КонецФункции
