
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	мСпис = Параметры.СписокДелегатов;  
	мТаб = ЭтаФорма.Список;
	Для Каждого мПодписант Из мСпис Цикл
		мСтр = мТаб.Добавить(); 
		мСтр.Имя = мПодписант.name;
		мСтр.Номер = мПодписант.id;		
	КонецЦикла;	
	ЭтаФорма.НомерУчастника = Параметры.НомерУчастника;
КонецПроцедуры 

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	мВозврат = Новый Структура("НомерУчастника, НомерДелегата", ЭтаФорма.НомерУчастника, Элемент.ТекущиеДанные.Номер);
	ЭтаФорма.Закрыть(мВозврат);
КонецПроцедуры




