&НаСервере
Функция ЗавершениеВыбораНаСервере()   
	мТаб = ЭтаФорма.ВыборВидовЗанятости;
	мСписВыб = Новый СписокЗначений;
	Для Каждого мСтрока ИЗ мТаб Цикл
		Если мСтрока.Выбор Тогда
			мСписВыб.Добавить(мСтрока.ВидЗанятости);
		КонецЕсли;	
	КонецЦикла;		
	Возврат мСписВыб;	
КонецФункции   

&НаКлиенте
Процедура ОК(Команда)
	мСписВыб = ЗавершениеВыбораНаСервере();   
	ЭтаФорма.Закрыть(мСписВыб);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Получим список ранее выбранных должностей	
	мСписВыб = Параметры.СписокВыбранных;
	// Теперь - список всех.
	мСписВЗ = Новый СписокЗначений;
	мСписВЗ.Добавить("Основное место работы");
	мСписВЗ.Добавить("ВнешнееСовместительство");
	мСписВЗ.Добавить("ВнутреннееСовместительство");
	мСписВЗ.Добавить("ГПХ");
	мСписВЗ.Добавить("Не определено");        
	
	мТаб = ЭтаФорма.ВыборВидовЗанятости;
	Для Каждого мЭлемент ИЗ мСписВЗ Цикл
		стрТаб = мТаб.Добавить();
		стрТаб.ВидЗанятости = мЭлемент.Значение;
		Если мСписВыб.НайтиПоЗначению(мЭлемент.Значение) = Неопределено Тогда
			стрТаб.Выбор = Ложь;
		Иначе
			стрТаб.Выбор = Истина; 
		КонецЕсли;	
	КонецЦикла;         
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)   
	ЭтаФорма.Закрыть();
КонецПроцедуры
