
&НаСервере
Функция ПолучитьДанныеИзМКНаСервере()
	// Нужно отправить запрос в МК без параметров. Вернется список физических лиц,
	// которые дали согласие на работу с КЭДО.
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мКолво = ОО.СинхСправСотрудникиКЭДО();	
	Возврат мКолво;
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеИзМК(Команда)	
	мКолво = ПолучитьДанныеИзМКНаСервере();
	Элементы.Список.Обновить();
	Если мКолво = 0 Тогда
		мСообщение = "Новых записей не появилось";
	Иначе	                                     
		мСообщение = "Добавлено сотрудников: " + мКолво;
	КонецЕсли;	                                           
	ПоказатьПредупреждение(, мСообщение);   
КонецПроцедуры
