
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Предопределенный Тогда		
		Если Не (Объект.Объект1С = Объект.Наименование) Тогда
			Объект.Объект1С = Объект.Наименование;
		КонецЕсли;
		Элементы.Объект1С.ТолькоПросмотр = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
	Иначе                                                  
		ВыборТипа = ЛОЖЬ;   
		//Определяем тип по умолчанию
		Элементы.Объект1С.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыОтпусков");
	КонецЕсли;	
	
КонецПроцедуры

