
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Пользователи.ТекущийПользователь();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)               
	ПолучитьЗаявкиИзМКНаСервере();   
	Элементы.Список.Обновить();	
КонецПроцедуры


&НаСервере
Процедура ПолучитьЗаявкиИзМКНаСервере()   
	мСписДок = Справочники.МК_ЗаявкиНаОтсутствие.ПолучитьИОбработатьЗаявкиИзМК();
КонецПроцедуры
