

&НаСервере
Процедура ОКНаСервере(мПарам)
	Константы.МК_МаксКолвоСотрВВыгрузке.Установить(ЭтаФорма.МаксКолвоСотр);   
	//Если ЭтаФорма.НеРаботаемСКЭДО Тогда    	
	//	Константы.МК_РаботаемСКЭДО.Установить(Ложь);	
	//	Константы.МК_НеРаботаемСКЭДО.Установить(Истина);
	//Иначе                                               
	//	Константы.МК_РаботаемСКЭДО.Установить(ЭтаФорма.РаботаемСКЭДО);	
	//	Константы.МК_НеРаботаемСКЭДО.Установить(Ложь);		
	//КонецЕсли;	                                        
	Константы.МК_РаботаемСКЭДО.Установить(ЭтаФорма.РаботаемСКЭДО);
	Константы.МК_НеРаботаемСКЭДО.Установить(ЭтаФорма.НеРаботаемСКЭДО);
	Константы.МК_ОтключитьКЭДО.Установить(ЭтаФорма.ОтключитьКЭДО);
	Константы.МК_ВыгружатьГПХ.Установить(ЭтаФорма.ВыгружатьГПХ);
	Константы.МК_ПрименятьПользовательскиеПоля.Установить(ЭтаФорма.ПрименятьПользовательскиеПоля);
	Константы.МК_ВыгружатьПлановыеНачисления.Установить(ЭтаФорма.ВыгружатьПлановыеНачисления); 
	Константы.МК_ИспользоватьРуководителейПодразделений.Установить(ЭтаФорма.ИспользуютсяРуководителиПодразделений);   
	Константы.МК_ВыгружатьОргСтруктуру.Установить(мПарам.ВыгружатьОргСтруктуру);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	мПарам = Новый Структура("ВыгружатьОргСтруктуру");
	Если ЭтаФорма.ВыгрузкаПодразделений = 0 Тогда
		мОргСтр = Ложь;
	Иначе	           
		мОргСтр = Истина;
	КонецЕсли;
	мПарам.ВыгружатьОргСтруктуру = мОргСтр;
	ОКНаСервере(мПарам);  
	ЭтаФорма.Закрыть(мПарам);
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.МаксКолвоСотр = Константы.МК_МаксКолвоСотрВВыгрузке.Получить(); 
	Если ЭтаФорма.МаксКолвоСотр = 0 Тогда
		ЭтаФорма.МаксКолвоСотр = 1000;
	КонецЕсли;	
	ЭтаФорма.РаботаемСКЭДО = Константы.МК_РаботаемСКЭДО.Получить();
	ЭтаФорма.НеРаботаемСКЭДО = Константы.МК_НеРаботаемСКЭДО.Получить();
	ЭтаФорма.ОтключитьКЭДО = Константы.МК_ОтключитьКЭДО.Получить();
	ЭтаФорма.ВыгружатьГПХ = Константы.МК_ВыгружатьГПХ.Получить();   
	ЭтаФорма.ПрименятьПользовательскиеПоля = Константы.МК_ПрименятьПользовательскиеПоля.Получить();
	ЭтаФорма.ВыгружатьПлановыеНачисления = Константы.МК_ВыгружатьПлановыеНачисления.Получить();
	ЭтаФорма.ИспользуютсяРуководителиПодразделений = Константы.МК_ИспользоватьРуководителейПодразделений.Получить();   
	мОргСтр = Константы.МК_ВыгружатьОргСтруктуру.Получить();
	Если мОргСтр Тогда
		ЭтаФорма.ВыгрузкаПодразделений = 1;
	Иначе	                               
		ЭтаФорма.ВыгрузкаПодразделений = 0;
	КонецЕсли;		
КонецПроцедуры   


	

&НаСервере
Процедура СинхронизацияСправочниковНаСервере()  
	Справочники.МК_ВидыДокументовМояКоманда.ОбновитьВидыДокументовМКНаСервере();
	Справочники.МК_ВидыДокументов.ОбновитьФормы1СНаСервере() 
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияСправочников(Команда)
	СинхронизацияСправочниковНаСервере();
КонецПроцедуры

//&НаСервере
//Процедура ОчиститьСправочникиНаСервере()
//	мСправ = Справочники.МК_ВидыДокументовМояКоманда.Выбрать();
//	Пока мСправ.Следующий() Цикл
//        мОбъект = мСправ.ПолучитьОбъект();
//        мОбъект.Удалить()
//	КонецЦикла;      
//	мСправ = Справочники.МК_ВидыДокументов.Выбрать();
//	Пока мСправ.Следующий() Цикл
//        мОбъект = мСправ.ПолучитьОбъект();
//        мОбъект.Удалить()
//	КонецЦикла;

//КонецПроцедуры

//&НаКлиенте
//Процедура ОчиститьСправочники(Команда)
//	ОчиститьСправочникиНаСервере();
//КонецПроцедуры

//&НаКлиенте
//Процедура ОчиститьДокументыКэдо(Команда)
//	ОчиститьДокументыКэдоСервер();	
//КонецПроцедуры    

//&НаСервере
//Процедура ОчиститьДокументыКЭДОСервер()
//	мСправ = Справочники.МК_ДокументыКЭДО.Выбрать();
//	Пока мСправ.Следующий() Цикл
//        мОбъект = мСправ.ПолучитьОбъект();
//        мОбъект.Удалить()
//	КонецЦикла;     
//КонецПроцедуры

&НаСервере
Процедура ПодготовкаКУдалениюРасширенияНаСервере()    
	
	НабЗап = РегистрыСведений.ФайлыВРабочемКаталоге.СоздатьНаборЗаписей(); 	
	НабЗап.Записать();

	мВыборка = Справочники.МК_ДокументыКЭДОПрисоединенныеФайлы.Выбрать();        
    Пока мВыборка.Следующий() Цикл
        мОбъект = мВыборка.ПолучитьОбъект();     
		мОбъект.УстановитьПометкуУдаления(Истина, Истина);
        //мОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);        
    КонецЦикла; 	
КонецПроцедуры


&НаКлиенте
Процедура ПодготовкаКУдалениюРасширения(Команда)
	 Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "После выполнения этого действия данные восстановить не удастся. Вы действительно хотите выполнить подготовку к удалению расширения?",
        РежимДиалогаВопрос.ДаНетОтмена,
        0, // таймаут в секундах
        КодВозвратаДиалога.Нет,"Подготовка к удалению расширения"); 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        ПодготовкаКУдалениюРасширенияНаСервере();  
		ПоказатьПредупреждение(, "Помечены на удаление присоединенные файлы КЭДО МояКоманда. Теперь нужно выполнить удаление помеченных объектов и отключить расширение, перезапустить программу и затем удалить расширение.");   
    КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьКЭДОПриИзменении(Элемент)
	Если ЭтаФорма.ОтключитьКЭДО Тогда 
		ЭтаФорма.РаботаемСКЭДО = Ложь;
		ЭтаФорма.НеРаботаемСКЭДО = Ложь;
	Иначе
		ЭтаФорма.НеРаботаемСКЭДО = Истина;
		ЭтаФорма.РаботаемСКЭДО = Ложь;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРегистрДокументыКЭДО(Команда)
	ЗаполнитьРегистрДокументыКЭДОНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегистрДокументыКЭДОНаСервере()   // Заполняются два регистра           
	Справочники.МК_ДокументыКЭДО.СоздатьЗаписиРегистраДокКЭДО();
	Справочники.МК_СотрудникиКЭДО.СоздатьЗаписиРегистраСотрКЭДО();       
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаПодразделенийПриИзменении(Элемент) 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЭтаФорма.ВладелецФормы.ИспользуетсяОргСтруктура Тогда
		ЭтаФорма.Элементы.ВыгрузкаПодразделений.Видимость = Ложь
	КонецЕсли;	
КонецПроцедуры
