
&НаСервере
Функция ВыполнитьПодключениеНаСервере()
	// Нужно отправить специальный запрос в МояКоманда.  
	// GET /api/1c-exchange/edms/check  
	// Если ответ success, значит можно подключиться. Иначе - нельзя
	// {
    // "data": {
    //     "status": "success",
    //     "error": []
    // }
	// }
	// Ниже - ответ, когда нельзя.
    // {
    // "data": {
    //     "status": "failed",
    //     "error": [
    //        "Модуль КЭДО отключен."
    //     ]
    // }
	//}    
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	ИнтерактивныйРежим=Истина;
	мСеанс = ОО.СоздатьСеансСвязи(ИнтерактивныйРежим);   
	мОтвет = Ложь;
    Если мСеанс = Неопределено Тогда
 		// Ошибка авторизации. Ничего не отправляем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен).
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/check", мСеанс);     		
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("GET", hЗапрос); 
		мОтвет = ОО.ПроверитьОтвет(hОтвет,"Справочники",ИнтерактивныйРежим);   
		Если мОтвет Тогда
			// Получено разрешение на подключение к КЭДО
			Константы.МК_РаботаемСКЭДО.Установить(Истина);	
			Константы.МК_НеРаботаемСКЭДО.Установить(Ложь);    
			// Нужно выполнить первичную синхронизацию справочников
			ОО.СинхронизацияСправочниковНаСервере();
		КонецЕсли;	
	КонецЕсли;	 	
	Возврат мОтвет;
КонецФункции

&НаКлиенте
Процедура ВыполнитьПодключение(Команда)
	мРезультат = ВыполнитьПодключениеНаСервере();   
	Если мРезультат Тогда
		// Получено разрешение на подключение к КЭДО    
		ПоказатьПредупреждение(, "Разрешение на подключение к КЭДО получено. Можно начинать работу.");   
		//Сообщить("Разрешение на подключение к КЭДО получено. Можно начинать работу.");
		ОбновитьИнтерфейс();
	Иначе                                           
		ПоказатьПредупреждение(, "Функции КЭДО в МоейКоманде не активированы, для работы должен быть включен модуль ""Кадровый документооборот"" в настройках МоейКоманды. Для получения помощи обратитесь в поддержку.");   
		//Сообщить("Разрешение на подключение к КЭДО не получено");   		
	КонецЕсли;	
КонецПроцедуры
