
&НаСервере
Функция ОбновитьШаблоныМКНаСервере()
	// Это - в модуле менеджера. Понадобится и в регламентной операции
	мКолво = Справочники.МК_НастройкиСвязиЗаявленийКЭДО.ПолучитьИОбработатьШаблоныИзМК();     
	Возврат мКолво;
КонецФункции

&НаКлиенте
Процедура ОбновитьШаблоныМК(Команда)
	мКолво = ОбновитьШаблоныМКНаСервере(); 
	Элементы.Список.Обновить();  
	Сообщить("Добавлено элементов: "+мКолво);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)  
	//Если ОбменДанными.Загрузка Тогда
    //	Возврат;
	//КонецЕсли;  
	//Отказ = Истина;
КонецПроцедуры

//&НаСервере
//Процедура ОчиститьНаСервере()
//	мСправ = Справочники.МК_НастройкиСвязиЗаявленийКЭДО.Выбрать();
//	Пока мСправ.Следующий() Цикл
//        мОбъект = мСправ.ПолучитьОбъект();
//        мОбъект.Удалить()
//	КонецЦикла;  	
//КонецПроцедуры

//&НаКлиенте
//Процедура Очистить(Команда)
//	ОчиститьНаСервере();
//КонецПроцедуры

&НаСервере
Процедура ПоказыватьПомеченныеНаУдалениеПриИзмененииНаСервере()
	мПоказ = ЭтаФорма.ПоказыватьПомеченныеНаУдаление;	
	Список.Отбор.Элементы.Очистить();
	Если НЕ мПоказ Тогда       	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = Ложь; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПомеченныеНаУдалениеПриИзменении(Элемент) 	
	ПоказыватьПомеченныеНаУдалениеПриИзмененииНаСервере();  
	Элементы.Список.Обновить(); 
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    //ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    ЭлементОтбора.ПравоеЗначение = Ложь; // Истина;
КонецПроцедуры


