
&После("УстановкаПараметровСеанса")
Процедура МК_УстановкаПараметровСеанса(ИменаПараметровСеанса)
	УстановленныеПараметры = Новый Массив;   
	Если ИменаПараметровСеанса <> Неопределено Тогда
		Для Каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
	   		УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
	конецЕсли;	
КонецПроцедуры

Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)  Экспорт
 
 // Если в данном вызове УстановкаПараметровСеанса параметр ИмяПараметра уже
 // был установлен - возврат.
 Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
 	Возврат;
 КонецЕсли;
 
 Если ИмяПараметра = "МК_ПарольЭЦП" Тогда
 	ПараметрыСеанса.МК_ПарольЭЦП = "НеЗадан"; 	
 	УстановленныеПараметры.Добавить("МК_ПарольЭЦП");
 КонецЕсли;

КонецПроцедуры