
&НаСервере
Функция ЗавершениеВыбораНаСервере()   
	мТаб = ЭтаФорма.ВыборОрганизаций;
	мСписВыб = Новый СписокЗначений;
	Для Каждого мСтрока ИЗ мТаб Цикл
		Если мСтрока.Выбор Тогда
			мСписВыб.Добавить(мСтрока.Организация);
		КонецЕсли;	
	КонецЦикла;	
	//Константы.МК_СписокОрганизаций.Установить(Новый ХранилищеЗначения(мСписВыб));
	Возврат мСписВыб;	
КонецФункции

&НаКлиенте
Процедура ЗавершениеВыбора(Команда)
	мСписВыб = ЗавершениеВыбораНаСервере();   
	ЭтаФорма.Закрыть(мСписВыб);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Получим список ранее выбранных организаций
	// мСписВыб = Константы.МК_СписокОрганизаций.Получить().Получить();
	мСписВыб = Параметры.СписокВыбранных;
	// Теперь - список всех.
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления";
		
		СписокОрганизаций = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();   
	мТаб = ЭтаФорма.ВыборОрганизаций;	
	Пока Выборка.Следующий() Цикл
		стрТаб = мТаб.Добавить();
		стрТаб.Организация = Выборка.Ссылка;
		Если мСписВыб.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
			стрТаб.Выбор = Ложь;
		Иначе
			стрТаб.Выбор = Истина; 
		КонецЕсли;	
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ОтменаВыбора(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
