
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Тут надо проверить заполненность справочника выгружаемых объектов.
	ПроверитьСправочникВО();  
	ЭтаФорма.ДокументФЛ1 = Константы.МК_ДокументФЛ1.Получить();
	ЭтаФорма.ДокументФЛ2 = Константы.МК_ДокументФЛ2.Получить();
	ЭтаФорма.ДокументФЛ3 = Константы.МК_ДокументФЛ3.Получить();
КонецПроцедуры

Процедура ПроверитьСправочникВО()
	мВО = Новый Массив;                                                                     
	мВО.Добавить(Новый Структура("Наименование, Метод", "Валюта", "мВалюта"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "СНИЛС", "мСНИЛС"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "ИНН", "мИНН"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Адрес по прописке", "мАдресПоПрописке"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Адрес проживания", "мАдресПроживания"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Адрес за пределами", "мАдресЗаПределами"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Должность", "мДолжность"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Подразделение", "мПодразделение"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "КоличествоСтавок", "мКоличествоСтавок"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "ВидЗанятости", "мВидЗанятости"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ1.ВидДокумента", "мДокумент1ВидДокумента"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ1.Серия", "мДокумент1Серия"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ1.Номер", "мДокумент1Номер"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ1.СерияНомер", "мДокумент1СерияНомер"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ1.ДатаВыдачи", "мДокумент1ДатаВыдачи"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ1.КемВыдан", "мДокумент1КемВыдан"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ1.КодПодразделения", "мДокумент1КодПодразделения")); 
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ1.СрокДействия", "мДокумент1СрокДействия"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ1.СтранаВыдачи", "мДокумент1СтранаВыдачи"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ2.ВидДокумента", "мДокумент2ВидДокумента"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ2.Серия", "мДокумент2Серия"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ2.Номер", "мДокумент2Номер"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ2.СерияНомер", "мДокумент2СерияНомер"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ2.ДатаВыдачи", "мДокумент2ДатаВыдачи"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ2.КемВыдан", "мДокумент2КемВыдан"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ2.КодПодразделения", "мДокумент2КодПодразделения")); 
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ2.СрокДействия", "мДокумент2СрокДействия"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ2.СтранаВыдачи", "мДокумент2СтранаВыдачи"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ3.ВидДокумента", "мДокумент3ВидДокумента"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ3.Серия", "мДокумент3Серия"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ3.Номер", "мДокумент3Номер"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ3.СерияНомер", "мДокумент3СерияНомер"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ3.ДатаВыдачи", "мДокумент3ДатаВыдачи"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ3.КемВыдан", "мДокумент3КемВыдан"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ3.КодПодразделения", "мДокумент3КодПодразделения")); 
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ3.СрокДействия", "мДокумент3СрокДействия"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Документ3.СтранаВыдачи", "мДокумент3СтранаВыдачи"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "ВидДоговора", "мВидДоговора"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Договор.Номер", "мДоговорНомер"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Договор.Дата", "мДоговорДата"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Гражданство.Страна", "мГражданствоСтрана"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "Гражданство.ИНН", "мГражданствоИНН"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "АдресПоПрописке.Регион", "мАдресПоПропискеРегион"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "АдресПроживания.Регион", "мАдресПроживанияРегион"));
	мВО.Добавить(Новый Структура("Наименование, Метод", "КодФизическогоЛица", "мКодФизЛица"));
	
	Для Каждого мЭлемент Из мВО Цикл
		мИзменение = Ложь;
		мНаим = мЭлемент.Наименование;
		мСсылка = Справочники.МК_ВыгружаемыеОбъекты.НайтиПоНаименованию(мНаим);     
		Если Не мСсылка.Пустая() Тогда   
			мОбъект = мСсылка.ПолучитьОбъект();
			Если мОбъект.Метод <> мЭлемент.Метод Тогда
				мОбъект.Метод = мЭлемент.Метод;
                мИзменение = Истина;
			КонецЕсли;
		Иначе     
			мОбъект = Справочники.МК_ВыгружаемыеОбъекты.СоздатьЭлемент();
			мОбъект.Наименование = мЭлемент.Наименование;
			мОбъект.Метод = мЭлемент.Метод;
			мИзменение = Истина;
		КонецЕсли;
		Если мИзменение Тогда
			мОбъект.Записать();
		КонецЕсли;			
	КонецЦикла;	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ДокументФЛ1ПриИзмененииНаСервере(мДок)
	Константы.МК_ДокументФЛ1.Установить(мДок);
КонецПроцедуры

&НаКлиенте
Процедура ДокументФЛ1ПриИзменении(Элемент)
	ДокументФЛ1ПриИзмененииНаСервере(ЭтаФорма.ДокументФЛ1);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДокументФЛ2ПриИзмененииНаСервере(мДок)
	Константы.МК_ДокументФЛ2.Установить(мДок);
КонецПроцедуры

&НаКлиенте
Процедура ДокументФЛ2ПриИзменении(Элемент)
	ДокументФЛ2ПриИзмененииНаСервере(ЭтаФорма.ДокументФЛ2);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДокументФЛ3ПриИзмененииНаСервере(мДок)
	Константы.МК_ДокументФЛ3.Установить(мДок);
КонецПроцедуры

&НаКлиенте
Процедура ДокументФЛ3ПриИзменении(Элемент)
	ДокументФЛ3ПриИзмененииНаСервере(ЭтаФорма.ДокументФЛ3);
КонецПроцедуры
