
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	мПараметры = Новый Структура("", );
	//ОткрытьФорму("Обработка.МК_НастройкаРегламентныхЗаданий.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	// РегламентныеЗаданияКлиент.ПерейтиКНастройкеРегламентныхЗаданий();
	ОткрытьФорму("Обработка.МК_НастройкаРегламентныхЗаданий.Форма.МК_НастройкаРегЗаданий",мПараметры,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
