
&НаСервере
Процедура МК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)  
	мПраво = ПравоДоступа("Просмотр", Метаданные.Справочники.МК_ДокументыКЭДО); 
	Если мПраво Тогда
		МК_КЭДО = Константы.МК_РаботаемСКЭДО.Получить();
		Если МК_КЭДО Тогда  	                
			Схема = Новый СхемаЗапроса(); 
			МК_ОбщийМодуль1.ДобавитьКолонкиВСписок(ЭтаФорма, Схема);
		КонецЕсли;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура МК_ОбновитьСтатусы(Команда)     
	// Надо сделать следующее:
	// 1. Получить статусы документов 
	// 2. Получить согласия на КЭДО
	// Это делаем с сервера
	МК_ОбщийМодуль1.МК_ОбновитьСтатусыНаСервере();  
	ЭтаФорма.Элементы.Список.Обновить(); 
КонецПроцедуры	


&НаКлиенте
Процедура МК_ПриИзмененииЗначения() 
	ЭтаФорма.МК_ОтборИспользование = Истина;
	МК_ОбщийМодуль2.МК_ПриИзмененииИспользования(ЭтаФорма);
КонецПроцедуры	
