
&НаКлиенте
Процедура ПолучитьЗаявкиИзМК(Команда)
	ПолучитьЗаявкиИзМКНаСервере();  
	Элементы.Список.Обновить();
КонецПроцедуры


&НаСервере
Процедура ПолучитьЗаявкиИзМКНаСервере()   
	мСписДок = Справочники.МК_ЗаявкиНаОтсутствие.ПолучитьИОбработатьЗаявкиИзМК();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадания(Команда)   
	СоздатьЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаданияНаСервере()
	мСписок = Новый Массив;
	Выборка = Справочники.МК_ЗаявкиНаОтсутствие.Выбрать();
	Пока Выборка.Следующий() Цикл
        Если Выборка.СтатусЗаявки = Перечисления.МК_СтатусыЗаявокНаОтсутствия.Необработана Тогда
	    	мСписок.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;	
	Если мСписок.Количество() > 0 Тогда      
		Справочники.МК_ЗаявкиНаОтсутствие.ОтразитьВРегистре(мСписок);		
	КонецЕсли;		
КонецПроцедуры	


