 &НаСервере
 Процедура ОпределитьФреш() Экспорт     
	 Если ПравоДоступа("Редактирование", Метаданные.Константы.МК_НеФреш) Тогда
		мНеФреш = Ложь;                
		мКНеФреш = Константы.МК_НеФреш.Получить();
		Если Метаданные.РегламентныеЗадания.Найти("МК_ФоноваяВыгрузкаСотрудниковПолная") <> Неопределено Тогда     
			мНеФреш = Истина;		
		КонецЕсли;	 
		Если НЕ (мНеФреш = мКНеФреш) Тогда
			Константы.МК_НеФреш.Установить(мНеФреш); 
		КонецЕсли;                                             
		// Теперь разобраться с КЭДО. При первоначальном запуске все константы - Ложь.
		// Если это так, то НеРаботаем КЭДО устанавливаем в Истину. Это делает доступным меню КЭДО
		// с одним пунктом "Присоединиться к КЭДО". 
		мРаботаемСКЭДО = Константы.МК_РаботаемСКЭДО.Получить();
		мНеРаботаемСКЭДО = Константы.МК_НеРаботаемСКЭДО.Получить();
		мОтключитьКЭДО = Константы.МК_ОтключитьКЭДО.Получить();	
		Если мРаботаемСКЭДО = Ложь И мНеРаботаемСКЭДО = Ложь И мОтключитьКЭДО = Ложь Тогда
			Константы.МК_НеРаботаемСКЭДО.Установить(Истина); 
			//Константы.МК_ОтключитьКЭДО.Установить(Истина); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере   
Процедура ДобавитьКолонкиВСписок(Форма, Схема, мСписочный = Ложь)    Экспорт
	Схема.РежимКомпоновкиДанных = Истина;
   	Схема.УстановитьТекстЗапроса(Форма.Список.ТекстЗапроса);
   	Пакет = Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество() - 1];
   	Оператор = Пакет.Операторы[0];
	
	Оператор.Источники.Добавить("РегистрСведений.МК_СотрудникиКЭДО", "МК_СотрудникиКЭДО");
   	ИсточникЖурналКадровыхДокументов = Оператор.Источники[0];  
	ПсевдонимИсточникаЖКД = ИсточникЖурналКадровыхДокументов.Источник.Псевдоним;
	
	Если Не мСписочный Тогда
		ИсточникЖурналКадровыхДокументов.Соединения.Добавить(
   		    "МК_СотрудникиКЭДО", 
			ПсевдонимИсточникаЖКД+".Сотрудник = МК_СотрудникиКЭДО.СотрудникССылка");  // И МК_СотрудникиКЭДО.ПометкаУдаления = Ложь");	 		
   		НовСоединение = ИсточникЖурналКадровыхДокументов.Соединения.НайтиПоПсевдониму("МК_СотрудникиКЭДО");
   		НовСоединение.ОбязательноеСоединение = Истина;
   		НовСоединение.ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
   	    
   		Оператор.ВыбираемыеПоля.Добавить("ВЫБОР КОГДА ТипЗначения(" + ПсевдонимИсточникаЖКД+".Сотрудник)= Тип(Строка) ТОГДА 2 КОГДА МК_СотрудникиКЭДО.ЕстьСогласие ТОГДА 0 ИНАЧЕ 1 КОНЕЦ");                      
	
		Пакет.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = "КЭДО_МК";
   
   		Форма.Список.ТекстЗапроса = Схема.ПолучитьТекстЗапроса();        
		
	
		МК_Статус =	Форма.Элементы.Добавить("КЭДО_МК", Тип("ПолеФормы"), Форма.Элементы.Список);   		
		МК_Статус.Вид = ВидПоляФормы.ПолеКартинки;	
		МК_Статус.КартинкаЗначений = БиблиотекаКартинок.МК_КоллекцияЕстьСогласие; 
		МК_Статус.КартинкаШапки = БиблиотекаКартинок.МК_ШапкаКЭДО;   
		МК_Статус.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет; 
		МК_Статус.Ширина = 4;
    	МК_Статус.ПутьКДанным = "Список.КЭДО_МК"; 
		МК_Статус.Подсказка = "Есть согласие на КЭДО МояКоманда";   
	Иначе
		// Пробуем добавить невидимую колонку МК_Сотрудник  
		//Оператор.ВыбираемыеПоля.Добавить(ПсевдонимИсточникаЖКД+".Сотрудники[0]");                      
	
		//Пакет.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = "МК_Сотрудник";             
		
		//МК_Статус =	Форма.Элементы.Добавить("МК_Сотрудник", Тип("ПолеФормы"), Форма.Элементы.Список);   		
		//МК_Статус.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто; 		
    	//МК_Статус.ПутьКДанным = "МК_Сотрудник"; 
		//МК_Статус.Подсказка = "Есть согласие на КЭДО МояКоманда";   
    КонецЕсли;		
	Оператор.Источники.Добавить("РегистрСведений.МК_СостояниеДокументовКЭДО", "МК_ДокументыКЭДО");
    ИсточникЖурналКадровыхДокументов = Оператор.Источники[0];  
	ПсевдонимИсточникаЖКД = ИсточникЖурналКадровыхДокументов.Источник.Псевдоним;
    ИсточникЖурналКадровыхДокументов.Соединения.Добавить(
        "МК_ДокументыКЭДО", 
		ПсевдонимИсточникаЖКД + ".Ссылка = МК_ДокументыКЭДО.СсылкаНаДокумент");	         
    НовСоединение = ИсточникЖурналКадровыхДокументов.Соединения.НайтиПоПсевдониму("МК_ДокументыКЭДО");
    НовСоединение.ОбязательноеСоединение = Истина;
    НовСоединение.ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
    	    
    Оператор.ВыбираемыеПоля.Добавить("МК_ДокументыКЭДО.КодСтатуса1");  
	Пакет.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = "КодСтатуса1";
	
	Оператор.ВыбираемыеПоля.Добавить("МК_ДокументыКЭДО.КодСтатуса2");  
	Пакет.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = "КодСтатуса2";
    
    Форма.Список.ТекстЗапроса = Схема.ПолучитьТекстЗапроса();        
		
	МК_Статус =	Форма.Элементы.Добавить("МК_Статус1", Тип("ПолеФормы"), Форма.Элементы.Список);
	МК_Статус.Вид = ВидПоляФормы.ПолеКартинки;							
	МК_Статус.КартинкаЗначений = БиблиотекаКартинок.МК_КоллекцияСостоянийКЭДО; 
	МК_Статус.КартинкаШапки = БиблиотекаКартинок.МК_ОбщаяКартинка3;
	МК_Статус.ПутьКДанным = "Список.КодСтатуса2";    
	МК_Статус.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;   
	МК_Статус.Подсказка = "Статус приказа в КЭДО МояКоманда";    
		
	МК_Статус =	Форма.Элементы.Добавить("МК_Статус2", Тип("ПолеФормы"), Форма.Элементы.Список);    
	МК_Статус.Вид = ВидПоляФормы.ПолеКартинки;							
	МК_Статус.КартинкаЗначений = БиблиотекаКартинок.МК_КоллекцияСостоянийКЭДО; 
	МК_Статус.КартинкаШапки = БиблиотекаКартинок.МК_ОбщаяКартинка4;
    МК_Статус.ПутьКДанным = "Список.КодСтатуса1";
	МК_Статус.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;     
	МК_Статус.Подсказка = "Статус договора в КЭДО МояКоманда";      
		
	Команда = Форма.Команды.Добавить("МК_ОбновитьСтатусыКЭДО"); //Имя команды
	Команда.Заголовок = "Обновить статусы КЭДО";
	Команда.Действие  = "МК_ОбновитьСтатусы"; 
	Попытка
		мЗаписать = Форма.Элементы.Добавить("МК_ОбновитьСтатусыКЭДО",Тип("КнопкаФормы"),Форма.Элементы.СтандартныеКомандыФормы);  	  
	Исключение
		Попытка
			мЗаписать = Форма.Элементы.Добавить("МК_ОбновитьСтатусыКЭДО",Тип("КнопкаФормы"),Форма.Элементы.ГруппаКнопкиКоманднойПанели);
		Исключение                                                                                                                      
			мЗаписать = Форма.Элементы.Добавить("МК_ОбновитьСтатусыКЭДО",Тип("КнопкаФормы"),Форма.Элементы.КоманднаяПанельФормы);
		КонецПопытки	
	КонецПопытки;	
	мЗаписать.ИмяКоманды = "МК_ОбновитьСтатусыКЭДО";   
		
	мГруппаОтбораСтатусов = Форма.Элементы.Добавить("МК_Отбор", Тип("ГруппаФормы"), Форма.Элементы.СписокНастройкиОтбора);
	мГруппаОтбораСтатусов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	мГруппаОтбораСтатусов.Отображение = ОтображениеОбычнойГруппы.Нет;
	мГруппаОтбораСтатусов.Заголовок = "Статус МояКоманда";
	мГруппаОтбораСтатусов.ОтображатьЗаголовок = Ложь;
	мГруппаОтбораСтатусов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	мРекв = Новый Массив;
	мРекв.Добавить(Новый РеквизитФормы("МК_ОтборИспользование", Новый ОписаниеТипов("Булево"),,"МК_ОтборИспользование"));  
	мРекв.Добавить(Новый РеквизитФормы("МК_ОтборЗначение", Новый ОписаниеТипов("Строка"),,"МК_ОтборЗначение"));  
	Форма.ИзменитьРеквизиты(мРекв);
    ИмяЭлементаФормы = "МК_ОтборИспользование";
		
	Элемент = Форма.Элементы.Добавить(ИмяЭлементаФормы, Тип("ПолеФормы"), мГруппаотбораСтатусов);
	Элемент.ПутьКДанным = "МК_ОтборИспользование";
	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	Элемент.Заголовок = "Статус МояКоманда";   	
	Элемент.УстановитьДействие("ПриИзменении","МК_ПриИзмененииИспользования");       
		
	ИмяЭлементаФормы = "МК_ОтборЗначение";
	Элемент = Форма.Элементы.Добавить(ИмяЭлементаФормы, Тип("ПолеФормы"), мГруппаотбораСтатусов);
	Элемент.ПутьКДанным = "МК_ОтборЗначение";
	Элемент.Вид = ВидПоляФормы.ПолеВвода; 
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элемент.УстановитьДействие("ПриИзменении","МК_ПриИзмененииЗначения");      
	Элемент.КнопкаВыпадающегоСписка = Истина;  
	
   	Элемент.СписокВыбора.Добавить("Черновик"); 
	Элемент.СписокВыбора.Добавить("На подписании"); 
	Элемент.СписокВыбора.Добавить("Просрочен"); 
	Элемент.СписокВыбора.Добавить("Отклонен");
	Элемент.СписокВыбора.Добавить("Недействителен");  
	Элемент.СписокВыбора.Добавить("Не отправлен"); 	
КонецПроцедуры	   

&НаСервере
Процедура МК_ОбновитьСтатусыНаСервере() Экспорт
	// Может быть надо будет сообщать - изменилось ли что-нибудь. В формате, например, - добавилось 10 согласий КЭДО, обновились статусы 14 документов
	мСписДок = Новый Массив;
	мСпис = Справочники.МК_ДокументыКЭДО.ЗапросСтатусовДокументовКЭДО(мСписДок);  
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мКолво = ОО.СинхСправСотрудникиКЭДО();
КонецПроцедуры	

