&НаСервере
Процедура ВыполнитьКоманду()   Экспорт   
	// Делаем только если работаем с КЭДО
	
	// Тут выполняется две задачи:     
	// 1. Получение шаблонов заявлений в справочник МК_НастройкаСвязиЗаявленийКЭДО
	// 2. Получение заявлений
	// Делаем только если работаем с КЭДО
	мРаботаСКЭДО = Константы.МК_РаботаемСКЭДО.Получить();
	Если мРаботаСКЭДО Тогда
		мРез = "";
		// Первый пункт - справочник шаблонов
		Справочники.МК_НастройкиСвязиЗаявленийКЭДО.ПолучитьИОбработатьШаблоныИзМК();
		
		// Второй - заявления.
		Справочники.МК_ЗаявленияСотрудников.ПолучитьИОбработатьЗаявленияИзМК();		
	КонецЕсли;	
    //ИмяСобытия = "МояКоманда. Синхронизация КЭДО";
	//ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, мРез);
КонецПроцедуры  


