
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ЧтоВыгружать=Перечисления.МК_ВидыВыгрузки.ПустаяСсылка() ИЛИ Объект.ЧтоВыгружать=Перечисления.МК_ВидыВыгрузки.Размер Тогда
		Элементы.Показатель.ТолькоПросмотр = Истина;     
	Иначе	                                             
		Элементы.Показатель.ТолькоПросмотр = Ложь;     
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЧтоВыгружатьПриИзменении(Элемент)
	Если Объект.ЧтоВыгружать = ПредопределенноеЗначение("Перечисление.МК_ВидыВыгрузки.ПоказательРасчетаЗарплаты") Тогда
		Элементы.Показатель.ТолькоПросмотр = Ложь;		
	Иначе                                         
		Элементы.Показатель.ТолькоПросмотр = Истина; 
		Объект.Показатель = Неопределено;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроверкаЗаполненностиПоказателя(Отказ)
	Если Объект.ЧтоВыгружать =  Перечисления.МК_ВидыВыгрузки.ПоказательРасчетаЗарплаты Тогда
		Если Не ЗначениеЗаполнено(Объект.Показатель) Тогда
        	Отказ = Истина;
        	Сообщить("Заполните значение показателя!");
		КонецЕсли;	
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПроверкаЗаполненностиПоказателя(Отказ);
КонецПроцедуры

