
&НаСервере
Функция ЗавершениеВыбораНаСервере()   
	мТаб = ЭтаФорма.ВыборДолжностей;
	мСписВыб = Новый СписокЗначений;
	Для Каждого мСтрока ИЗ мТаб Цикл
		Если мСтрока.Выбор Тогда
			мСписВыб.Добавить(мСтрока.Должность);
		КонецЕсли;	
	КонецЦикла;	
	//Константы.МК_СписокДолжностей.Установить(Новый ХранилищеЗначения(мСписВыб));
	Возврат мСписВыб;	
КонецФункции   

&НаКлиенте
Процедура ЗавершениеВыбора(Команда)
	мСписВыб = ЗавершениеВыбораНаСервере();   
	ЭтаФорма.Закрыть(мСписВыб);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Получим список ранее выбранных должностей	
	мСписВыб = Параметры.СписокВыбранных;
	// Теперь - список всех.
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должности.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Должности КАК Должности
		|ГДЕ
		|	НЕ Должности.ПометкаУдаления";
		
		СписокДолжностей = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();   
	мТаб = ЭтаФорма.ВыборДолжностей;	
	Пока Выборка.Следующий() Цикл
		стрТаб = мТаб.Добавить();
		стрТаб.Должность = Выборка.Ссылка;
		Если мСписВыб.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
			стрТаб.Выбор = Ложь;
		Иначе
			стрТаб.Выбор = Истина; 
		КонецЕсли;	
	КонецЦикла;         
КонецПроцедуры

&НаКлиенте
Процедура ОтменаВыбора(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

