&НаСервере
Процедура ВыполнитьКоманду()   Экспорт
	// Фоновое задание тут не нужно, так как клиентской части нет. Поэтому просто вызываем выгрузку. 
	мРез = "";
	// В интерактивном режиме в процедуру выгрузки передается ссылка на форму. Если ее нет, значит вызов из регламентного задания,
	// а из него выгрузка идет только на сервер. 	                                                                               
	мФорма = Неопределено;
	мВозврат = Обработки.МК_ОстаткиОтпусков.ВыгрузитьОстаткиОтпусковНаСервере(мФорма);     
	Если мВозврат[0] = 1 Тогда       
		Если мВозврат[1] > 0 Тогда
			мРез =  "Выгрузка остатков отпусков завершена. Успешно выгружено записей: "+мВозврат[1];
		Иначе
			мРез = "Сотрудников для выгрузки не найдено.";
		КонецЕсли;	
	ИначеЕсли мВозврат[0] = 0 Тогда
		мРез = "Выгрузка не выполнена: ошибка авторизации.";
	КонецЕсли;		
	ИмяСобытия = "МояКоманда. Выгрузка остатков отпусков";
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, мРез);
КонецПроцедуры  
