

&НаКлиенте
Процедура ВыгрузитьРасчетныеЛистки(Команда)  
	Если Не ЭтаФорма.ВыгрузкаДанныхОЗП И Не ЭтаФорма.ВыгрузкаРасчетныхЛистков Тогда
		ПоказатьПредупреждение(, "Нужно выбрать какой-то режим выгрузки");   
		Возврат;
	КонецЕсли;	
	// Надо запросить месяц и год.   
	Режим = РежимДиалогаВопрос.ДаНет;  
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение,"Формирование данных о заработной плате может занять продолжительное время. Выполнить?", Режим, 0);  
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;  
	//Запуск фонового задания на сервере.  
	
	ДлительнаяОперация = ВыгрузитьРЛвФоне();
 
	//Подключение обработчика завершения фонового задания. 
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ТекстСообщения = "Формирование расчетных листков...";
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьФормированиеРЛЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
КонецПроцедуры  

&НаСервере
Функция ВыгрузитьРЛвФоне()
	
	НаименованиеЗадания = НСтр("ru = 'Формирование расчетных листков'");
	ВыполняемыйМетод = "Обработки.МК_РасчетныеЛистки.ВыгрузкаРЛ";
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	ПараметрыВыполнения.Вставить("мГод", ЭтаФорма.мГод); 
	ПараметрыВыполнения.Вставить("мМесяц", ЭтаФорма.мМесяц);    
	ПараметрыВыполнения.Вставить("мДир", ЭтаФорма.КаталогДляВыгрузкиФайлов); 
	ПараметрыВыполнения.Вставить("мСпособВыгрузки", ЭтаФорма.СпособВыгрузки);    
	ПараметрыВыполнения.Вставить("УникальныйИдентификаторФормы", ЭтаФорма.УникальныйИдентификатор);    
	ПараметрыВыполнения.Вставить("ИнтерактивныйРежим", Истина); 
	ПараметрыВыполнения.Вставить("ВыгружатьДанныеОЗП",ЭтаФорма.ВыгрузкаДанныхОЗП);
	ПараметрыВыполнения.Вставить("ВыгружатьРЛ",ЭтаФорма.ВыгрузкаРасчетныхЛистков);
	// Чтобы из фонового задания получить правильные адреса сохраненных во временном хранилище данных, нужно в 
	// это задание передать адрес во временном хранилище, доступный из этого сеанса. Адреса 3: архив табулек, описание файла табулек и зарплата сотрудников.
	мАдрес1 = ПоместитьВоВременноеХранилище(,ЭтаФорма.УникальныйИдентификатор); 
	мАдрес2 = ПоместитьВоВременноеХранилище(,ЭтаФорма.УникальныйИдентификатор);  
	мАдрес3 = ПоместитьВоВременноеХранилище(,ЭтаФорма.УникальныйИдентификатор);
	мАдрес4 = ПоместитьВоВременноеХранилище(,ЭтаФорма.УникальныйИдентификатор);
	ПараметрыВыполнения.Вставить("мАдрес1", мАдрес1);  
	ПараметрыВыполнения.Вставить("мАдрес2", мАдрес2);
	ПараметрыВыполнения.Вставить("мАдрес3", мАдрес3);    
	ПараметрыВыполнения.Вставить("мАдрес4", мАдрес4);
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ВыполняемыйМетод, ПараметрыВыполнения);  
КонецФункции    

// Обработка результата выполнения фонового задания.
&НаКлиенте
Процедура ПолучитьФормированиеРЛЗавершение(мРезультат, ДополнительныеПараметры) Экспорт  
	мРез = Истина;
	мДир = ЭтаФорма.КаталогДляВыгрузкиФайлов;     
	мВыгрузкаЗП = ЭтаФорма.ВыгрузкаДанныхОЗП;
	мВыгрузкаРЛ = ЭтаФорма.ВыгрузкаРасчетныхЛистков;
    Если мРезультат = Неопределено Тогда // Пользователь отменил задание.
		ПоказатьПредупреждение(, "Выгрузка данных о заработной плате прервана пользователем");   
 		Возврат;
	КонецЕсли;
 	Если мРезультат.Статус = "Ошибка" Тогда
 		ВызватьИсключение мРезультат.КраткоеПредставлениеОшибки;
		мРез = Ложь;
	Иначе                                                                    
		мИтог = ПолучитьИзВременногоХранилища(мРезультат.АдресРезультата);       
		Если мИтог.Колво > 0 И мИтог.КодРезультата = 3 Тогда 
			ПоказатьПредупреждение(, "Выгрузка данных о заработной плате завершена. Создано документов: " + мИтог.Колво);	
		ИначеЕсли мИтог.Колво = 0 Тогда
			ПоказатьПредупреждение(, "Сотрудников для выгрузки не найдено");	
			мРез = Ложь;
		ИначеЕсли мИтог.КодРезультата = 1 Тогда
			ПоказатьПредупреждение(, "Ошибка отправки архива расчетных листков");	
			мРез = Ложь;
		ИначеЕсли мИтог.КодРезультата = 2 Тогда
			ПоказатьПредупреждение(, "Ошибка отправки описания расчетных листков");	
		ИначеЕсли мИтог.КодРезультата = 4 Тогда
			ПоказатьПредупреждение(, "Ошибка отправки сведений о зарплате");			
		ИначеЕсли мИтог.КодРезультата = 0 Тогда
			ПоказатьПредупреждение(, "Выгрузка не выполнена: ошибка авторизации");		
		КонецЕсли;	
	КонецЕсли;    
		
	Если мРез И ЭтаФорма.СпособВыгрузки = 2 Тогда    // Если выгружаем в файлы
		МассивОписаний=Новый Массив;     
		Если мВыгрузкаРЛ Тогда
			Описание=Новый ОписаниеПередаваемогоФайла(); 
			Описание.Имя = мДир + "\" + мИтог.ИмяZIPАрхива;
			Описание.Хранение = мИтог.АдресZIPАрхива;         
			МассивОписаний.Добавить(Описание);  
		
			Описание=Новый ОписаниеПередаваемогоФайла();
			Описание.Имя = мИтог.ИмяОписания;   // Тут полное имя возвращается.
			Описание.Хранение = мИтог.АдресОписания;
			МассивОписаний.Добавить(Описание);      
		КонецЕсли;	
		
		Если мВыгрузкаЗП Тогда
			Описание=Новый ОписаниеПередаваемогоФайла();
			Описание.Имя = мИтог.ИмяЗарплаты;   // Тут полное имя возвращается.
			Описание.Хранение = мИтог.АдресЗарплаты;
			МассивОписаний.Добавить(Описание);      
			
			Описание=Новый ОписаниеПередаваемогоФайла();
			Описание.Имя = мИтог.ИмяСправНУ;   // Тут полное имя возвращается.
			Описание.Хранение = мИтог.СправочникиНУ;
			МассивОписаний.Добавить(Описание); 
		КонецЕсли;	
		
		ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов("Выберите каталог для сохранения файлов", Ложь);
		НачатьПолучениеФайловССервера(МассивОписаний,ПараметрыДиалога);
	КонецЕсли;
 	УдалитьИзВременногоХранилища(мРезультат.АдресРезультата);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Предлагаем выгрузку за прошлый месяц.
	мДата = ТекущаяДата();
	ЭтаФорма.мГод = Формат(Год(мДата),"ЧГ=0");
	ЭтаФорма.мМесяц = Месяц(мДата)-1;
	Если ЭтаФорма.мМесяц = 0 Тогда
		ЭтаФорма.мМесяц = 12;
		ЭтаФорма.мГод = ЭтаФорма.мГод -1;
	КонецЕсли;
	ЭтаФорма.КаталогДляВыгрузкиФайлов = Константы.МК_КаталогДляВыгрузкиФайлов.Получить();
	ЭтаФорма.СпособВыгрузки = 1;    
	ЭтаФорма.ВыгрузкаДанныхОЗП = Константы.МК_ВыгружатьДанныеОЗП.Получить();
	ЭтаФорма.ВыгрузкаРасчетныхЛистков = Константы.МК_ВыгружатьРЛ.Получить();
КонецПроцедуры


&НаКлиенте
Процедура КаталогДляВыгрузкиФайловНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ЭтаФорма.КаталогДляВыгрузкиФайлов; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	Если ДиалогОткрытия.Выбрать() Тогда   
		ЭтаФорма.КаталогДляВыгрузкиФайлов = ДиалогОткрытия.Каталог; 
	КонецЕсли;  
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура КаталогДляВыгрузкиФайловПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры  

&НаСервере
Процедура СохранитьНастройки()
	Константы.МК_КаталогДляВыгрузкиФайлов.Установить(ЭтаФорма.КаталогДляВыгрузкиФайлов); 
	Константы.МК_ВыгружатьДанныеОЗП.Установить(ЭтаФорма.ВыгрузкаДанныхОЗП);
	Константы.МК_ВыгружатьРЛ.Установить(ЭтаФорма.ВыгрузкаРасчетныхЛистков);
КонецПроцедуры	


