
&НаСервере
Функция ЗавершениеВыбораНаСервере()   
	мТаб = ЭтаФорма.ВыборПодразделений;
	мСписВыб = Новый СписокЗначений;
	Для Каждого мСтрока ИЗ мТаб Цикл
		Если мСтрока.Выбор Тогда
			мСписВыб.Добавить(мСтрока.Подразделение);
		КонецЕсли;	
	КонецЦикла;	
	//Константы.МК_СписокДолжностей.Установить(Новый ХранилищеЗначения(мСписВыб));
	Возврат мСписВыб;	
КонецФункции   

&НаКлиенте
Процедура ЗавершениеВыбора(Команда)
	мСписВыб = ЗавершениеВыбораНаСервере();   
	// Надо возвращать управление. Нужно вернуть список выбранных значений и некий признак того, что возврат выполнен
	// по кнопке "ОК". Но параметр может быть только один. Поэтому массив.
	мВозврат = Новый Массив;
	мВозврат.Добавить(мСписВыб);
	мВозврат.Добавить(1);        // Это и означает, что ОК.
	ЭтаФорма.Закрыть(мВозврат);    
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Получим список ранее выбранных должностей	
	мСписВыб = Параметры.СписокВыбранных;	
	// Тут список выбранных равен общему списку.
	мТаб = ЭтаФорма.ВыборПодразделений;	
	Для Каждого Элемент Из мСписВыб Цикл
		стрТаб = мТаб.Добавить();
		стрТаб.Подразделение = Элемент.Значение;
		стрТаб.Выбор = Истина;			
	КонецЦикла;         
КонецПроцедуры         

&НаКлиенте
Процедура ОтменаВыбора(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВсе(Команда)   
	// Сначала завершим выбор.
	мСписВыб = ЗавершениеВыбораНаСервере();   // Получили список, оставшийся после редактирования в краткой форме.  
	// Надо возвращать управление. Нужно вернуть список выбранных значений и некий признак того, что возврат выполнен
	// по гиперссылке "Показать все". Но параметр может быть только один. Поэтому массив.
	мВозврат = Новый Массив;
	мВозврат.Добавить(мСписВыб);
	мВозврат.Добавить(2);        // Это и означает, что показать все.
	ЭтаФорма.Закрыть(мВозврат);
КонецПроцедуры


