&НаСервере
Функция ПроверкаСвязиНаСервере()
	// Проверка на безопасный режим должна работать только для "земли". Во Фреше - не нужна, там всегда безопасный.
	мРезультат = 2;
	мНеФреш = Константы.МК_НеФреш.Получить();
	Если мНеФреш Тогда;
		Если БезопасныйРежим() <> Ложь Тогда
        	мРезультат = 3;
		КонецЕсли;
	КонецЕсли;
	Если мРезультат = 2 Тогда	     
		// Проверять теперь велят не сохраненные в константах значения, а введенные в настоящий момент в форме  
		мПараметры = Новый Структура;
		мПараметры.Вставить("Сервер",ЭтаФорма.СерверМояКоманда);
		мПараметры.Вставить("Логин",ЭтаФорма.Логин);
		мПараметры.Вставить("Пароль",ЭтаФорма.Пароль);
		мРезультат = РеквизитФормыВЗначение("Объект").ПроверкаСвязиМК(мПараметры);
	КонецЕсли;
	Возврат мРезультат;
КонецФункции

&НаКлиенте
Процедура ПроверкаСвязи(Команда)     
	Результат = ПроверкаСвязиНаСервере();  		
	Если Результат = 2 Тогда
		ПоказатьПредупреждение(,"Есть контакт!");
	ИначеЕсли Результат = 0 Тогда     
		ПоказатьПредупреждение(,"Не получилось. Видимо указано неверное имя сервера.");
	ИначеЕсли Результат = 3 Тогда
		ПоказатьПредупреждение(,"В безопасном режиме расширение работать не будет. Нужно отключить его");
	Иначе	
		ПоказатьПредупреждение(,"Не получилось. Ошибка авторизации.");
	КонецЕсли;	
	
КонецПроцедуры   


&НаСервереБезКонтекста
Функция ПолучитьИС()
	МК_Сервер = Константы.МК_Сервер.Получить();
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	ИмяСервера = ОО.ПолучитьИмяСервера(МК_Сервер);            
КонецФункции	

&НаКлиенте
Процедура КаталогДляВыгрузкиФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ЭтаФорма.КаталогДляВыгрузкиФайлов; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 

	Если ДиалогОткрытия.Выбрать() Тогда   
		Если Элемент.Имя = "КаталогДляВыгрузкиФайлов" Тогда
			ЭтаФорма.КаталогДляВыгрузкиФайлов = ДиалогОткрытия.Каталог; 
		Иначе
			ЭтаФорма.КаталогДляЛогов = ДиалогОткрытия.Каталог; 
		КонецЕсли;	
	КонецЕсли;  		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();
	ЭтаФорма.СерверМояКоманда = Константы.МК_Сервер.Получить();
	ЭтаФорма.Пароль = Константы.МК_Пароль.Получить();
	ЭтаФорма.Логин = Константы.МК_Логин.Получить(); 	
	Попытка
		ЭтаФорма.СписокОрганизаций = Константы.МК_СписокОрганизаций.Получить().Получить();  
	Исключение  
		ЭтаФорма.СписокОрганизаций = Новый СписокЗначений;
		Сообщить("Нужно настроить список организаций");
		Константы.МК_СписокОрганизаций.Установить(Новый ХранилищеЗначения(ЭтаФорма.СписокОрганизаций)); 
	КонецПопытки;
	мКонтИнф = ОО.ПолучитьВидыКонтИнф(); 
	ЭтаФорма.СписокДолжностей = ОО.ПолучитьСписокДолжностей();
	ЭтаФорма.СписокСотрудников = ОО.ПолучитьСписокСотрудников();
	ЭтаФорма.СписокПодразделений = ОО.ПолучитьСписокПодразделений();  
	ЭтаФорма.СписокПодразделенийСтруктура = ОО.ПолучитьСписокПодразделенийСтруктура();  
	ЭтаФорма.СписокВидовЗанятости = ОО.ПолучитьВидыЗанятости();
	
	// Вместо подразделений может теперь использоваться орг.структура предприятия. Она доступна, если эта структура
	// есть в текущей ЗУП.
	Если ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		ЭтаФорма.ИспользуетсяОргСтруктура = Истина;
	Иначе                                          
		ЭтаФорма.ИспользуетсяОргСтруктура = Ложь;
	КонецЕсли;
	// Теперь прочитаем константу МК_ВыгружатьОргСтруктуру
	ЭтаФорма.ВыгружатьОргСтруктуру = Константы.МК_ВыгружатьОргСтруктуру.Получить();
	
	// Теперь надо заполнить таблицу значений с типами контактной информации
	мТабКИ = ЭтаФорма.КонтактнаяИнформация;
	стрТаб = мТабКИ.Добавить();
	стрТаб.ВидМояКоманда = "Основная электронная почта (логин)";
	стрТаб.Вид1С = мКонтИнф[0];                         
	стрТаб = мТабКИ.Добавить();
	стрТаб.ВидМояКоманда = "Дополнительная электронная почта";
	стрТаб.Вид1С = мКонтИнф[1];                     
	стрТаб = мТабКИ.Добавить();
	стрТаб.ВидМояКоманда = "Телефон";
	стрТаб.Вид1С = мКонтИнф[2];       
	стрТаб = мТабКИ.Добавить();
	стрТаб.ВидМояКоманда = "Адрес";
	стрТаб.Вид1С = мКонтИнф[3];

	
	мТабВИ = ЭтаФорма.НастройкаВыгружаемойИнформации;        
	мНВИ = ОО.ПолучитьНастройкиВыгружаемойИнформации();  
	
	
	
	СтрТаб = мТабВИ.Добавить();   // 11
	стрТаб.Реквизит = "Основная электронная почта (логин)";
	стрТаб.ОбязательноВыгружать = Истина;
	стрТаб.Выгружать = Истина;
	стрТаб.НомерРеквизита = 11;   
	
	СтрТаб = мТабВИ.Добавить();  //  1
	стрТаб.Реквизит = "ID сотрудника";
	стрТаб.ОбязательноВыгружать = Истина;
	стрТаб.Выгружать = Истина;  
	стрТаб.НомерРеквизита = 1;
	
	СтрТаб = мТабВИ.Добавить();   //  2
	стрТаб.Реквизит = "Табельный номер";
	стрТаб.ОбязательноВыгружать = Истина;
	стрТаб.Выгружать = Истина;
	стрТаб.НомерРеквизита = 2;  
	
	СтрТаб = мТабВИ.Добавить();    // 15
	стрТаб.Реквизит = "Вид занятости";
	стрТаб.ОбязательноВыгружать = Истина;
	стрТаб.Выгружать = Истина;     
	стрТаб.НомерРеквизита = 15;
	
	СтрТаб = мТабВИ.Добавить();   //  8
	стрТаб.Реквизит = "Фамилия";
	стрТаб.ОбязательноВыгружать = Истина;
	стрТаб.Выгружать = Истина;
	стрТаб.НомерРеквизита = 8;
	
	СтрТаб = мТабВИ.Добавить();   //  9
	стрТаб.Реквизит = "Имя";
	стрТаб.ОбязательноВыгружать = Истина;
	стрТаб.Выгружать = Истина;
	стрТаб.НомерРеквизита = 9;

	СтрТаб = мТабВИ.Добавить();   // 10
	стрТаб.Реквизит = "Отчество";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[9]="1"); 
	стрТаб.НомерРеквизита = 10;  
	
	СтрТаб = мТабВИ.Добавить();   //  6
	стрТаб.Реквизит = "Дата приема";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[5]="1");
	стрТаб.НомерРеквизита = 6;   
	
	СтрТаб = мТабВИ.Добавить();   //  3
	стрТаб.Реквизит = "Организация";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[2]="1");
	стрТаб.НомерРеквизита = 3;
	
	СтрТаб = мТабВИ.Добавить();   //  4  	
	стрТаб.Реквизит = "Подразделение";
	стрТаб.Выгружать = (мНВИ[3]="1");    
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.НомерРеквизита = 4;                  
	Если ЭтаФорма.ВыгружатьОргСтруктуру Тогда	
		стрТаб.НеПоказывать = "Истина";
	КонецЕсли;			

	СтрТаб = мТабВИ.Добавить();   //  23  
	стрТаб.Реквизит = "Подразделение (структура предприятия)";
	стрТаб.Выгружать = (мНВИ[22]="1"); 
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.НомерРеквизита = 23;          
	Если Не ЭтаФорма.ВыгружатьОргСтруктуру Тогда	
		стрТаб.НеПоказывать = "Истина";
	КонецЕсли;	
			
	СтрТаб = мТабВИ.Добавить();   //  5
	стрТаб.Реквизит = "Должность";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[4]="1");
	стрТаб.НомерРеквизита = 5;     
	
	СтрТаб = мТабВИ.Добавить();    // 20
	стрТаб.Реквизит = "Дата назначения";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[19]="1");
	стрТаб.НомерРеквизита = 20;  
	стрТаб.НеПоказывать = Истина; 
	
	СтрТаб = мТабВИ.Добавить();   //  7
	стрТаб.Реквизит = "Дата увольнения";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[6]="1");
	стрТаб.НомерРеквизита = 7;
	
	СтрТаб = мТабВИ.Добавить();    // 19
	стрТаб.Реквизит = "Телефон";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[18]="1");
	стрТаб.НомерРеквизита = 19;
	
    СтрТаб = мТабВИ.Добавить();   // 14
	стрТаб.Реквизит = "СНИЛС";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[13]="1");
	стрТаб.НомерРеквизита = 14;     
	
	СтрТаб = мТабВИ.Добавить();   // 13
	стрТаб.Реквизит = "Пол";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[12]="1");
	стрТаб.НомерРеквизита = 13;
	
	СтрТаб = мТабВИ.Добавить();   // 12
	стрТаб.Реквизит = "Дата рождения";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[11]="1");
	стрТаб.НомерРеквизита = 12; 
	
	СтрТаб = мТабВИ.Добавить();    // 18
	стрТаб.Реквизит = "Адрес";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[17]="1");
	стрТаб.НомерРеквизита = 18; 

	СтрТаб = мТабВИ.Добавить();    // 16
	стрТаб.Реквизит = "Документ удостоверяющий личность";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[15]="1");
	стрТаб.НомерРеквизита = 16;
	
	СтрТаб = мТабВИ.Добавить();    // 17
	стрТаб.Реквизит = "Электронная почта (дополнительная)";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[16]="1");
	стрТаб.НомерРеквизита = 17;
	
	СтрТаб = мТабВИ.Добавить();    // 21
	стрТаб.Реквизит = "График работы";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[20]="1");
	стрТаб.НомерРеквизита = 21;

    СтрТаб = мТабВИ.Добавить();    // 22
	стрТаб.Реквизит = "Дистанционная работа";
	стрТаб.ОбязательноВыгружать = Ложь;
	стрТаб.Выгружать = (мНВИ[21]="1");   
	стрТаб.НомерРеквизита = 22;           
	
	// 12.08.2025 Велено убрать из таблицы настроек выгрузки дату назначения (изменения должности или подразделения)
	// Чтобы не ломать массив настроек, строка сделана невидимой, но присутствует в настройке.
	Элементы.НастройкаВыгружаемойИнформации.ОтборСтрок= Новый ФиксированнаяСтруктура("НеПоказывать", Ложь);
	
	// Переопределяемые реквизиты. Пока  это Фамилия, Имя, Отчество
	мТабПР = ЭтаФорма.ПереопределяемыеРеквизиты;        
	мНПР = ОО.ПолучитьПереопределяемыеРеквизиты();
	
	СтрТаб = мТабПР.Добавить();  //  1
	стрТаб.ВидМояКоманда = "Фамилия";
	стрТаб.Вид1С = мНПР[0];
	
	СтрТаб = мТабПР.Добавить();  //  2
	стрТаб.ВидМояКоманда = "Имя";
    стрТаб.Вид1С = мНПР[1];
	
	СтрТаб = мТабПР.Добавить();  //  3
	стрТаб.ВидМояКоманда = "Отчество";
    стрТаб.Вид1С = мНПР[2];           
	
	СтрТаб = мТабПР.Добавить();  //  4  
	Если ЭтаФорма.ВыгружатьОргСтруктуру Тогда
		стрТаб.ВидМояКоманда = "Руководитель подразделения (структура предприятия)";
	Иначе	
		стрТаб.ВидМояКоманда = "Руководитель подразделения";		
	КонецЕсли;	               
	стрТаб.Вид1С = мНПР[3];

	СтрТаб = мТабПР.Добавить();  //  5
	стрТаб.ВидМояКоманда = "Должность";
    стрТаб.Вид1С = мНПР[4];    
	
	// Фильтры выгрузки сотрудников
	мТабФ = ЭтаФорма.ФильтрыВыгрузкиСотрудников;        
	мУФ = ОО.ПолучитьУчитываемыеФильтры(); 
	мВД = ОО.ПолучитьВидыДействия();
	
	СтрТаб = мТабФ.Добавить();  //  0
	стрТаб.ОбъектФильтра = "Организации";
	стрТаб.Применять = (мУФ[0]="1");   
	стрТаб.Способ = мВД[0];  
	стрТаб.Значения = ЭтаФорма.СписокОрганизаций;  
	стрТаб.НомерРеквизита = 1; 
	
	СтрТаб = мТабФ.Добавить();  //  1
	стрТаб.ОбъектФильтра = "Виды Занятости";
	стрТаб.Применять = (мУФ[1]="1");   
	стрТаб.Способ = мВД[1];
	стрТаб.Значения = ЭтаФорма.СписокВидовЗанятости;
	стрТаб.НомерРеквизита = 2; 
	
	СтрТаб = мТабФ.Добавить();  //  2   
    стрТаб.ОбъектФильтра = "Подразделения";
	стрТаб.Применять = (мУФ[2]="1");   
	стрТаб.Способ = мВД[2];
	стрТаб.Значения = ЭтаФорма.СписокПодразделений;	   
	стрТаб.НомерРеквизита = 3; 
	Если ЭтаФорма.ВыгружатьОргСтруктуру Тогда       
		стрТаб.НеПоказывать = Истина;
	КонецЕсли;		
	
	СтрТаб = мТабФ.Добавить();  //  5   
	стрТаб.ОбъектФильтра = "Подразделения (структура предприятия)";
	стрТаб.Применять = (мУФ[5]="1");   
	стрТаб.Способ = мВД[5];
	стрТаб.Значения = ЭтаФорма.СписокПодразделенийСтруктура;	
	стрТаб.НомерРеквизита = 6; 
	Если Не ЭтаФорма.ВыгружатьОргСтруктуру Тогда       
		стрТаб.НеПоказывать = Истина;
	КонецЕсли;		

	СтрТаб = мТабФ.Добавить();  //  3
	стрТаб.ОбъектФильтра = "Должности";
	стрТаб.Применять = (мУФ[3]="1");  
	стрТаб.Способ = мВД[3];                      
	стрТаб.Значения = ЭтаФорма.СписокДолжностей;
	стрТаб.НомерРеквизита = 4; 
	
	СтрТаб = мТабФ.Добавить();  //  4
	стрТаб.ОбъектФильтра = "Сотрудники";
	стрТаб.Применять = (мУФ[4]="1");  
	стрТаб.Способ = мВД[4];                     
	стрТаб.Значения = ЭтаФорма.СписокСотрудников;
	стрТаб.НомерРеквизита = 5; 
	
	Элементы.ФильтрыВыгрузкиСотрудников.ОтборСтрок= Новый ФиксированнаяСтруктура("НеПоказывать", Ложь);
КонецПроцедуры


&НаСервере
Процедура СохранитьКонстанты()
	Константы.МК_Сервер.Установить(ЭтаФорма.СерверМояКоманда);
	Константы.МК_Логин.Установить(ЭтаФорма.Логин);
	Константы.МК_Пароль.Установить(ЭтаФорма.Пароль);   
	Константы.МК_СписокОрганизаций.Установить(Новый ХранилищеЗначения(ЭтаФорма.СписокОрганизаций)); 
	Константы.МК_СписокДолжностей.Установить(Новый ХранилищеЗначения(ЭтаФорма.СписокДолжностей));
	Константы.МК_СписокПодразделений.Установить(Новый ХранилищеЗначения(ЭтаФорма.СписокПодразделений));
	Константы.МК_СписокПодразделенийСтруктура.Установить(Новый ХранилищеЗначения(ЭтаФорма.СписокПодразделенийСтруктура));
	Константы.МК_СписокСотрудников.Установить(Новый ХранилищеЗначения(ЭтаФорма.СписокСотрудников)); 
	Константы.МК_СписокВидовЗанятости.Установить(Новый ХранилищеЗначения(ЭтаФорма.СписокВидовЗанятости));  
	// Контактная информация 
	мКЗКИ = ЭтаФорма.КонтактнаяИнформация;        // Тут получаем коллекцию значений
	мТабКИ = мКЗКИ.Выгрузить(,"Вид1С");           // Тут - таблицу значений
	мКонтИнф = мТабКИ.ВыгрузитьКолонку("Вид1С");  // И тут - нужный массив	
	Константы.МК_КонтактнаяИнформация.Установить(Новый ХранилищеЗначения(мКонтИнф)); 
	СохранитьНВИ2();  // Настройки выгружаемой информации    
	СохранитьПереопределяемыеРеквизиты();     
	СохранитьФильтрыВыгрузкиСотрудниковПрименение();  
	СохранитьФильтрыВыгрузкиСотрудниковСпособ();
КонецПроцедуры               

&НаСервере
Процедура СохранитьНВИ2()  // Сюда ничего не передаем, так как измененные настройки считываются из текущей таблицы значений. 
	мсНВИ = "";     
	мКЗ = ЭтаФорма.НастройкаВыгружаемойИнформации;     // Тут получаем коллекцию значений. В связи с тем, что порядок строк в таблице заказчик позже поменял, 
	мКЗ.Сортировать("НомерРеквизита");                 // нужно отсортировать коллекцию по колонке "НомерРеквизита".
	мТаб = мКЗ.Выгрузить(,"Выгружать");                // Тут - таблицу значений
	мНВИ = мТаб.ВыгрузитьКолонку("Выгружать");         // Это - массив. 
	мКолвоНВИ = мНВИ.Количество();
	Для мИндекс = 0 По мКолвоНВИ - 1 Цикл
		Если мНВИ[мИндекс] Тогда
			мЭлемент = "1";
		Иначе	         
			мЭлемент = "0";
		КонецЕсли;	
		мсНВИ = мсНВИ + мЭлемент;		
		Если мИндекс <> мКолвоНВИ - 1 Тогда
			мсНВИ = мсНВИ + ",";
		КонецЕсли;	
	КонецЦикла;
	Константы.МК_НастройкиВыгрузкиИнформации.Установить(мсНВИ);	
КонецПроцедуры	

&НаСервере
Процедура СохранитьПереопределяемыеРеквизиты()   
	мКЗПР = ЭтаФорма.ПереопределяемыеРеквизиты;   // Тут получаем коллекцию значений
	мТабПР = мКЗПР.Выгрузить(,"Вид1С");           // Тут - таблицу значений
	мПерРекв = мТабПР.ВыгрузитьКолонку("Вид1С");  // И тут - нужный массив	
	Константы.МК_ПереопределяемыеРеквизиты.Установить(Новый ХранилищеЗначения(мПерРекв));
КонецПроцедуры 

&НаСервере
Процедура СохранитьФильтрыВыгрузкиСотрудниковПрименение()
	мсУФ = "";     
	мКЗ = ЭтаФорма.ФильтрыВыгрузкиСотрудников;     // Тут получаем коллекцию значений   
	мКЗ.Сортировать("НомерРеквизита");
	мТаб = мКЗ.Выгрузить(,"Применять");                // Тут - таблицу значений
	мУФ = мТаб.ВыгрузитьКолонку("Применять");          // Это - массив. 
	мКолвоУФ = мУФ.Количество();
	Для мИндекс = 0 По мКолвоУФ - 1 Цикл
		Если мУФ[мИндекс] Тогда
			мЭлемент = "1";
		Иначе	         
			мЭлемент = "0";
		КонецЕсли;	
		мсУФ = мсУФ + мЭлемент;		
		Если мИндекс <> мКолвоУФ - 1 Тогда
			мсУФ = мсУФ + ",";
		КонецЕсли;	
	КонецЦикла;
	Константы.МК_УчитываемыеФильтры.Установить(мсУФ);	
КонецПроцедуры


&НаСервере
Процедура СохранитьФильтрыВыгрузкиСотрудниковСпособ()
	мсВД = "";     
	мКЗ = ЭтаФорма.ФильтрыВыгрузкиСотрудников;     // Тут получаем коллекцию значений
	мКЗ.Сортировать("НомерРеквизита");
	мТаб = мКЗ.Выгрузить(,"Способ");                // Тут - таблицу значений
	мВД = мТаб.ВыгрузитьКолонку("Способ");          // Это - массив. 
	мКолвоВД = мВД.Количество();
	Для мИндекс = 0 По мКолвоВД - 1 Цикл
		Если мВД[мИндекс]=1 Тогда
			мЭлемент = "1";
		Иначе	         
			мЭлемент = "2";
		КонецЕсли;	
		мсВД = мсВД + мЭлемент;		
		Если мИндекс <> мКолвоВД - 1 Тогда
			мсВД = мсВД + ",";
		КонецЕсли;	
	КонецЦикла;
	Константы.МК_ВидыДействия.Установить(мсВД);	
КонецПроцедуры


&НаКлиенте
Процедура СписокОрганизацийОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	мСписВыб = ЭтаФорма.СписокОрганизаций;
	мПараметры = Новый Структура("МножественныйВыбор", Истина);     
	мПараметры.Вставить("ЗакрыватьПослеВыбора", Ложь);  
	мПараметры.Вставить("СписокВыбранных",мСписВыб);     
	ДопПараметры = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект,ДопПараметры);   	
	ОткрытьФорму("Обработка.МК_НастройкаВыгрузки.Форма.МК_ФормаВыбораОрганизаций",мПараметры,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПослеОкончания(Результат, ДопПараметры) Экспорт     
	// Результат - это параметр, передаваемый в команде Закрыть при закрытии формы, вызванной в верхней процедуре.
	Если Результат <> Неопределено Тогда 
		ЭтаФорма.СписокОрганизаций = Результат;          
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Значения = Результат;
  	КонецЕсли; 
КонецПроцедуры    



&НаКлиенте
Процедура НастройкаВыгружаемойИнформацииПередНачаломИзменения(Элемент, Отказ)  
	Отказ = Истина;
	Если Элемент.ТекущиеДанные.ОбязательноВыгружать Тогда
		Элемент.ТекущиеДанные.Выгружать = Истина;   
		Сообщить("Этот реквизит выгружается обязательно");
	Иначе	
		Если Элемент.ТекущиеДанные.Выгружать = Истина Тогда
			Элемент.ТекущиеДанные.Выгружать = Ложь;
			мЭл = "0";
		Иначе
			Элемент.ТекущиеДанные.Выгружать = Истина;
			мЭл = "1";
		КонецЕсли;	   
		//СохранитьНВИ2();			
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ФильтрыВыгрузкиСотрудниковЗначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;  
	ВыбраннаяСтрока = Элемент.Родитель.ТекущаяСтрока; 
	Если ВыбраннаяСтрока = 0 Тогда 		 
		СписокОрганизацийОткрытие(Элемент, СтандартнаяОбработка);
	ИначеЕсли ВыбраннаяСтрока = 1 Тогда	                         
		СписокВидовЗанятостиОткрытие(Элемент, СтандартнаяОбработка);
	ИначеЕсли ВыбраннаяСтрока = 2 Тогда
		//СтандартнаяОбработка = Ложь; 
		мСписВыб = ЭтаФорма.СписокПодразделений;     
		Если мСписВыб.Количество() = 0 Тогда     // Если еще ничего не выбрано, сразу открываем полный справочник.
			СписокПодразделенийОткрытие(Элемент, СтандартнаяОбработка);   
		Иначе	                                 // Если уже что-то есть, открываем краткую форму выбора. Только в ней можно отменить выбор.
			СписокПодразделенийКраткийОткрытие(Элемент, СтандартнаяОбработка);			
		КонецЕсли;	  
	ИначеЕсли ВыбраннаяСтрока = 3 Тогда
		//СтандартнаяОбработка = Ложь; 
		мСписВыб = ЭтаФорма.СписокПодразделенийСтруктура;     
		Если мСписВыб.Количество() = 0 Тогда     // Если еще ничего не выбрано, сразу открываем полный справочник.
			СписокПодразделенийСтруктураОткрытие(Элемент, СтандартнаяОбработка);   
		Иначе	                                 // Если уже что-то есть, открываем краткую форму выбора. Только в ней можно отменить выбор.
			СписокПодразделенийСтруктураКраткийОткрытие(Элемент, СтандартнаяОбработка);			
		КонецЕсли;		
	ИначеЕсли ВыбраннаяСтрока = 4 Тогда                          
		СписокДолжностейОткрытие(Элемент, СтандартнаяОбработка);		
	ИначеЕсли ВыбраннаяСтрока = 5 Тогда
		СписокСотрудниковОткрытие(Элемент, СтандартнаяОбработка);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура СписокДолжностейОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	мСписВыб = ЭтаФорма.СписокДолжностей;
	мПараметры = Новый Структура("МножественныйВыбор", Истина);     
	мПараметры.Вставить("ЗакрыватьПослеВыбора", Ложь);  
	мПараметры.Вставить("СписокВыбранных",мСписВыб);     
	ДопПараметры = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания1", ЭтотОбъект,ДопПараметры);   	
	ОткрытьФорму("Обработка.МК_НастройкаВыгрузки.Форма.МК_ФормаВыбораДолжностей",мПараметры,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПослеОкончания1(Результат, ДопПараметры) Экспорт     
	// Результат - это параметр, передаваемый в команде Закрыть при закрытии формы, вызванной в верхней процедуре.
	Если Результат <> Неопределено Тогда 
		ЭтаФорма.СписокДолжностей = Результат;          
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Значения = Результат;
  	КонецЕсли; 
КонецПроцедуры    


&НаКлиенте
Процедура СписокСотрудниковОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	мСписВыб = ЭтаФорма.СписокСотрудников;
	мПараметры = Новый Структура("МножественныйВыбор", Истина);     
	мПараметры.Вставить("ЗакрыватьПослеВыбора", Ложь);  
	мПараметры.Вставить("СписокВыбранных",мСписВыб);     
	ДопПараметры = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания2", ЭтотОбъект,ДопПараметры);   	
	ОткрытьФорму("Обработка.МК_НастройкаВыгрузки.Форма.МК_ФормаВыбораСотрудников",мПараметры,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПослеОкончания2(Результат, ДопПараметры) Экспорт     
	// Результат - это параметр, передаваемый в команде Закрыть при закрытии формы, вызванной в верхней процедуре.
	Если Результат <> Неопределено Тогда 
		ЭтаФорма.СписокСотрудников = Результат;
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Значения = Результат;
  	КонецЕсли; 
КонецПроцедуры    


&НаКлиенте
Процедура СписокПодразделенийОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	мСписВыб = ЭтаФорма.СписокПодразделений.ВыгрузитьЗначения();  
	// В форму выбора подразделений список выбранных значений передается через временное хранилище.
	// То есть надо сохранить массив во временное хранилище, а в форму передать адрес.
	АдресВХранилище = ПоместитьВоВременноеХранилище(мСписВыб);
	мПараметры = Новый Структура("МножественныйВыбор", Истина);  
	мПараметры.Вставить("РежимВыбора", Истина);
	мПараметры.Вставить("ЗакрыватьПослеВыбора", Ложь);  
	мПараметры.Вставить("АдресСпискаПодобранных",АдресВХранилище); 
	мПараметры.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);   

	ДопПараметры = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания3", ЭтотОбъект,ДопПараметры);  	
	ОткрытьФорму("Справочник.ПодразделенияОрганизаций.ФормаВыбора", мПараметры,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца );
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончания3(Результат, ДопПараметры) Экспорт     
	// Результат - это параметр, передаваемый в команде Закрыть при закрытии формы, вызванной в верхней процедуре.
	Если Результат <> Неопределено Тогда  
		мСписокЗначений = Новый СписокЗначений;
		мСписокЗначений.ЗагрузитьЗначения(Результат); 
		// Из стандартной формы выбора возвращаются только значения, выбранные в текущем сеансе.
		// Их надо объединить с теми, что были выбраны ранее.
		Для Каждого Элемент Из мСписокЗначений Цикл
			Если ЭтаФорма.СписокПодразделений.НайтиПоЗначению(Элемент) = Неопределено Тогда
				ЭтаФорма.СписокПодразделений.Добавить(Элемент.Значение, Элемент.Представление);
			КонецЕсли;	
		КонецЦикла;	     	         
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Значения = ЭтаФорма.СписокПодразделений;
  	КонецЕсли; 
КонецПроцедуры    

&НаКлиенте
Процедура СписокПодразделенийКраткийОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	мСписВыб = ЭтаФорма.СписокПодразделений;
	мПараметры = Новый Структура("МножественныйВыбор", Истина);     
	мПараметры.Вставить("ЗакрыватьПослеВыбора", Ложь);  
	мПараметры.Вставить("СписокВыбранных",мСписВыб);     	    
	ДопПараметры = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания4", ЭтотОбъект,ДопПараметры);   	
	ОткрытьФорму("Обработка.МК_НастройкаВыгрузки.Форма.МК_ФормаВыбораПодразделений",мПараметры,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончания4(Результат, ДопПараметры) Экспорт     
	// Результат - это параметр, передаваемый в команде Закрыть при закрытии формы, вызванной в верхней процедуре.
	Если Результат <> Неопределено Тогда  
		// Тут результат - это массив, где первый элемент - список выбранных значений, а второй:
		// 1 - была нажата кнопка ОК, 2 - Показать все
		ЭтаФорма.СписокПодразделений = Результат[0];          
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Значения = Результат[0];    
		Если Результат[1] = 2 Тогда    
			Элемент = Неопределено;
			СтандартнаяОбработка = Истина;
			СписокПодразделенийОткрытие(Элемент, СтандартнаяОбработка);
		КонецЕсли;	
  	КонецЕсли; 
КонецПроцедуры     


&НаКлиенте
Процедура СписокПодразделенийСтруктураОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	мСписВыб = ЭтаФорма.СписокПодразделенийСтруктура.ВыгрузитьЗначения();  
	// В форму выбора подразделений список выбранных значений передается через временное хранилище.
	// То есть надо сохранить массив во временное хранилище, а в форму передать адрес.
	АдресВХранилище = ПоместитьВоВременноеХранилище(мСписВыб);
	мПараметры = Новый Структура("МножественныйВыбор", Истина);  
	мПараметры.Вставить("РежимВыбора", Истина);
	мПараметры.Вставить("ЗакрыватьПослеВыбора", Ложь);  
	мПараметры.Вставить("АдресСпискаПодобранных",АдресВХранилище); 
	мПараметры.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);   

	ДопПараметры = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания6", ЭтотОбъект,ДопПараметры);  	
	ОткрытьФорму("Справочник.СтруктураПредприятия.ФормаВыбора", мПараметры,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца );
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПослеОкончания6(Результат, ДопПараметры) Экспорт     
	// Результат - это параметр, передаваемый в команде Закрыть при закрытии формы, вызванной в верхней процедуре.
	Если Результат <> Неопределено Тогда  
		мСписокЗначений = Новый СписокЗначений;
		мСписокЗначений.ЗагрузитьЗначения(Результат); 
		// Из стандартной формы выбора возвращаются только значения, выбранные в текущем сеансе.
		// Их надо объединить с теми, что были выбраны ранее.
		Для Каждого Элемент Из мСписокЗначений Цикл
			Если ЭтаФорма.СписокПодразделенийСтруктура.НайтиПоЗначению(Элемент) = Неопределено Тогда
				ЭтаФорма.СписокПодразделенийСтруктура.Добавить(Элемент.Значение, Элемент.Представление);
			КонецЕсли;	
		КонецЦикла;	     	         
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Значения = ЭтаФорма.СписокПодразделенийСтруктура;
  	КонецЕсли; 
КонецПроцедуры     

&НаКлиенте
Процедура СписокПодразделенийСтруктураКраткийОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	мСписВыб = ЭтаФорма.СписокПодразделенийСтруктура;
	мПараметры = Новый Структура("МножественныйВыбор", Истина);     
	мПараметры.Вставить("ЗакрыватьПослеВыбора", Ложь);  
	мПараметры.Вставить("СписокВыбранных",мСписВыб);     	    
	ДопПараметры = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания7", ЭтотОбъект,ДопПараметры);   	
	ОткрытьФорму("Обработка.МК_НастройкаВыгрузки.Форма.МК_ФормаВыбораСтруктуры",мПараметры,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончания7(Результат, ДопПараметры) Экспорт     
	// Результат - это параметр, передаваемый в команде Закрыть при закрытии формы, вызванной в верхней процедуре.
	Если Результат <> Неопределено Тогда  
		// Тут результат - это массив, где первый элемент - список выбранных значений, а второй:
		// 1 - была нажата кнопка ОК, 2 - Показать все
		ЭтаФорма.СписокПодразделенийСтруктура = Результат[0];          
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Значения = Результат[0];    
		Если Результат[1] = 2 Тогда    
			Элемент = Неопределено;
			СтандартнаяОбработка = Истина;
			СписокПодразделенийСтруктураОткрытие(Элемент, СтандартнаяОбработка);
		КонецЕсли;	
  	КонецЕсли; 
КонецПроцедуры     

&НаКлиенте
Процедура СписокВидовЗанятостиОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	мСписВыб = ЭтаФорма.СписокВидовЗанятости;
	мПараметры = Новый Структура("МножественныйВыбор", Истина);     
	мПараметры.Вставить("ЗакрыватьПослеВыбора", Ложь);  
	мПараметры.Вставить("СписокВыбранных",мСписВыб);     
	ДопПараметры = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания5", ЭтотОбъект,ДопПараметры);   	
	ОткрытьФорму("Обработка.МК_НастройкаВыгрузки.Форма.МК_ФормаВыбораВидовЗанятости",мПараметры,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончания5(Результат, ДопПараметры) Экспорт     
	// Результат - это параметр, передаваемый в команде Закрыть при закрытии формы, вызванной в верхней процедуре.
	Если Результат <> Неопределено Тогда 
		ЭтаФорма.СписокВидовЗанятости = Результат;
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Значения = Результат;
  	КонецЕсли; 
КонецПроцедуры 


&НаКлиенте
Процедура ОК(Команда)    // Сохранение всех настроек в константы.   
	// Наверное тут надо выполнить проверку заполненности выгружаемых реквизитом, если есть галочка "Применять"
	мРез = ПроверкаФильтровВыгрузкиСотрудников();
	Если мРез Тогда
		СохранитьКонстанты();
		ЭтаФорма.Закрыть();
	Иначе
		ПоказатьПредупреждение(,"Нельзя оставлять пустой список объектов в фильтре списка выгрузки сотрудников при включенной галочке ""Применять"" ");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаФильтровВыгрузкиСотрудников()  
	мРез = Истина;
	мТаб = ЭтаФорма.ФильтрыВыгрузкиСотрудников;
	Для Каждого мСтр Из мТаб Цикл
		Если мСтр.Применять Тогда 		 
			Если мСтр.Значения.Количество() = 0 Тогда
				мРез = Ложь;
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	Возврат мРез;
КонецФункции



&НаКлиенте
Процедура Отмена(Команда)  // Ничего не сохраняем.   
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура Допнастройки(Команда)                                     
	ДопПараметры = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончанияДН", ЭтотОбъект,ДопПараметры);
	ОткрытьФорму("Обработка.МК_НастройкаВыгрузки.Форма.МК_ФормаДопНастроек",,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончанияДН(мРез, ДопПараметры) Экспорт     
	// Тут надо проверить значение константы МК_ВыгружатьОргСтруктуру и возможно перерисовать некоторые строки в таблицах.  
	Если Не мРез = Неопределено Тогда
		Если Не (мРез.ВыгружатьОргСтруктуру = ЭтаФорма.ВыгружатьОргСтруктуру) Тогда    			
			ЭтаФорма.ВыгружатьОргСтруктуру = мРез.ВыгружатьОргСтруктуру;    
			
			// 1 - Выгружаемая информация
			// Искать нужные строки будем перебором
			мТаб = ЭтаФорма.НастройкаВыгружаемойИнформации;	
			Для Каждого мСтр Из мТаб Цикл
				Если мСтр.Реквизит = "Подразделение" Тогда
					Если мРез.ВыгружатьОргСтруктуру Тогда				
						мСтр.НеПоказывать = Истина;
					Иначе	                       
						мСтр.НеПоказывать = Ложь;
					КонецЕсли;	
				КонецЕсли;	
			
				Если мСтр.Реквизит = "Подразделение (структура предприятия)" Тогда
					Если мРез.ВыгружатьОргСтруктуру Тогда				
						мСтр.НеПоказывать = Ложь;
					Иначе	    	                   
						мСтр.НеПоказывать = Истина;
					КонецЕсли;	                						
					Прервать;
				КонецЕсли;	
			КонецЦикла;   
			
			// 2 - Фильтры списка выгрузки
			мТаб = ЭтаФорма.ФильтрыВыгрузкиСотрудников;   
			Для Каждого мСтр Из мТаб Цикл
				Если мСтр.ОбъектФильтра = "Подразделения" Тогда
					Если мРез.ВыгружатьОргСтруктуру Тогда				
						мСтр.НеПоказывать = Истина;
					Иначе	                       
						мСтр.НеПоказывать = Ложь;
					КонецЕсли;	
				КонецЕсли;	
			
				Если мСтр.ОбъектФильтра = "Подразделения (структура предприятия)" Тогда
					Если мРез.ВыгружатьОргСтруктуру Тогда				
						мСтр.НеПоказывать = Ложь;
					Иначе	    	                   
						мСтр.НеПоказывать = Истина;
					КонецЕсли;	                						
					Прервать;
				КонецЕсли;	
			КонецЦикла;   
	
			// 3 - переопределяемые реквизиты
			мТаб = ЭтаФорма.ПереопределяемыеРеквизиты;
			мСтр = мТаб.Получить(3);  
			Если мРез.ВыгружатьОргСтруктуру Тогда
				мСтр.ВидМояКоманда = "Руководитель подразделения (структура предприятия)";
			Иначе	
				мСтр.ВидМояКоманда = "Руководитель подразделения";
			КонецЕсли;			
			
			Элементы.НастройкаВыгружаемойИнформации.Обновить();
			Элементы.ФильтрыВыгрузкиСотрудников.Обновить();
			Элементы.ПереопределяемыеРеквизиты.Обновить();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры    


&НаКлиенте
Процедура ФильтрыВыгрузкиСотрудниковЗначенияОткрытиеМножественногоЗначения(Элемент, Идентификатор, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
КонецПроцедуры          

&НаКлиенте
Процедура ФильтрыВыгрузкиСотрудниковЗначенияПриИзменении(Элемент)    
	мСтрока = Элемент.Родитель.ТекущаяСтрока;
	мСпис = Элемент.Родитель.ТекущиеДанные.Значения;  
	Если мСтрока = 0 Тогда 		 
		ЭтаФорма.СписокОрганизаций = мСпис;				
	ИначеЕсли мСтрока = 1 Тогда	                         
		ЭтаФорма.СписокВидовЗанятости = мСпис;		
	ИначеЕсли мСтрока = 2 Тогда		
		ЭтаФорма.СписокПодразделений = мСпис;     
	ИначеЕсли мСтрока = 3 Тогда          
		ЭтаФорма.СписокДолжностей = мСпис;		
	ИначеЕсли мСтрока = 4 Тогда
		ЭтаФорма.СписокСотрудников = мСпис;
	КонецЕсли;                                
КонецПроцедуры


&НаКлиенте
Процедура ПереопределяемыеРеквизитыВид1СОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.МК_СтандартныйРуководительПодразделения.СтРеквФЛ") Тогда 
		 Если Не ПроверкаСтандартногоРуководителя(1) Тогда
			Сообщить("Стандартный реквизит физическое лицо не поддерживается в текущей конфигурации.");
		КонецЕсли;                                        
	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.МК_СтандартныйРуководительПодразделения.СтРеквПозШР") Тогда
		Если Не ПроверкаСтандартногоРуководителя(2) Тогда
			Сообщить("Стандартный реквизит позиция ШР не поддерживается в текущей конфигурации.");
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры        

&НаСервереБезКонтекста
Функция ПроверкаСтандартногоРуководителя(мРежим) 
	// В КА и ERP нет общего модуля РуководителиПодразделений
	мМодуль = Метаданные.ОбщиеМодули.Найти("РуководителиПодразделений"); 	
	мВозврат = Истина;                        
	Если мМодуль= Неопределено Тогда
		Если мРежим = 2 И (НЕ РуководителиПодразделенийОрганизации.РуководителиПодразделенийИспользуются()) Тогда
			мВозврат = Ложь;			                                                                         
		ИначеЕсли мРежим = 1 Тогда	         
			мВозврат = Ложь;			                                                                         	
		КонецЕсли;          
	Иначе	                                                             
		мСсылкаНаМодуль = ОбщегоНазначения.ОбщийМодуль("РуководителиПодразделений"); 
		Если мРежим = 1 И (НЕ РуководителиПодразделенийОрганизации.РуководителиПодразделенийИспользуются()) Тогда
			мВозврат = Ложь;			                                                                         
		ИначеЕсли мРежим = 2 И  (НЕ мСсылкаНаМодуль.РуководителиПодразделенийИспользуются()) Тогда	         
			мВозврат = Ложь;			                                                                         	
		КонецЕсли;          
	КонецЕсли;	
	Возврат мВозврат;              
КонецФункции

