
&НаКлиенте
Процедура МК_ВыгрузитьСведения(Команда)       
	Режим = РежимДиалогаВопрос.ДаНет;  
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение,"Формирование сведений может занять продолжительное время. Выполнить?", Режим, 0);   
КонецПроцедуры    

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;  
	//Запуск фонового задания на сервере.  
	ДлительнаяОперация = ВыгрузитьСотрВФоне();
 
	//Подключение обработчика завершения фонового задания. 
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ТекстСообщения = "Формирование сведений о сотрудниках...";    
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьСвСотрЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
КонецПроцедуры  

&НаСервере
Функция ВыгрузитьСотрВФоне() 
	НаименованиеЗадания = НСтр("ru = 'Формирование сведений о сотрудниках'");
	ВыполняемыйМетод = "Обработки.МК_ВыгрузкаСотрудников.ВыгрузкаСведСотр";
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	ПараметрыВыполнения.Вставить("мДир", ЭтаФорма.КаталогДляВыгрузкиФайлов); 
	ПараметрыВыполнения.Вставить("мСпособВыгрузки", ЭтаФорма.СпособВыгрузки); 
	
	мАдрес1 = ПоместитьВоВременноеХранилище(,ЭтаФорма.УникальныйИдентификатор); 
	мАдрес2 = ПоместитьВоВременноеХранилище(,ЭтаФорма.УникальныйИдентификатор); 
	мАдрес3 = ПоместитьВоВременноеХранилище(,ЭтаФорма.УникальныйИдентификатор); 
	ПараметрыВыполнения.Вставить("мАдрес1", мАдрес1);  
	ПараметрыВыполнения.Вставить("мАдрес2", мАдрес2);
	ПараметрыВыполнения.Вставить("мАдрес3", мАдрес3); 
	ПараметрыВыполнения.Вставить("ТолькоИзменения",ЭтаФорма.ТолькоИзменения);
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ВыполняемыйМетод, ПараметрыВыполнения);  
КонецФункции   

// Обработка результата выполнения фонового задания.
&НаКлиенте
Процедура ПолучитьСвСотрЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		ПоказатьПредупреждение(, "Выгрузка сведений прервана пользователем");   
 		Возврат;
	КонецЕсли;
 
	Если Результат.Статус = "Ошибка" Тогда
 		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;  
		Возврат;
	Иначе
		мВозврат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
		  
		Если мВозврат[1] Тогда  // Это значит, что есть люди без e-mail       
			мТЗ = ЭтаФорма.Протокол;  
			мТЗ.Очистить();
			мПрот = мВозврат[2];
			Для Каждого мСтрПрот Из мПрот Цикл;
				мСтр = мТЗ.Добавить();
				мСтр.ТабНом = мСтрПрот.ТабНом;
				мСтр.ФИО = мСтрПрот.ФИО;
				мСтр.Организация = мСтрПрот.Организация;
			КонецЦикла;	 
			ТабДок = ДанныеТЗвТД(мТЗ);   
			//ТабДок.Показать();
			Печать(ТабДок);
		КонецЕсли;	 

		Если мВозврат[0] = 1 Тогда       
			Если мВозврат[3] > 0 Тогда
				ПоказатьПредупреждение(, "Выгрузка сведений по сотрудникам завершена. Успешно выгружено записей: "+мВозврат[3]);
			Иначе
				ПоказатьПредупреждение(, "Сотрудников для выгрузки не найдено.");
			КонецЕсли;	
		ИначеЕсли мВозврат[0] = 0 Тогда
			ПоказатьПредупреждение(, "Выгрузка не выполнена: ошибка авторизации.");
		ИначеЕсли мВозврат[0] = 2 Тогда   
			Если мВозврат[3] > 0 Тогда   
				// справочники
				МассивОписаний=Новый Массив;
				Описание=Новый ОписаниеПередаваемогоФайла(); 
				Описание.Имя = мВозврат[5];
				Описание.Хранение = мВозврат[4];         
				МассивОписаний.Добавить(Описание);  
				// Подразделения
				Если мВозврат[7] <> Неопределено Тогда
					Описание=Новый ОписаниеПередаваемогоФайла();
					Описание.Имя = мВозврат[7];   // Тут полное имя возвращается.
					Описание.Хранение = мВозврат[6];
					МассивОписаний.Добавить(Описание);          
				КонецЕсли;
				
				Описание=Новый ОписаниеПередаваемогоФайла();
				Описание.Имя = мВозврат[9];   // Тут полное имя возвращается.
				Описание.Хранение = мВозврат[8];
				МассивОписаний.Добавить(Описание);          
				
				ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов("Подтвердите сохранение файла", Ложь);
				//НачатьПолучениеФайловССервера(МассивОписаний,ПараметрыДиалога);   
				НачатьПолучениеФайловССервера(МассивОписаний);   
				Сообщить("Файл "+мВозврат[5]+" создан.");
				Сообщить("Файл "+мВозврат[7]+" создан.");
				Сообщить("Файл "+мВозврат[9]+" создан.");				
				ПоказатьПредупреждение(, "Выгрузка сведений по сотрудникам в файлы завершена: Успешно выгружено записей: "+мВозврат[3]);
			Иначе                                                                
				ПоказатьПредупреждение(, "Сотрудников для выгрузки не найдено.");
			КонецЕсли	
		КонецЕсли;	
	КонецЕсли; 
КонецПроцедуры


&НаСервереБезКонтекста
Функция ДанныеТЗвТД(мТЗ)
	ТЗ = мТЗ.Выгрузить();
	ТабДок = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;  
	Построитель.ТекстЗаголовка = "Список сотрудников без E-mail";
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТЗ);       
	Построитель.Вывести(ТабДок);
	Построитель.Выполнить();    
	Возврат ТабДок;

КонецФункции 

&НаКлиенте
Процедура Печать(ТабДок)
    // сформируем нужный нам табличный документ
	//    ТабДок = СформироватьТабДок();
    ТабДок.Область(1, , ТабДок.ВысотаТаблицы, ).Имя = "СписокCотрудниковБезE-mail";
    // создадим коллекцию печатных форм, в которую надо будет добавить нужный нам табличный документ
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Протокол");    
	
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Протокол"); 
    // Добавляем в коллекцию (тип массив) сформированный Табличный документ
    ПечатнаяФорма.ТабличныйДокумент = ТабДок;	
    
    ПечатнаяФорма.Экземпляров=1;
    ПечатнаяФорма.СинонимМакета = "Протокол";  // используется для формирования имени файла при сохранении из общей формы печати документов
    // .. и выводим стандартной процедурой БСП     
	
	ПараметрыВывода = УправлениеПечатьюКлиент.ПараметрыПечати(); 
	ПараметрыВывода.ЗаголовокФормы = "МояКоманда. Протокол выгрузки сотрудников";    
	ПараметрыВывода.ВладелецФормы = ЭтаФорма;                                                        	
	Попытка
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ПараметрыВывода);
	Исключение  
		ПоказатьПредупреждение(,"Ошибка печати. Не удалось вывести список сотрудников без e-mail.");
	КонецПопытки	
		
КонецПроцедуры


&НаКлиенте
Процедура КаталогДляВыгрузкиФайловНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ЭтаФорма.КаталогДляВыгрузкиФайлов; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	Если ДиалогОткрытия.Выбрать() Тогда   
		ЭтаФорма.КаталогДляВыгрузкиФайлов = ДиалогОткрытия.Каталог; 
	КонецЕсли;  
	СохранитьНастройки();
	//ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры


&НаКлиенте
Процедура КаталогДляВыгрузкиФайловПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры  

&НаСервере
Процедура СохранитьНастройки()
	Константы.МК_КаталогДляВыгрузкиФайлов.Установить(ЭтаФорма.КаталогДляВыгрузкиФайлов);
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	ЭтаФорма.КаталогДляВыгрузкиФайлов = Константы.МК_КаталогДляВыгрузкиФайлов.Получить();
	ЭтаФорма.СпособВыгрузки = 1;
КонецПроцедуры


