&НаСервере
Процедура ВыполнитьКоманду()   Экспорт	
	// Выгрузка выполняется за прошлый месяц.  
	ИмяСобытия = "МояКоманда. Выгрузка данных о заработной плате.";
	мВыгрузкаРЛ = Константы.МК_ВыгружатьРЛ.Получить();  
	мВыгрузкаЗП = Константы.МК_ВыгружатьДанныеОЗП.Получить();
	Если (Не мВыгрузкаРЛ) И (Не мВыгрузкаЗП) Тогда                                              
		мРез = "Не выбраны действия для выгрузки данных. Задача не выполнена.";	
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, мРез);
		Возврат;
	КонецЕсли;	
	мДата = ТекущаяДата();
	мГод = Формат(Год(мДата),"ЧГ=0");
	мМесяц = Месяц(мДата)-1;
	Если мМесяц = 0 Тогда
		мМесяц = 12;
		мГод = мГод -1;
	КонецЕсли;

	мРез = "";
	ПараметрыВыполнения = Новый Структура;	
	ПараметрыВыполнения.Вставить("мГод", мГод); 
	ПараметрыВыполнения.Вставить("мМесяц", мМесяц);    			
	ПараметрыВыполнения.Вставить("ИнтерактивныйРежим", Ложь); 
	ПараметрыВыполнения.Вставить("ВыгружатьДанныеОЗП",мВыгрузкаЗП);
	ПараметрыВыполнения.Вставить("ВыгружатьРЛ",мВыгрузкаРЛ);

		
	мВозврат = Обработки.МК_РасчетныеЛистки.ВыгрузкаРЛ(ПараметрыВыполнения);      
	// мВозврат - массив:
	// [0] - итог: 0 - ошибка авторизации, 1 - ошибка отправки архива табулек, 2 - ошибка отправки описания, 3 - все получилось
	// [1] - кол-во сформированных табулек.
	Если мВозврат[1] = 0 Тогда
		мРез = "Сотрудников для выгрузки не найдено";
	Иначе	
		Если мВозврат[0] = 3 Тогда       
			мРез =  "Выгрузка расчетных листков завершена. Успешно выгружено документов: "+мВозврат[1];		
		ИначеЕсли мВозврат[0] = 0 Тогда
			мРез = "Выгрузка не выполнена: ошибка авторизации.";
		ИначеЕсли мВозврат[0] = 1 Тогда
			мРез = "Выгрузка не выполнена: ошибка отправки архива расчетных листков.";
		ИначеЕсли мВозврат[0] = 2 Тогда
			мРез = "Выгрузка выполнена частично: ошибка отправки описания расчетных листков.";	
		КонецЕсли;	
	КонецЕсли;			
	Если мВозврат[1] = 0 ИЛИ мВозврат[0] = 3 Тогда 
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, мРез);
	Иначе                                                                                  
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, мРез);
	КонецЕсли;	
КонецПроцедуры  
