
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  Экспорт
	// Нужно вытащить список наших регламентных заданий.    
	мСписок = Новый Массив;
	мЗадачи = Новый Массив;
	мЗадачи.Добавить("МК_ФоноваяВыгрузкаСотрудниковПолная");
	мЗадачи.Добавить("МК_ФоноваяВыгрузкаСотрудниковТолькоИзменения"); 
	мЗадачи.Добавить("МК_ВыгрузкаОстатковОтпусков");
	мЗадачи.Добавить("МК_ВыгрузкаРасчетныхЛистков");
	мЗадачи.Добавить("МК_ПолучениеЗаявок");
	мРаботаСКЭДО = Константы.МК_РаботаемСКЭДО.Получить();
	Если мРаботаСКЭДО Тогда
		мЗадачи.Добавить("МК_СинхронизацияКЭДО"); 
		мЗадачи.Добавить("МК_ПолучениеЗаявлений");
		мЗадачи.Добавить("МК_ПолучениеДокументовКЭДО");
	КонецЕсли;	
	Для Каждого мЗадача ИЗ мЗадачи Цикл		  
		мОтбор = Новый Структура("Метаданные",мЗадача);
		мОЗ = РегламентныеЗаданияСервер.НайтиЗадания(мОтбор);
		Если мОЗ.Количество() <> 0 Тогда
			мСписок.Добавить(мОЗ[0]);
		КонецЕсли;	
	КонецЦикла;   
	// Проверить, что задания найдены.
	Если мСписок.Количество() > 0 Тогда
		Для Каждого мЗадача Из мСписок Цикл
			мНоваяСтрока = ЭтаФорма.СписокРегламентныхЗаданий.Добавить();
			мНоваяСтрока.Включено = мЗадача.Использование; 
			мНоваяСтрока.Наименование = мЗадача.Метаданные;	
			мНоваяСтрока.Идентификатор = мЗадача.УникальныйИдентификатор; 
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокРегламентныхЗаданийПередНачаломИзменения(Элемент, Отказ)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Действие", "Изменить");
	
	ПараметрыФормы.Вставить("Идентификатор", Элементы.СписокРегламентныхЗаданий.ТекущиеДанные.Идентификатор); 
	ДопПараметры = Неопределено;  	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект,ДопПараметры);
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание", ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры   

&НаКлиенте
Процедура ВыполнитьПослеОкончания(Результат, ДопПараметры) Экспорт     
	// Результат - это параметр, передаваемый в команде Закрыть при закрытии формы, вызванной в верхней процедуре.   
	мВключено = ПолучитьВключено(Элементы.СписокРегламентныхЗаданий.ТекущиеДанные.Идентификатор); 
	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Включено = мВключено;	
КонецПроцедуры    


&НаСервере
Функция ПолучитьВключено(мИдент)  	
	мЗадача = РегламентныеЗаданияСервер.Задание(мИдент);
	Возврат мЗадача.Использование;
КонецФункции	

